Repository: ONSdigital/eq-questionnaire-schemas
Catalog: translations/*/ccs_household_gb_wls_*.po
Languages: cy

source: A <strong>household</strong> is one person living alone, or a group of people (not necessarily related), who share cooking facilities <strong>and</strong> share a living room, <strong>or</strong> sitting room, <strong>or</strong> dining area
cy: Mae <strong>cartref</strong> yn golygu un person sy’n byw ar ei ben ei hun neu grŵp o bobl (nid oes rhaid iddyn nhw berthyn i’w gilydd) sy’n rhannu cyfleusterau coginio <strong>ac</strong> yn rhannu ystafell fyw, <strong>neu</strong> lolfa, <strong>neu</strong> le bwyta

# Were you usually living at {household_address} on Sunday {census_date}?
source: Tell the respondent to turn to <strong>Showcard 1</strong> or show them the <strong>Electronic Showcard</strong> below
cy: Dywedwch wrth yr ymatebwr am droi at <strong>Gerdyn Dangos 1</strong> neu dangoswch y <strong>Cerdyn Dangos Electronig</strong> isod iddo

# Who do you need to add?
source: Enter a full stop (.) if the respondent does not know a person’s “First name” or “Last name”
cy: Rhowch atalnod llawn (.) os nad yw’r ymatebwr yn gwybod beth yw "Enw cyntaf" neu "Cyfenw" person

# Did anyone else usually live in your household on Sunday {census_date}?
source: Tell the respondent to turn to <strong>Showcard 2</strong> or show them the <strong>Electronic Showcard</strong> below
cy: Dywedwch wrth yr ymatebwr am droi at <strong>Gerdyn Dangos 2</strong> neu dangoswch y <strong>Cerdyn Dangos Electronig</strong> isod iddo

source: Tell the respondent to double-check <strong>Showcard 2</strong> or show them the <strong>Electronic Showcard</strong> below
cy: Dywedwch wrth yr ymatebwr am ailedrych ar <strong>Gerdyn Dangos 2</strong> neu dangoswch y <strong>Cerdyn Dangos Electronig</strong> isod iddo

source: Tell the respondent to turn to <strong>Showcard 13</strong> or show them the <strong>Electronic Showcard</strong> below
cy: Dywedwch wrth yr ymatebwr am droi at <strong>Gerdyn Dangos 13</strong> neu dangoswch y <strong>Cerdyn Dangos Electronig</strong> isod iddo

source: Tell the respondent to turn to <strong>Showcard 13</strong> or show them the <strong>Electronic Showcard</strong> below
cy: Dywedwch wrth yr ymatebwr am droi at <strong>Gerdyn Dangos 13</strong> neu dangoswch y <strong>Cerdyn Dangos Electronig</strong> isod iddo

# What is the name of the visitor who stayed overnight?
source: Enter a full stop (.) if the respondent does not know a person’s “First name” or “Last name”
cy: Rhowch atalnod llawn (.) os nad yw’r ymatebwr yn gwybod "Enw cyntaf" neu "Cyfenw" person

# What is the name of the {ordinality} visitor who stayed overnight?
source: Enter a full stop (.) if the respondent does not know a person’s “First name” or “Last name”
cy: Rhowch atalnod llawn (.) os nad yw’r ymatebwr yn gwybod "Enw cyntaf" neu "Cyfenw" person

# What type of accommodation is this?
source: Tell the respondent to turn to <strong>Showcard 3</strong> or show them the options below
cy: Dywedwch wrth yr ymatebwr am droi at <strong>Gerdyn Dangos 3</strong> neu dangoswch yr opsiynau isod iddo

# What type of accommodation was that?
source: Tell the respondent to turn to <strong>Showcard 3</strong> or show them the options below
cy: Dywedwch wrth yr ymatebwr am droi at <strong>Gerdyn Dangos 3</strong> neu dangoswch yr opsiynau isod iddo

# Which of the following is your house or bungalow?
source: Ask the respondent to continue looking at <strong>Showcard 3</strong> or show them the options below
cy: Gofynnwch i’r ymatebwr barhau i edrych ar <strong>Gerdyn Dangos 3</strong> neu dangoswch yr opsiynau isod iddo

# Which of the following was your house or bungalow?
source: Ask the respondent to continue looking at <strong>Showcard 3</strong> or show them the options below
cy: Gofynnwch i’r ymatebwr barhau i edrych ar <strong>Gerdyn Dangos 3</strong> neu dangoswch yr opsiynau isod iddo

# Where is your flat, maisonette or apartment?
source: Ask the respondent to continue looking at <strong>Showcard 3</strong> or show them the options below
cy: Gofynnwch i’r ymatebwr barhau i edrych ar <strong>Gerdyn Dangos 3</strong> neu dangoswch yr opsiynau isod iddo

# Where was your flat, maisonette or apartment?
source: Ask the respondent to continue looking at <strong>Showcard 3</strong> or show them the options below
cy: Gofynnwch i’r ymatebwr barhau i edrych ar <strong>Gerdyn Dangos 3</strong> neu dangoswch yr opsiynau isod iddo

source: If “No” confirm one or more rooms are shared with another household
cy: Os "Nac ydy", cadarnhewch fod un neu fwy o'r ystafelloedd yn cael eu rhannu â chartref arall

source: If “No” confirm one or more rooms were shared with another household
cy: Os "Nac oedd", cadarnhewch fod un neu fwy o'r ystafelloedd yn cael eu rhannu â chartref arall

# Does your household own or rent this accommodation?
source: Tell the respondent to turn to <strong>Showcard 4</strong> or show them the options below
cy: Dywedwch wrth yr ymatebwr am droi at <strong>Gerdyn Dangos 4</strong> neu dangoswch yr opsiynau isod iddo

# Did your household own or rent that accommodation?
source: Tell the respondent to turn to <strong>Showcard 4</strong> or show them the options below
cy: Dywedwch wrth yr ymatebwr am droi at <strong>Gerdyn Dangos 4</strong> neu dangoswch yr opsiynau isod iddo

# Who is your landlord?
source: Tell the respondent to turn to <strong>Showcard 5</strong> or show them the options below
cy: Dywedwch wrth yr ymatebwr am droi at <strong>Gerdyn Dangos 5</strong> neu dangoswch yr opsiynau isod iddo

# Who was your landlord?
source: Tell the respondent to turn to <strong>Showcard 5</strong> or show them the options below
cy: Dywedwch wrth yr ymatebwr am droi at <strong>Gerdyn Dangos 5</strong> neu dangoswch yr opsiynau isod iddo

# How do you and the people in your household connect to the internet at home?
source: Tell the respondent to turn to <strong>Showcard 6</strong> or show them the options below
cy: Dywedwch wrth yr ymatebwr am droi at <strong>Gerdyn Dangos 6</strong> neu dangoswch yr opsiynau isod iddo

# How did you and the people in your household connect to the internet at home?
source: Tell the respondent to turn to <strong>Showcard 6</strong> or show them the options below
cy: Dywedwch wrth yr ymatebwr am droi at <strong>Gerdyn Dangos 6</strong> neu dangoswch yr opsiynau isod iddo

source: Tell the respondent to turn to <strong>Showcard 7</strong> or show them the options below
cy: Dywedwch wrth yr ymatebwr am droi at <strong>Gerdyn Dangos 7</strong> neu dangoswch yr opsiynau isod iddo

source: Tell the respondent to turn to <strong>Showcard 8</strong> or show them the options below
cy: Dywedwch wrth yr ymatebwr am droi at <strong>Gerdyn Dangos 8</strong> neu dangoswch yr opsiynau isod iddo

source: Tell the respondent to turn to <strong>Showcard 8</strong> or show them the options below
cy: Dywedwch wrth yr ymatebwr am droi at <strong>Gerdyn Dangos 8</strong> neu dangoswch yr opsiynau isod iddo

# What is your ethnic group?
source: Tell the respondent to turn to <strong>Showcard 9W</strong> or show them the options below
cy: Dywedwch wrth yr ymatebwr am droi at <strong>Gerdyn Dangos 9W</strong> neu dangoswch yr opsiynau isod iddo

# What is <em>{person_name_possessive}</em> ethnic group?
source: Tell the respondent to turn to <strong>Showcard 9W</strong> or show them the options below
cy: Dywedwch wrth yr ymatebwr am droi at <strong>Gerdyn Dangos 9W</strong> neu dangoswch yr opsiynau isod iddo

# Which one best describes your White ethnic group or background?
source: Ask the respondent to continue looking at <strong>Showcard 9W</strong> or show them the options below
cy: Gofynnwch i'r ymatebwr barhau i edrych ar <strong>Gerdyn Dangos 9W</strong> neu dangoswch yr opsiynau isod iddo

source: Ask the respondent to continue looking at <strong>Showcard 9W</strong> or show them the options below
cy: Gofynnwch i'r ymatebwr barhau i edrych ar <strong>Gerdyn Dangos 9W</strong> neu dangoswch yr opsiynau isod iddo

# Which one best describes your Mixed or Multiple ethnic group or background?
source: Ask the respondent to continue looking at <strong>Showcard 9W</strong> or show them the options below
cy: Gofynnwch i'r ymatebwr barhau i edrych ar <strong>Gerdyn Dangos 9W</strong> neu dangoswch yr opsiynau isod iddo

source: Ask the respondent to continue looking at <strong>Showcard 9W</strong> or show them the options below
cy: Gofynnwch i'r ymatebwr barhau i edrych ar <strong>Gerdyn Dangos 9W</strong> neu dangoswch yr opsiynau isod iddo

source: Ask the respondent to continue looking at <strong>Showcard 9W</strong> or show them the options below
cy: Gofynnwch i'r ymatebwr barhau i edrych ar <strong>Gerdyn Dangos 9W</strong> neu dangoswch yr opsiynau isod iddo

source: Ask the respondent to continue looking at <strong>Showcard 9W</strong> or show them the options below
cy: Gofynnwch i'r ymatebwr barhau i edrych ar <strong>Gerdyn Dangos 9W</strong> neu dangoswch yr opsiynau isod iddo

source: Ask the respondent to continue looking at <strong>Showcard 9W</strong> or show them the options below
cy: Gofynnwch i'r ymatebwr barhau i edrych ar <strong>Gerdyn Dangos 9W</strong> neu dangoswch yr opsiynau isod iddo

source: Ask the respondent to continue looking at <strong>Showcard 9W</strong> or show them the options below
cy: Gofynnwch i'r ymatebwr barhau i edrych ar <strong>Gerdyn Dangos 9W</strong> neu dangoswch yr opsiynau isod iddo

# Which one best describes your other ethnic group or background?
source: Ask the respondent to continue looking at <strong>Showcard 9W</strong> or show them the options below
cy: Gofynnwch i'r ymatebwr barhau i edrych ar <strong>Gerdyn Dangos 9W</strong> neu dangoswch yr opsiynau isod iddo

source: Ask the respondent to continue looking at <strong>Showcard 9W</strong> or show them the options below
cy: Gofynnwch i'r ymatebwr barhau i edrych ar <strong>Gerdyn Dangos 9W</strong> neu dangoswch yr opsiynau isod iddo

# During the week of 15 to {census_date}, were you doing any of the following?
source: Tell the respondent to turn to <strong>Showcard 10</strong> or show them the options below
cy: Dywedwch wrth yr ymatebwr am droi at <strong>Gerdyn Dangos 10</strong> neu dangoswch yr opsiynau isod iddo

source: Tell the respondent to turn to <strong>Showcard 10</strong> or show them the options below
cy: Dywedwch wrth yr ymatebwr am droi at <strong>Gerdyn Dangos 10</strong> neu dangoswch yr opsiynau isod iddo

source: Tell the respondent to turn to <strong>Showcard 11</strong> or show them the options below
cy: Dywedwch wrth yr ymatebwr am droi at <strong>Gerdyn Dangos 11</strong> neu dangoswch yr opsiynau isod iddo

source: Tell the respondent to turn to <strong>Showcard 11</strong> or show them the options below
cy: Dywedwch wrth yr ymatebwr am droi at <strong>Gerdyn Dangos 11</strong> neu dangoswch yr opsiynau isod iddo

source: Tell the respondent to turn to <strong>Showcard 12</strong> or show them the options below
cy: Dywedwch wrth yr ymatebwr am droi at <strong>Gerdyn Dangos 12</strong> neu dangoswch yr opsiynau isod iddo

source: Tell the respondent to turn to <strong>Showcard 12</strong> or show them the options below
cy: Dywedwch wrth yr ymatebwr am droi at <strong>Gerdyn Dangos 12</strong> neu dangoswch yr opsiynau isod iddo

# Is there any other living accommodation at {household_address}?
source: If yes, ensure this accommodation is recorded on the Totalmobile App and interview household
cy: Os oes, sicrhewch fod y man hwn yn cael ei gofnodi ar yr Ap Totalmobile a chynhaliwch gyfweliad â’r cartref

source: If yes, record these people on the Totalmobile App and interview them, if at this address
cy: Os oedd, cofnodwch y bobl hyn ar yr Ap Totalmobile a chynhaliwch gyfweliad â nhw, os ydyn nhw yn y cyfeiriad hwn

# Are you sure you want to remove <em>{person_name}</em>?
source: All of the information entered about this person will be deleted
cy: Caiff yr holl wybodaeth a roddwyd am y person hwn ei dileu

# Were you usually living at {household_address} on Sunday {census_date}?
source: Electronic Showcard
cy: Cerdyn Dangos Electronig

# Did anyone else usually live in your household on Sunday {census_date}?
source: Electronic Showcard
cy: Cerdyn Dangos Electronig

source: Electronic Showcard
cy: Cerdyn Dangos Electronig

source: Electronic Showcard
cy: Cerdyn Dangos Electronig

source: Electronic Showcard
cy: Cerdyn Dangos Electronig

# Were you usually living at {household_address} on Sunday {census_date}?
source: “Usually living at” means:
cy: Ystyr “byw fel arfer” yw:

# Were you usually living at {household_address} on Sunday {census_date}?
source: The address at which you generally spend most time. For most people this will be their permanent or family home.
cy: Y cyfeiriad lle rydych chi'n treulio'r rhan fwyaf o amser ar y cyfan. I'r rhan fwyaf o bobl, hwn fydd eu cartref parhaol neu gartref y teulu.

# Did anyone else usually live in your household on Sunday {census_date}?
source: <strong>Include</strong>
cy: <strong>Dylech gynnwys</strong>

source: <strong>Include people temporarily away such as</strong>
cy: <strong>Dylech gynnwys pobl a oedd yn aros dros dro er enghraifft</strong>

source: <strong>Include people temporarily staying such as</strong>
cy: <strong>Dylech gynnwys pobl a oedd yn aros dros dro er enghraifft</strong>

source: <strong>Include</strong>
cy: <strong>Dylech gynnwys</strong>

source: Or
cy: Neu

source: <strong>Include</strong>
cy: <strong>Dylech gynnwys</strong>

source: Or
cy: Neu

# Were you usually living at {household_address} on Sunday {census_date}?
source: <strong>Full-time students</strong> should include themselves here.
cy: Dylai <strong>myfyrwyr amser llawn</strong> gynnwys eu hunain yma.

# Were you usually living at {household_address} on Sunday {census_date}?
source: <strong>Armed forces members</strong> should include themselves at their home address if they have one.
cy: Dylai <strong>aelodau o’r lluoedd arfog</strong> gynnwys eu hunain yn eu cyfeiriad cartref os oes un ganddyn nhw.

# Were you usually living at {household_address} on Sunday {census_date}?
source: Include <strong>anyone temporarily outside the UK</strong>, if this was for less than 12 months.
cy: Dylech gynnwys <strong>unrhyw un sydd y tu allan i’r Deyrnas Unedig dros dro</strong>, os oedd hyn am lai na 12 mis.

# Did anyone else usually live in your household on Sunday {census_date}?
source: family members (including partners, children and babies born on or before {census_date} even if still in hospital)
cy: aelodau o’r teulu (gan gynnwys partneriaid, plant a babanod a anwyd ar {census_date} neu cyn hynny hyd yn oed os oeddent yn yr ysbyty o hyd)

# Did anyone else usually live in your household on Sunday {census_date}?
source: students and schoolchildren who lived away from home during term time
cy: myfyrwyr a phlant ysgol a oedd yn byw i ffwrdd o’r cartref yn ystod y tymor

# Did anyone else usually live in your household on Sunday {census_date}?
source: housemates, tenants or lodgers
cy: tenantiaid, lojers neu bobl a oedd yn rhannu‘r cartref

# Did anyone else usually live in your household on Sunday {census_date}?
source: people who usually lived here on {census_date} but have since moved out
cy: pobl a oedd fel arfer yn byw yma ar {census_date} ond sydd wedi symud allan ers hynny

source: people who worked away from home within the UK, or members of the armed forces, if this was their permanent or family home
cy: pobl a oedd yn gweithio i ffwrdd o'r cartref yn y Deyrnas Unedig, neu aelodau o'r lluoedd arfog, os mai hwn oedd eu cartref parhaol neu gartref y teulu

source: people staying or expecting to stay in an establishment such as a hospital, care home or hostel for <strong>less than 6 months</strong>, if this was their permanent or family home
cy: pobl a oedd yn aros, neu a oedd yn disgwyl aros, mewn sefydliad fel ysbyty, cartref gofal neu hostel am <strong>lai na 6 mis</strong>, os mai hwn oedd eu cartref parhaol neu gartref y teulu

source: prisoners with a sentence of <strong>less than 12 months</strong>
cy: carcharorion â dedfryd o <strong>lai na 12 mis</strong>

source: people who were temporarily outside the UK for <strong>less than 12 months</strong>
cy: pobl a oedd y tu allan i'r Deyrnas Unedig dros dro am <strong>lai na 12 mis</strong>

source: other people who usually lived with your household, but were temporarily away, for example, at a second address for work or on holiday
cy: pobl eraill a oedd fel arfer yn byw yn eich cartref, ond a oedd i ffwrdd o’r cartref dros dro, er enghraifft, mewn ail gyfeiriad ar gyfer gwaith neu ar wyliau

source: people staying temporarily who did not have another UK address, for example, UK residents between addresses or currently without a home
cy: pobl a oedd yn aros dros dro a oedd heb gyfeiriad arall yn y Deyrnas Unedig, er enghraifft, preswylwyr y Deyrnas Unedig a oedd rhwng cyfeiriadau neu heb gartref ar y pryd

source: people from outside the UK who were staying in the UK for <strong>3 months or more</strong>
cy: pobl o'r tu allan i'r Deyrnas Unedig a oedd yn aros yn y Deyrnas Unedig am <strong>3 mis neu fwy</strong>

source: people who usually lived somewhere else in the UK, for example, boyfriends, girlfriends, friends or relatives
cy: pobl a oedd fel arfer yn byw yn rhywle arall yn y Deyrnas Unedig, er enghraifft, cariadon, ffrindiau neu berthnasau

source: people staying because it was their second address, for example, for work – their permanent or family home was elsewhere
cy: pobl a oedd yn aros yma gan mai dyma eu hail gyfeiriad, er enghraifft, oherwydd gwaith. Roedd eu cyfeiriad parhaol neu gartref y teulu yn rhywle arall

source: people who usually lived outside the UK who were staying in the UK for <strong>less than 3 months</strong>
cy: pobl a oedd yn byw y tu allan i’r Deyrnas Unedig fel arfer, ac a oedd yn aros yn y Deyrnas Unedig am <strong>lai na 3 mis</strong>

source: people staying on holiday
cy: pobl a oedd ar wyliau

source: there were no visitors staying overnight on {census_date}
cy: nid oedd unrhyw ymwelwyr yn aros dros nos ar {census_date}

source: people who usually lived somewhere else in the UK, for example, boyfriends, girlfriends, friends or relatives
cy: pobl a oedd fel arfer yn byw yn rhywle arall yn y Deyrnas Unedig, er enghraifft, cariadon, ffrindiau neu berthnasau

source: people staying because it was their second address, for example, for work – their permanent or family home was elsewhere
cy: pobl a oedd yn aros yma gan mai dyma eu hail gyfeiriad, er enghraifft, oherwydd gwaith. Roedd eu cyfeiriad parhaol neu gartref y teulu yn rhywle arall

source: people who usually lived outside the UK who were staying in the UK for <strong>less than 3 months</strong>
cy: pobl a oedd yn byw y tu allan i’r Deyrnas Unedig fel arfer, ac a oedd yn aros yn y Deyrnas Unedig am <strong>lai na 3 mis</strong>

source: people staying on holiday
cy: pobl a oedd ar wyliau

source: there were no visitors staying overnight on {census_date}
cy: nid oedd unrhyw ymwelwyr yn aros dros nos ar {census_date}

# What is your full name?
source: First name
cy: Enw cyntaf

# What is your full name?
source: Middle names
cy: Enwau canol

# What is your full name?
source: Last name
cy: Cyfenw

# Who do you need to add?
source: First name
cy: Enw cyntaf

# Who do you need to add?
source: Middle names
cy: Enwau canol

# Who do you need to add?
source: Last name
cy: Cyfenw

# Change details for <em>{person_name}</em> (You)
source: First name
cy: Enw cyntaf

# Change details for <em>{person_name}</em> (You)
source: Middle names
cy: Enwau canol

# Change details for <em>{person_name}</em> (You)
source: Last name
cy: Cyfenw

# Change details for <em>{person_name}</em>
source: First name
cy: Enw cyntaf

# Change details for <em>{person_name}</em>
source: Middle names
cy: Enwau canol

# Change details for <em>{person_name}</em>
source: Last name
cy: Cyfenw

# What is the name of the visitor who stayed overnight?
source: First name
cy: Enw cyntaf

# What is the name of the visitor who stayed overnight?
source: Last name
cy: Cyfenw

# What is the name of the {ordinality} visitor who stayed overnight?
source: First name
cy: Enw cyntaf

# What is the name of the {ordinality} visitor who stayed overnight?
source: Last name
cy: Cyfenw

# What was your age on your last birthday?
source: Age
cy: Oed

# What was <em>{person_name_possessive}</em> age on their last birthday?
source: Age
cy: Oed

# Were you usually living at {household_address} on Sunday {census_date}?
source: Yes
cy: Oeddwn

# Were you usually living at {household_address} on Sunday {census_date}?
source: No
cy: Nac oeddwn

source: Yes
cy: Oedd

source: No
cy: Nac oedd

# On Sunday {census_date}, was your usual address in the UK?
source: Yes
cy: Oedd

# On Sunday {census_date}, was your usual address in the UK?
source: No
cy: Nac oedd

source: OK, understood
cy: Iawn, wedi deall

# Did anyone else usually live in your household on Sunday {census_date}?
source: Yes
cy: Oedd

# Did anyone else usually live in your household on Sunday {census_date}?
source: No
cy: Nac oedd

# Are you sure you want to remove <em>{person_name}</em>?
source: Yes
cy: Ydw

# Are you sure you want to remove <em>{person_name}</em>?
source: No
cy: Nac ydw

source: Yes
cy: Oes

source: No
cy: Nac oes

# Are any of these people related to each other?
source: Yes
cy: Oes

# Are any of these people related to each other?
source: No, all household members are unrelated
cy: Nac oes, nid oes neb yn perthyn

source: 1 or more
cy: 1 neu fwy

source: None
cy: Dim

source: 1 or more
cy: 1 neu fwy

source: None
cy: Dim

# Were there any other visitors staying overnight on Sunday {census_date}?
source: Yes
cy: Oedd

# Were there any other visitors staying overnight on Sunday {census_date}?
source: No
cy: Nac oedd

# Was the respondent living at {household_address} on Sunday {census_date}?
source: Yes, living at this address
cy: Oedd, roedd yn byw yn y cyfeiriad hwn

# Was the respondent living at {household_address} on Sunday {census_date}?
source: No, living at a different address
cy: Nac oedd, roedd yn byw mewn cyfeiriad gwahanol

# What type of accommodation is this?
source: Whole house or bungalow
cy: Tŷ neu fyngalo cyfan

# What type of accommodation is this?
source: Flat, maisonette or apartment
cy: Fflat neu maisonette

# What type of accommodation is this?
source: Caravan or other mobile or temporary structure
cy: Carafán neu fath arall o gartref symudol neu dros dro

# What type of accommodation was that?
source: Whole house or bungalow
cy: Tŷ neu fyngalo cyfan

# What type of accommodation was that?
source: Flat, maisonette or apartment
cy: Fflat neu maisonette

# What type of accommodation was that?
source: Caravan or other mobile or temporary structure
cy: Carafán neu fath arall o gartref symudol neu dros dro

# Which of the following is your house or bungalow?
source: Detached
cy: Adeilad ar wahân

# Which of the following is your house or bungalow?
source: Semi-detached
cy: Tŷ neu fyngalo semi

# Which of the following is your house or bungalow?
source: Terraced
cy: Tŷ neu fyngalo mewn teras

# Which of the following was your house or bungalow?
source: Detached
cy: Adeilad ar wahân

# Which of the following was your house or bungalow?
source: Semi-detached
cy: Tŷ neu fyngalo semi

# Which of the following was your house or bungalow?
source: Terraced
cy: Tŷ neu fyngalo mewn teras

# Where is your flat, maisonette or apartment?
source: In a purpose-built block of flats or tenement
cy: Mewn bloc o fflatiau neu denement a adeiladwyd yn bwrpasol

# Where is your flat, maisonette or apartment?
source: Part of a converted or shared house
cy: Yn rhan o dŷ wedi’i addasu neu dŷ sy’n cael ei rannu

# Where is your flat, maisonette or apartment?
source: Part of another converted building
cy: Yn rhan o adeilad arall wedi’i addasu
