Repository: ONSdigital/eq-questionnaire-schemas
Catalog: translations/*/ccs_household_gb_wls_*.po
Languages: cy

source: Freelance means that they are self-employed and work for different companies or people on particular pieces of work
cy: Mae gweithio ar ei liwt ei hun yn golygu bod yr unigolyn yn hunangyflogedig ac yn gweithio i wahanol gwmnïau neu bobl ar ddarnau penodol o waith. Gair arall am hyn yw llawrydd

source: Whether receiving a pension or not
cy: Gan dderbyn pensiwn neu beidio

source: Whether receiving a pension or not
cy: Gan dderbyn pensiwn neu beidio

source: Moved since {census_date}
cy: Wedi symud ers {census_date}

source: Moved since {census_date}
cy: Wedi symud ers {census_date}

# Did <em>{person_name}</em> usually live in the UK?
source: Select to enter answer
cy: Dewiswch i roi ateb

# On Sunday {census_date}, was your usual address in the UK?
source: Enter current name of country
cy: Nodwch enw presennol y wlad

# Which one best describes your White ethnic group or background?
source: Enter White ethnic group or background
cy: Nodwch grŵp ethnig neu gefndir Gwyn

source: Enter White ethnic group or background
cy: Nodwch grŵp ethnig neu gefndir Gwyn

# Which one best describes your Mixed or Multiple ethnic group or background?
source: Enter Mixed or Multiple ethnic group or background
cy: Nodwch grŵp ethnig neu gefndir Cymysg neu Amlethnig

source: Enter Mixed or Multiple ethnic group or background
cy: Nodwch grŵp ethnig neu gefndir Cymysg neu Amlethnig

source: Enter Asian ethnic group or background
cy: Nodwch grŵp ethnig neu gefndir Asiaidd

source: Enter Asian ethnic group or background
cy: Nodwch grŵp ethnig neu gefndir Asiaidd

source: Enter African ethnic group or background
cy: Nodwch grŵp ethnig neu gefndir Affricanaidd

source: Enter Black, Black British or Caribbean ethnic group or background
cy: Nodwch grŵp ethnig neu gefndir Du, Du Prydeinig neu Garibïaidd

source: Enter African ethnic group or background
cy: Nodwch grŵp ethnig neu gefndir Affricanaidd

source: Enter Black, Black British or Caribbean ethnic group or background
cy: Nodwch grŵp ethnig neu gefndir Du, Du Prydeinig neu Garibïaidd

# Which one best describes your other ethnic group or background?
source: Enter other ethnic group or background
cy: Nodwch grŵp ethnig neu gefndir arall

source: Enter other ethnic group or background
cy: Nodwch grŵp ethnig neu gefndir arall

# Did <em>{person_name}</em> usually live in the UK?
source: Enter current name of country
cy: Nodwch enw presennol y wlad
