Repository: ONSdigital/eq-questionnaire-schemas
Catalog: translations/*/ccs_household_gb_wls_*.po
Languages: cy

# Where is your flat, maisonette or apartment?
source: In a commercial building
cy: Mewn adeilad masnachol

# Where was your flat, maisonette or apartment?
source: In a purpose-built block of flats or tenement
cy: Mewn bloc o fflatiau neu denement a adeiladwyd yn bwrpasol

# Where was your flat, maisonette or apartment?
source: Part of a converted or shared house
cy: Yn rhan o dŷ wedi’i addasu neu dŷ sy’n cael ei rannu

# Where was your flat, maisonette or apartment?
source: Part of another converted building
cy: Yn rhan o adeilad arall wedi’i addasu

# Where was your flat, maisonette or apartment?
source: In a commercial building
cy: Mewn adeilad masnachol

source: Yes
cy: Ydy

source: No
cy: Nac ydy

source: Yes
cy: Oedd

source: No
cy: Nac oedd

# Does your household own or rent this accommodation?
source: Owns outright
cy: Yn berchen arno’n gyfan gwbl

# Does your household own or rent this accommodation?
source: Owns with a mortgage or loan
cy: Yn berchen arno gyda morgais neu fenthyciad

# Does your household own or rent this accommodation?
source: Part-owns and part-rents
cy: Yn berchen arno’n rhannol ac yn ei rentu’n rhannol

# Does your household own or rent this accommodation?
source: Rents
cy: Yn ei rentu

# Does your household own or rent this accommodation?
source: Lives here rent-free
cy: Yn byw yma heb dalu rhent

# Did your household own or rent that accommodation?
source: Owned outright
cy: Yn berchen arno’n gyfan gwbl

# Did your household own or rent that accommodation?
source: Owned with a mortgage or loan
cy: Yn berchen arno gyda morgais neu fenthyciad

# Did your household own or rent that accommodation?
source: Part-owned and part-rented
cy: Yn berchen arno’n rhannol ac yn ei rentu’n rhannol

# Did your household own or rent that accommodation?
source: Rented
cy: Yn ei rentu

# Did your household own or rent that accommodation?
source: Lived there rent-free
cy: Yn byw yno heb dalu rhent

# Who is your landlord?
source: Housing association, housing co-operative, charitable trust, registered social landlord
cy: Cymdeithas dai, cwmni tai cydweithredol, ymddiriedolaeth elusennol, landlord cymdeithasol cofrestredig

# Who is your landlord?
source: Council or local authority
cy: Y cyngor neu'r awdurdod lleol

# Who is your landlord?
source: Private landlord or letting agency
cy: Landlord preifat neu asiantaeth gosod tai

# Who is your landlord?
source: Employer of a household member
cy: Cyflogwr aelod o’r cartref

# Who is your landlord?
source: Relative or friend of a household member
cy: Perthynas neu ffrind i aelod o’r cartref

# Who is your landlord?
source: Other
cy: Arall

# Who was your landlord?
source: Housing association, housing co-operative, charitable trust, registered social landlord
cy: Cymdeithas dai, cwmni tai cydweithredol, ymddiriedolaeth elusennol, landlord cymdeithasol cofrestredig

# Who was your landlord?
source: Council or local authority
cy: Y cyngor neu'r awdurdod lleol

# Who was your landlord?
source: Private landlord or letting agency
cy: Landlord preifat neu asiantaeth gosod tai

# Who was your landlord?
source: Employer of a household member
cy: Cyflogwr aelod o’r cartref

# Who was your landlord?
source: Relative or friend of a household member
cy: Perthynas neu ffrind i aelod o’r cartref

# Who was your landlord?
source: Other
cy: Arall

# How do you and the people in your household connect to the internet at home?
source: Broadband or WiFi
cy: Band eang neu WiFi

# How do you and the people in your household connect to the internet at home?
source: A mobile phone network such as 3G, 4G or 5G
cy: Rhwydwaith ffôn symudol fel 3G, 4G neu 5G

# How do you and the people in your household connect to the internet at home?
source: Public WiFi hotspot
cy: Llecyn WiFi cyhoeddus

# How do you and the people in your household connect to the internet at home?
source: Unable to access the internet at home
cy: Heb fynediad i’r rhyngrwyd gartref

# How did you and the people in your household connect to the internet at home?
source: Broadband or WiFi
cy: Band eang neu WiFi

# How did you and the people in your household connect to the internet at home?
source: A mobile phone network such as 3G, 4G or 5G
cy: Rhwydwaith ffôn symudol fel 3G, 4G neu 5G

# How did you and the people in your household connect to the internet at home?
source: Public WiFi hotspot
cy: Llecyn WiFi cyhoeddus

# How did you and the people in your household connect to the internet at home?
source: Unable to access the internet at home
cy: Heb fynediad i’r rhyngrwyd gartref

source: Completing forms online
cy: Llenwi ffurflenni ar lein

source: Applying for official documents online
cy: Gwneud cais am ddogfennau swyddogol ar lein

source: Used paper-based services
cy: Wedi defnyddio gwasanaethau papur

source: Did not use government services
cy: Heb ddefnyddio gwasanaethau’r llywodraeth

# Are they answering the questions for themselves or on someone else’s behalf?
source: Yes, they are answering for themselves
cy: Ydy, mae’n ateb drosto’i hun

# Are they answering the questions for themselves or on someone else’s behalf?
source: No, they are answering on someone else’s behalf
cy: Nac ydy, mae’n ateb ar ran rhywun arall

# What is your date of birth?
source: Date of birth is not known
cy: Nid yw’r dyddiad geni yn hysbys

# What is <em>{person_name_possessive}</em> date of birth?
source: Date of birth is not known
cy: Nid yw’r dyddiad geni yn hysbys

# What was your age on your last birthday?
source: Estimate
cy: Amcangyfrif

# What was <em>{person_name_possessive}</em> age on their last birthday?
source: Estimate
cy: Amcangyfrif

# You are {age} old. Is this correct?
source: Yes
cy: Ydy

# You are {age} old. Is this correct?
source: No
cy: Nac ydy

# <em>{person_name}</em> is {age} old. Is this correct?
source: Yes
cy: Ydy

# <em>{person_name}</em> is {age} old. Is this correct?
source: No
cy: Nac ydy

# Can I confirm your sex?
source: Female
cy: Benyw

# Can I confirm your sex?
source: Male
cy: Gwryw

# What is <em>{person_name_possessive}</em> sex?
source: Female
cy: Benyw

# What is <em>{person_name_possessive}</em> sex?
source: Male
cy: Gwryw

# Were you born in the UK?
source: Yes
cy: Do

# Were you born in the UK?
source: No, born outside the UK
cy: Naddo, cefais fy ngeni y tu allan i’r Deyrnas Unedig

# Was <em>{person_name}</em> born in the UK?
source: Yes
cy: Do

# Was <em>{person_name}</em> born in the UK?
source: No, born outside the UK
cy: Naddo, cafodd ei eni/geni y tu allan i’r Deyrnas Unedig

source: Never married and never registered a civil partnership
cy: Erioed wedi priodi na chofrestru partneriaeth sifil

source: Married
cy: Priod

source: In a registered civil partnership
cy: Mewn partneriaeth sifil gofrestredig

source: Separated, but still legally married
cy: Wedi gwahanu, ond yn gyfreithiol yn dal i fod yn briod

source: Separated, but still legally in a civil partnership
cy: Wedi gwahanu, ond yn gyfreithiol yn dal i fod mewn partneriaeth sifil

source: Divorced
cy: Wedi ysgaru

source: Formerly in a civil partnership which is now legally dissolved
cy: Wedi bod mewn partneriaeth sifil sydd bellach wedi’i diddymu’n gyfreithiol

source: Widowed
cy: Person gweddw

source: Surviving partner from a registered civil partnership
cy: Wedi colli partner sifil cofrestredig drwy farwolaeth

source: Never married and never registered a civil partnership
cy: Erioed wedi priodi na chofrestru partneriaeth sifil

source: Married
cy: Priod

source: In a registered civil partnership
cy: Mewn partneriaeth sifil gofrestredig

source: Separated, but still legally married
cy: Wedi gwahanu, ond yn gyfreithiol yn dal i fod yn briod

source: Separated, but still legally in a civil partnership
cy: Wedi gwahanu, ond yn gyfreithiol yn dal i fod mewn partneriaeth sifil

source: Divorced
cy: Wedi ysgaru

source: Formerly in a civil partnership which is now legally dissolved
cy: Wedi bod mewn partneriaeth sifil sydd bellach wedi’i diddymu’n gyfreithiol

source: Widowed
cy: Person gweddw

source: Surviving partner from a registered civil partnership
cy: Wedi colli partner sifil cofrestredig drwy farwolaeth

# What is your ethnic group?
source: White
cy: Gwyn

# What is your ethnic group?
source: Mixed or Multiple ethnic groups
cy: Grwpiau Cymysg neu Amlethnig

# What is your ethnic group?
source: Asian, Asian Welsh or Asian British
cy: Asiaidd, Asiaidd Cymreig neu Asiaidd Prydeinig

# What is your ethnic group?
source: Black, Black Welsh, Black British, Caribbean or African
cy: Du, Du Cymreig, Du Prydeinig, Caribïaidd neu Affricanaidd

# What is your ethnic group?
source: Other ethnic group
cy: Grŵp ethnig arall

# What is <em>{person_name_possessive}</em> ethnic group?
source: White
cy: Gwyn

# What is <em>{person_name_possessive}</em> ethnic group?
source: Mixed or Multiple ethnic groups
cy: Grwpiau Cymysg neu Amlethnig

# What is <em>{person_name_possessive}</em> ethnic group?
source: Asian, Asian Welsh or Asian British
cy: Asiaidd, Asiaidd Cymreig neu Asiaidd Prydeinig

# What is <em>{person_name_possessive}</em> ethnic group?
source: Black, Black Welsh, Black British, Caribbean or African
cy: Du, Du Cymreig, Du Prydeinig, Caribïaidd neu Affricanaidd

# What is <em>{person_name_possessive}</em> ethnic group?
source: Other ethnic group
cy: Grŵp ethnig arall

# Which one best describes your White ethnic group or background?
source: Welsh, English, Scottish, Northern Irish or British
cy: Cymreig, Seisnig, Albanaidd, Gwyddelig Gogledd Iwerddon neu Brydeinig

# Which one best describes your White ethnic group or background?
source: Irish
cy: Gwyddelig

# Which one best describes your White ethnic group or background?
source: Gypsy or Irish Traveller
cy: Sipsi neu Deithiwr Gwyddelig

# Which one best describes your White ethnic group or background?
source: Any other White background
cy: Unrhyw gefndir Gwyn arall

source: Welsh, English, Scottish, Northern Irish or British
cy: Cymreig, Seisnig, Albanaidd, Gwyddelig Gogledd Iwerddon neu Brydeinig

source: Irish
cy: Gwyddelig

source: Gypsy or Irish Traveller
cy: Sipsi neu Deithiwr Gwyddelig

source: Any other White background
cy: Unrhyw gefndir Gwyn arall

# Which one best describes your Mixed or Multiple ethnic group or background?
source: White and Black Caribbean
cy: Gwyn a Du Caribïaidd

# Which one best describes your Mixed or Multiple ethnic group or background?
source: White and Black African
cy: Gwyn a Du Affricanaidd

# Which one best describes your Mixed or Multiple ethnic group or background?
source: White and Asian
cy: Gwyn ac Asiaidd

# Which one best describes your Mixed or Multiple ethnic group or background?
source: Any other Mixed or Multiple background
cy: Unrhyw gefndir Cymysg neu Amlethnig arall

source: White and Black Caribbean
cy: Gwyn a Du Caribïaidd

source: White and Black African
cy: Gwyn a Du Affricanaidd

source: White and Asian
cy: Gwyn ac Asiaidd

source: Any other Mixed or Multiple background
cy: Unrhyw gefndir Cymysg neu Amlethnig arall

source: Indian
cy: Indiaidd

source: Pakistani
cy: Pacistanaidd

source: Bangladeshi
cy: Bangladeshaidd

source: Chinese
cy: Tsieineaidd

source: Any other Asian background
cy: Unrhyw gefndir Asiaidd arall

source: Indian
cy: Indiaidd

source: Pakistani
cy: Pacistanaidd

source: Bangladeshi
cy: Bangladeshaidd

source: Chinese
cy: Tsieineaidd

source: Any other Asian background
cy: Unrhyw gefndir Asiaidd arall

source: Caribbean
cy: Caribïaidd

source: African
cy: Affricanaidd

source: Any other Black, Black British or Caribbean background
cy: Unrhyw gefndir Du, Du Prydeinig neu Garibïaidd arall

source: Caribbean
cy: Caribïaidd

source: African
cy: Affricanaidd

source: Any other Black, Black British or Caribbean background
cy: Unrhyw gefndir Du, Du Prydeinig neu Garibïaidd arall

# Which one best describes your other ethnic group or background?
source: Arab
cy: Arabaidd

# Which one best describes your other ethnic group or background?
source: Any other ethnic group
cy: Unrhyw grŵp ethnig arall

source: Arab
cy: Arabaidd

source: Any other ethnic group
cy: Unrhyw grŵp ethnig arall

# On {census_date}, were you a student in full-time education?
source: Yes
cy: Oeddwn

# On {census_date}, were you a student in full-time education?
source: No
cy: Nac oeddwn

# On {census_date}, was <em>{person_name}</em> a student in full-time education?
source: Yes
cy: Oedd

# On {census_date}, was <em>{person_name}</em> a student in full-time education?
source: No
cy: Nac oedd

# On {census_date}, were you a schoolchild or student in full-time education?
source: Yes
cy: Oeddwn

# On {census_date}, were you a schoolchild or student in full-time education?
source: No
cy: Nac oeddwn

source: Yes
cy: Oedd

source: No
cy: Nac oedd

# During term time, where did you usually live?
source: At this household’s address
cy: Yng nghyfeiriad y cartref hwn

# During term time, where did you usually live?
source: At another address
cy: Mewn cyfeiriad arall

# During term time, where did <em>{person_name}</em> usually live?
source: At this household’s address
cy: Yng nghyfeiriad y cartref hwn

# During term time, where did <em>{person_name}</em> usually live?
source: At another address
cy: Mewn cyfeiriad arall

source: Yes
cy: Oedd

source: No, living elsewhere in the UK
cy: Nac oedd, yn byw yn rhywle arall yn y Deyrnas Unedig

source: No, living outside the UK
cy: Nac oedd, yn byw y tu allan i’r Deyrnas Unedig

source: Yes
cy: Oedd

source: No, living elsewhere in the UK
cy: Nac oedd, roedd yn byw yn rhywle arall yn y Deyrnas Unedig

source: No, living outside the UK
cy: Nac oedd, roedd yn byw y tu allan i’r Deyrnas Unedig

source: Less than 12 months
cy: Llai na 12 mis

source: 12 months or more
cy: 12 mis neu fwy

source: Less than 12 months
cy: Llai na 12 mis

source: 12 months or more
cy: 12 mis neu fwy

# During the week of 15 to {census_date}, were you doing any of the following?
source: Working as an employee
cy: Gwaith cyflogedig

# During the week of 15 to {census_date}, were you doing any of the following?
source: Self-employed or freelance
cy: Gwaith hunangyflogedig neu ar eich liwt eich hun

# During the week of 15 to {census_date}, were you doing any of the following?
source: Temporarily away from work ill, on holiday or temporarily laid off
cy: I ffwrdd o’ch gwaith dros dro yn sâl, ar wyliau, neu wedi’ch cadw dros dro o’ch gwaith am na allai eich cyflogwr gynnig gwaith ar y pryd

# During the week of 15 to {census_date}, were you doing any of the following?
source: On maternity or paternity leave
cy: Ar gyfnod mamolaeth neu dadolaeth

# During the week of 15 to {census_date}, were you doing any of the following?
source: Doing any other kind of paid work
cy: Unrhyw fath arall o waith am dâl

# During the week of 15 to {census_date}, were you doing any of the following?
source: None of these apply
cy: Dim un o’r rhain

source: Working as an employee
cy: Gwaith cyflogedig

source: Self-employed or freelance
cy: Gwaith hunangyflogedig neu ar ei liwt ei hun

source: Temporarily away from work ill, on holiday or temporarily laid off
cy: I ffwrdd o'r gwaith dros dro yn sâl, ar wyliau, neu mae'r unigolyn wedi'i gadw o'r gwaith dros dro am na allai’r cyflogwr gynnig gwaith ar y pryd

source: On maternity or paternity leave
cy: Ar gyfnod mamolaeth neu dadolaeth

source: Doing any other kind of paid work
cy: Unrhyw fath arall o waith am dâl

source: None of these apply
cy: Dim un o'r rhain

source: Retired
cy: Wedi ymddeol

source: Studying
cy: Astudio

source: Looking after home or family
cy: Gofalu am y cartref neu am y teulu

source: Long-term sick or disabled
cy: Anabl neu yn sâl am gyfnod hir

source: Other
cy: Arall

source: Retired
cy: Wedi ymddeol

source: Studying
cy: Astudio

source: Looking after home or family
cy: Gofalu am y cartref neu am y teulu

source: Long-term sick or disabled
cy: Anabl neu yn sâl am gyfnod hir

source: Other
cy: Arall

source: Previous home
cy: Cartref blaenorol

source: Armed forces base address
cy: Cyfeiriad un o ganolfannau’r lluoedd arfog

source: Another address when working away from home
cy: Cyfeiriad arall wrth weithio i ffwrdd o'r cartref

source: Student’s home address
cy: Cyfeiriad cartref myfyriwr

source: Student’s term-time address
cy: Cyfeiriad myfyriwr yn ystod y tymor

source: Another parent or guardian’s address
cy: Cyfeiriad rhiant neu warcheidwad arall

source: Partner’s address
cy: Cyfeiriad partner

source: Holiday address in the UK
cy: Cyfeiriad gwyliau yn y Deyrnas Unedig

source: Other UK address
cy: Cyfeiriad arall yn y Deyrnas Unedig

source: There is no other UK address
cy: Nid oes cyfeiriad arall yn y Deyrnas Unedig

source: Previous home
cy: Cartref blaenorol

source: Armed forces base address
cy: Cyfeiriad un o ganolfannau’r lluoedd arfog

source: Another address when working away from home
cy: Cyfeiriad arall wrth weithio i ffwrdd o'r cartref

source: Student’s home address
cy: Cyfeiriad cartref myfyriwr

source: Student’s term-time address
cy: Cyfeiriad myfyriwr yn ystod y tymor

source: Another parent or guardian’s address
cy: Cyfeiriad rhiant neu warcheidwad arall

source: Partner’s address
cy: Cyfeiriad partner

source: Holiday address in the UK
cy: Cyfeiriad gwyliau yn y Deyrnas Unedig

source: Other UK address
cy: Cyfeiriad arall yn y Deyrnas Unedig

source: There is no other UK address
cy: Nid oes cyfeiriad arall yn y Deyrnas Unedig

# Did <em>{person_name}</em> usually live in the UK?
source: Yes
cy: Oedd

# Did <em>{person_name}</em> usually live in the UK?
source: No
cy: Nac oedd

# Did <em>{person_name}</em> usually live in the UK?
source: Same address as {first_person}
cy: Yr un cyfeiriad â/ag {first_person}

# Is there any other living accommodation at {household_address}?
source: Yes
cy: Oes

# Is there any other living accommodation at {household_address}?
source: No
cy: Nac oes

source: Yes
cy: Oedd

source: No
cy: Nac oedd

# On Sunday {census_date}, was your usual address in the UK?
source: Select to enter answer
cy: Dewiswch i roi ateb

# What type of accommodation is this?
source: Including purpose-built flats and flats within converted buildings
cy: Gan gynnwys fflatiau a adeiladwyd yn bwrpasol a fflatiau mewn adeiladau wedi'u haddasu

# What type of accommodation was that?
source: Including purpose-built flats and flats within converted buildings
cy: Gan gynnwys fflatiau a adeiladwyd yn bwrpasol a fflatiau mewn adeiladau wedi'u haddasu

# Which of the following is your house or bungalow?
source: Including end-terrace
cy: Gan gynnwys ar y pen

# Which of the following was your house or bungalow?
source: Including end-terrace
cy: Gan gynnwys ar y pen

# Where is your flat, maisonette or apartment?
source: Including bedsits
cy: Gan gynnwys fflatiau un ystafell

# Where is your flat, maisonette or apartment?
source: For example, former school, church or warehouse
cy: Er enghraifft, hen ysgol, eglwys neu warws

# Where is your flat, maisonette or apartment?
source: For example, in an office building, hotel, or over a shop
cy: Er enghraifft, mewn adeilad o swyddfeydd, gwesty, neu uwchben siop

# Where was your flat, maisonette or apartment?
source: Including bedsits
cy: Gan gynnwys fflatiau un ystafell

# Where was your flat, maisonette or apartment?
source: For example, former school, church or warehouse
cy: Er enghraifft, hen ysgol, eglwys neu warws

# Where was your flat, maisonette or apartment?
source: For example, in an office building, hotel, or over a shop
cy: Er enghraifft, mewn adeilad o swyddfeydd, gwesty, neu uwchben siop

# Does your household own or rent this accommodation?
source: Shared ownership
cy: Cynllun rhanberchnogaeth

# Does your household own or rent this accommodation?
source: With or without housing benefit
cy: Gyda chymorth budd-dal tai neu hebddo

# Did your household own or rent that accommodation?
source: Shared ownership
cy: Cynllun rhanberchnogaeth

# Did your household own or rent that accommodation?
source: With or without housing benefit
cy: Gyda chymorth budd-dal tai neu hebddo

source: For example, taxing a car, registering to vote, applying for school places
cy: Er enghraifft, trethu car, cofrestru i bleidleisio, gwneud cais am le mewn ysgol

source: For example, passport, driving licence
cy: Er enghraifft, pasbort, trwydded yrru

# What is your ethnic group?
source: Includes Welsh, British, Northern Irish, Irish, Gypsy, Irish Traveller, Roma or any other White background
cy: Yn cynnwys Cymreig, Prydeinig, Gwyddelig Gogledd Iwerddon, Gwyddelig, Sipsi, Teithiwr Gwyddelig, Roma neu unrhyw gefndir Gwyn arall

# What is your ethnic group?
source: Includes White and Black Caribbean, White and Black African, White and Asian or any other Mixed or Multiple background
cy: Yn cynnwys Gwyn a Du Caribïaidd, Gwyn a Du Affricanaidd, Gwyn ac Asiaidd neu unrhyw gefndir Cymysg neu Amlethnig arall

# What is your ethnic group?
source: Includes Indian, Pakistani, Bangladeshi, Chinese or any other Asian background
cy: Yn cynnwys Indiaidd, Pacistanaidd, Bangladeshaidd, Tsieineaidd neu unrhyw gefndir Asiaidd arall

# What is your ethnic group?
source: Includes Black British, Caribbean, African or any other Black background
cy: Yn cynnwys Du Prydeinig, Caribïaidd, Affricanaidd neu unrhyw gefndir Du arall

# What is your ethnic group?
source: Includes Arab or any other ethnic group
cy: Yn cynnwys Arabaidd neu unrhyw grŵp ethnig arall

# What is <em>{person_name_possessive}</em> ethnic group?
source: Includes Welsh, British, Northern Irish, Irish, Gypsy, Irish Traveller, Roma or any other White background
cy: Yn cynnwys Cymreig, Prydeinig, Gwyddelig Gogledd Iwerddon, Gwyddelig, Sipsi, Teithiwr Gwyddelig, Roma neu unrhyw gefndir Gwyn arall

# What is <em>{person_name_possessive}</em> ethnic group?
source: Includes White and Black Caribbean, White and Black African, White and Asian or any other Mixed or Multiple background
cy: Yn cynnwys Gwyn a Du Caribïaidd, Gwyn a Du Affricanaidd, Gwyn ac Asiaidd neu unrhyw gefndir Cymysg neu Amlethnig arall

# What is <em>{person_name_possessive}</em> ethnic group?
source: Includes Indian, Pakistani, Bangladeshi, Chinese or any other Asian background
cy: Yn cynnwys Indiaidd, Pacistanaidd, Bangladeshaidd, Tsieineaidd neu unrhyw gefndir Asiaidd arall

# What is <em>{person_name_possessive}</em> ethnic group?
source: Includes Black British, Caribbean, African or any other Black background
cy: Yn cynnwys Du Prydeinig, Caribïaidd, Affricanaidd neu unrhyw gefndir Du arall

# What is <em>{person_name_possessive}</em> ethnic group?
source: Includes Arab or any other ethnic group
cy: Yn cynnwys Arabaidd neu unrhyw grŵp ethnig arall

# Which one best describes your White ethnic group or background?
source: Select to enter answer
cy: Dewiswch i roi ateb

source: Select to enter answer
cy: Dewiswch i roi ateb

# Which one best describes your Mixed or Multiple ethnic group or background?
source: Select to enter answer
cy: Dewiswch i roi ateb

source: Select to enter answer
cy: Dewiswch i roi ateb

source: Select to enter answer
cy: Dewiswch i roi ateb

source: Select to enter answer
cy: Dewiswch i roi ateb

source: Select to enter answer
cy: Dewiswch i roi ateb

source: Select to enter answer
cy: Dewiswch i roi ateb

# Which one best describes your other ethnic group or background?
source: Select to enter answer
cy: Dewiswch i roi ateb

source: Select to enter answer
cy: Dewiswch i roi ateb

# During the week of 15 to {census_date}, were you doing any of the following?
source: Freelance means that you are self-employed and work for different companies or people on particular pieces of work
cy: Mae gweithio ar eich liwt eich hun yn golygu eich bod yn hunangyflogedig ac yn gweithio i wahanol gwmnïau neu bobl ar ddarnau penodol o waith. Gair arall am hyn yw llawrydd
