Repository: ONSdigital/eq-questionnaire-schemas
Catalog: translations/*/ccs_household_gb_wls_*.po
Languages: cy

source: Census Coverage Survey 2021
cy: Arolwg Cwmpas y Cyfrifiad 2021

source: Voluntary
cy: Gwirfoddol

source: Household members and visitors
cy: Aelodau'r cartref ac ymwelwyr

source: Household and accommodation
cy: Cartref a llety

source: Individual Section
cy: Adran Unigol

source: Visitors
cy: Ymwelwyr

source: Final check – other households
cy: Gwiriad terfynol – cartrefi eraill

source: {person_name} (Visitor)
cy: {person_name} (Ymwelydd)

source: Household members
cy: Aelodau’r cartref

source: Add someone to this household
cy: Ychwanegu rhywun at y cartref hwn

source: Add a visitor
cy: Ychwanegu ymwelydd

source: There are no householders
cy: Nid oes deiliaid cartref

source: There are no visitors
cy: Nid oes ymwelwyr

source: Who lives here
cy: Pwy sy'n byw yma

source: Visitors staying overnight on {census_date}
cy: Ymwelwyr sy’n aros dros nos ar {census_date}

source: Your household
cy: Eich cartref chi

source: End of interview
cy: Diwedd y cyfweliad

source: Who to interview
cy: Pwy i gyfweld

source: <em>Interviewer Note</em>
cy: <em>Nodyn i'r Cyfwelydd</em>

source: If the respondent was living outside the UK on Sunday {census_date}, please explain that they do not need to complete the rest of the questionnaire and end interview. <p>You still need to submit this questionnaire.</p><p> Continue past the household members summary page and select Submit.</p>
cy: Os oedd yr ymatebwr yn byw y tu allan i’r Deyrnas Unedig ddydd Sul {census_date}, esboniwch nad oes rhaid iddo lenwi gweddill yr holiadur a dewch â’r cyfweliad i ben.<p>Bydd dal angen i chi gyflwyno'r holiadur hwn.</p><p> Ewch ymlaen heibio'r crynodeb o aelodau'r cartref a dewiswch Cyflwyno.</p>

source: If the respondent was not living at the property on census night, but other current household members were, you must speak to one of those household members instead. <p>If none of those household members are available, <strong>save and sign out</strong> of the questionnaire. You must return to the address to interview one of them at a later time or date.</p>
cy: Os nad oedd yr ymatebwr yn byw yn y cartref ar noson y cyfrifiad, ond bod aelodau presennol eraill o’r cartref yn byw yno, rhaid i chi siarad ag un o’r aelodau hynny o’r cartref yn hytrach na’r ymatebwr. <p>Os nad oes dim un o’r aelodau hynny o’r cartref ar gael, <strong>cadwch yr holiadur ac allgofnodwch</strong>. Rhaid i chi ddychwelyd i’r cyfeiriad er mwyn cyfweld ag un ohonynt rywbryd eto.</p>

source: Only complete this section once all other sections are answered
cy: Dim ond ar ôl cwblhau'r holl adrannau eraill y dylech gwblhau'r adran hon

# Your household
source: All the questions are about the people in your household on Sunday {census_date}.
cy: Mae pob un o’r cwestiynau’n ymwneud â’r bobl a oedd yn eich cartref chi ddydd Sul {census_date}.

# Your household
source: A <strong>household</strong> is one person living alone, or a group of people (not necessarily related), who share cooking facilities <em>and</em> share a living room, <strong>or</strong> sitting room, <strong>or</strong> dining area.
cy: Mae <strong>cartref</strong> yn golygu un person sy’n byw ar ei ben ei hun, neu grŵp o bobl (nid oes rhaid iddyn nhw berthyn i’w gilydd), sy’n rhannu cyfleusterau coginio <em>ac</em> yn rhannu ystafell fyw <strong>neu</strong> lolfa <strong>neu</strong> le bwyta.

# Your household
source: Some of the questions that I will ask have showcards to help you to answer.
cy: Bydd gan rai o’r cwestiynau y byddaf yn eu gofyn gardiau dangos er mwyn eich helpu chi i ateb.

# Your household
source: I will show you these on paper or on the phone screen.
cy: Byddaf yn dangos y rhain i chi ar bapur neu ar sgrin y ffôn.

# Household and accommodation
source: In this section, I’m going to ask you about the household and accommodation you were living in on Sunday {census_date}
cy: Yn yr adran hon, byddaf yn gofyn i chi am y cartref roeddech chi’n byw ynddo ddydd Sul {census_date}

# {person_name}
source: In this section, I’m going to ask you questions about <em>{person_name}</em>
cy: Yn yr adran hon, byddaf yn gofyn cwestiynau i chi am <em>{person_name}</em>

# {person_name}
source: In this section, I’m going to ask you about your visitor, <em>{person_name}</em>
cy: Yn yr adran hon, byddaf yn gofyn i chi am eich ymwelydd, <em>{person_name}</em>

# Final check – other households
source: These final questions are to check we have not missed any other living accommodation or households
cy: Diben y cwestiynau olaf hyn yw gwneud yn siŵr nad ydym ni wedi colli unrhyw gartref neu fan arall lle mae rhywun yn byw

source: Were you usually living at {household_address} on Sunday {census_date}?
cy: Oeddech chi’n byw yn {household_address} fel arfer ddydd Sul {census_date}?

source: What is your full name?
cy: Beth yw eich enw llawn?

source: Was anyone in your current household usually living here on Sunday {census_date}?
cy: Oedd unrhyw aelod o'ch cartref presennol fel arfer yn byw yma ddydd Sul {census_date}?

source: On Sunday {census_date}, was your usual address in the UK?
cy: Ddydd Sul {census_date}, oedd eich cyfeiriad arferol yn y Deyrnas Unedig?

source: What was your household’s usual address?
cy: Beth oedd cyfeiriad arferol eich cartref?

source: I will now collect the names of everyone who lived at that address on Sunday {census_date}
cy: Byddaf nawr yn casglu enwau pawb a oedd yn byw yn y cyfeiriad hwnnw ddydd Sul {census_date}

source: Who do you need to add?
cy: Pwy y mae angen i chi ei ychwanegu?

source: Change details for <em>{person_name}</em> (You)
cy: Newid manylion <em>{person_name}</em> (Chi)

source: Change details for <em>{person_name}</em>
cy: Newid manylion <em>{person_name}</em>

source: Did anyone else usually live in your household on Sunday {census_date}?
cy: Oedd unrhyw un arall fel arfer yn byw yn eich cyfeiriad ddydd Sul {census_date}?

source: Are you sure you want to remove <em>{person_name}</em>?
cy: Ydych chi'n siŵr eich bod am ddileu <em>{person_name}</em>?

source: Apart from the people already included, is there anyone else who was temporarily away or staying that you need to add?
cy: Ar wahân i’r bobl sydd wedi’u cynnwys eisoes, oes unrhyw un arall oedd i ffwrdd o’r cartref dros dro neu’n aros dros dro y mae angen i chi ei ychwanegu?

source: Are any of these people related to each other?
cy: Oes unrhyw rai o'r bobl hyn yn perthyn i'w gilydd?

source: How many visitors were staying overnight at {household_address} on Sunday {census_date}?
cy: Faint o ymwelwyr oedd yn aros dros nos yn {household_address} ddydd Sul {census_date}?

source: How many visitors were staying overnight at {other_address} on Sunday {census_date}?
cy: Faint o ymwelwyr oedd yn aros dros nos yn {other_address} ddydd Sul {census_date}?

source: Were there any other visitors staying overnight on Sunday {census_date}?
cy: A oedd unrhyw ymwelwyr eraill yn aros dros nos ddydd Sul {census_date}?

source: What is the name of the visitor who stayed overnight?
cy: Beth yw enw’r ymwelydd a arhosodd dros nos?

source: What is the name of the {ordinality} visitor who stayed overnight?
cy: Beth yw enw’r {ordinality} ymwelydd a arhosodd dros nos?

source: Was the respondent living at {household_address} on Sunday {census_date}?
cy: Oedd yr ymatebwr yn byw yn {household_address} ddydd Sul {census_date}?

source: What type of accommodation is this?
cy: Pa fath o gartref yw hwn?

source: What type of accommodation was that?
cy: Pa fath o gartref oedd hwnnw?

source: Which of the following is your house or bungalow?
cy: Pa un o'r canlynol yw eich tŷ neu eich byngalo?

source: Which of the following was your house or bungalow?
cy: Pa un o'r canlynol oedd eich tŷ neu eich byngalo?

source: Where is your flat, maisonette or apartment?
cy: Ble mae eich fflat neu maisonette?

source: Where was your flat, maisonette or apartment?
cy: Ble oedd eich fflat neu maisonette?

source: Are all the rooms in this accommodation, including the kitchen, bathroom and toilet, behind a door that only this household can use?
cy: Ydy pob ystafell yn y cartref hwn, gan gynnwys y gegin, yr ystafell ymolchi a’r toiled, y tu ôl i ddrws sydd ddim ond yn cael ei ddefnyddio gan aelodau o’r cartref hwn?

source: Were all the rooms in that accommodation, including the kitchen, bathroom and toilet, behind a door that only this household could use?
cy: Oedd pob ystafell yn y cartref hwn, gan gynnwys y gegin, yr ystafell ymolchi a’r toiled, y tu ôl i ddrws oedd ddim ond yn cael ei ddefnyddio gan aelodau o’r cartref hwn?

source: Does your household own or rent this accommodation?
cy: Oes aelod neu aelodau o'ch cartref yn berchen ar y cartref hwn neu'n ei rentu?

source: Did your household own or rent that accommodation?
cy: Oedd aelod neu aelodau o'ch cartref yn berchen ar y cartref hwn neu'n ei rentu?

source: Who is your landlord?
cy: Pwy yw eich landlord?

source: Who was your landlord?
cy: Pwy oedd eich landlord?

source: How do you and the people in your household connect to the internet at home?
cy: Sut ydych chi a’r bobl yn eich cartref yn cysylltu â’r rhyngrwyd gartref?

source: How did you and the people in your household connect to the internet at home?
cy: Sut oeddech chi a’r bobl yn eich cartref yn cysylltu â’r rhyngrwyd gartref?

source: In the last year, how have you or your household used online government services?
cy: Yn y flwyddyn ddiwethaf, sut ydych chi neu eich cartref wedi defnyddio gwasanaethau'r llywodraeth ar lein?

source: Are they answering the questions for themselves or on someone else’s behalf?
cy: Ydy’r unigolyn yn ateb y cwestiynau drosto’i hun neu ar ran rhywun arall?

source: What is your date of birth?
cy: Beth yw eich dyddiad geni?

source: What is <em>{person_name_possessive}</em> date of birth?
cy: Beth yw dyddiad geni <em>{person_name_possessive}</em>?

source: What was your age on your last birthday?
cy: Faint oedd eich oed ar eich pen-blwydd diwethaf?

source: What was <em>{person_name_possessive}</em> age on their last birthday?
cy: Faint oedd oed <em>{person_name_possessive}</em> ar ei ben-blwydd/phen-blwydd diwethaf?

source: You are {age} old. Is this correct?
cy: Rydych chi’n {age}. Ydy hyn yn gywir?

source: <em>{person_name}</em> is {age} old. Is this correct?
cy: Mae <em>{person_name}</em> yn {age}. Ydy hyn yn gywir?

source: Can I confirm your sex?
cy: Ga’ i gadarnhau eich rhyw?

source: What is <em>{person_name_possessive}</em> sex?
cy: Beth yw rhyw <em>{person_name_possessive}</em>?

source: Were you born in the UK?
cy: Gawsoch chi eich geni yn y Deyrnas Unedig?

source: Was <em>{person_name}</em> born in the UK?
cy: Gafodd <em>{person_name}</em> ei eni/geni yn y Deyrnas Unedig?

source: On {census_date}, what was your legal marital or registered civil partnership status?
cy: Yn gyfreithiol, beth oedd eich statws priodasol neu statws eich partneriaeth sifil gofrestredig ar {census_date}?

source: On {census_date}, what was <em>{person_name_possessive}</em> legal marital or registered civil partnership status?
cy: Yn gyfreithiol, beth oedd statws priodasol neu statws partneriaeth sifil gofrestredig <em>{person_name_possessive}</em> ar {census_date}?

source: What is your ethnic group?
cy: Beth yw eich grŵp ethnig?

source: What is <em>{person_name_possessive}</em> ethnic group?
cy: Beth yw grŵp ethnig <em>{person_name_possessive}</em>?

source: Which one best describes your White ethnic group or background?
cy: Pa un sy’n disgrifio orau eich grŵp ethnig neu eich cefndir Gwyn?

source: Which one best describes <em>{person_name_possessive}</em> White ethnic group or background?
cy: Pa un sy’n disgrifio orau grŵp ethnig neu gefndir Gwyn <em>{person_name_possessive}</em>?

source: Which one best describes your Mixed or Multiple ethnic group or background?
cy: Pa un sy’n disgrifio orau eich grŵp ethnig neu eich cefndir Cymysg neu Amlethnig?

source: Which one best describes <em>{person_name_possessive}</em> Mixed or Multiple ethnic group or background?
cy: Pa un sy’n disgrifio orau grŵp ethnig neu gefndir Cymysg neu Amlethnig <em>{person_name_possessive}</em>?

source: Which one best describes your Asian, Asian Welsh or Asian British ethnic group or background?
cy: Pa un sy’n disgrifio orau eich grŵp ethnig neu eich cefndir Asiaidd, Asiaidd Cymreig neu Asiaidd Prydeinig?

source: Which one best describes <em>{person_name_possessive}</em> Asian, Asian Welsh or Asian British ethnic group or background?
cy: Pa un sy’n disgrifio orau grŵp ethnig neu gefndir Asiaidd, Asiaidd Cymreig neu Asiaidd Prydeinig <em>{person_name_possessive}</em>?

source: Which one best describes your Black, Black Welsh, Black British, Caribbean or African ethnic group or background?
cy: Pa un sy’n disgrifio orau eich grŵp ethnig neu eich cefndir Du, Du Cymreig, Du Prydeinig, Caribïaidd neu Affricanaidd?

source: Which one best describes <em>{person_name_possessive}</em> Black, Black Welsh, Black British, Caribbean or African ethnic group or background?
cy: Pa un sy’n disgrifio orau grŵp ethnig neu gefndir Du, Du Cymreig Du Prydeinig, Caribïaidd neu Affricanaidd <em>{person_name_possessive}</em>?

source: Which one best describes your other ethnic group or background?
cy: Pa un sy’n disgrifio orau eich grŵp ethnig neu eich cefndir arall?

source: Which one best describes <em>{person_name_possessive}</em> other ethnic group or background?
cy: Pa un sy’n disgrifio orau grŵp ethnig neu gefndir arall <em>{person_name_possessive}</em>?

source: On {census_date}, were you a student in full-time education?
cy: Ar {census_date}, oeddech chi’n fyfyriwr mewn addysg amser llawn?

source: On {census_date}, was <em>{person_name}</em> a student in full-time education?
cy: Ar {census_date}, oedd <em>{person_name}</em> yn fyfyriwr mewn addysg amser llawn?

source: On {census_date}, were you a schoolchild or student in full-time education?
cy: Ar {census_date}, oeddech chi’n blentyn ysgol neu’n fyfyriwr mewn addysg amser llawn?

source: On {census_date}, was <em>{person_name}</em> a schoolchild or student in full-time education?
cy: Ar {census_date}, oedd <em>{person_name}</em> yn blentyn ysgol neu’n fyfyriwr mewn addysg amser llawn?

source: During term time, where did you usually live?
cy: Yn ystod y tymor, ble oeddech chi’n byw fel arfer?

source: During term time, where did <em>{person_name}</em> usually live?
cy: Yn ystod y tymor, ble oedd <em>{person_name}</em> yn byw fel arfer?

source: Was your usual address one year ago, on {year_before_census_date}, the same as your usual address on {census_date}?
cy: Oedd eich cyfeiriad arferol flwyddyn yn ôl, ar {year_before_census_date}, yr un peth â'ch cyfeiriad arferol ar {census_date}?

source: Was <em>{person_name_possessive}</em> usual address one year ago, on {year_before_census_date}, the same as their usual address on {census_date}?
cy: Flwyddyn yn ôl, ar {year_before_census_date}, oedd cyfeiriad arferol <em>{person_name_possessive}</em> yr un peth â’i gyfeiriad/chyfeiriad arferol ar {census_date}?

source: Including the time you have already spent here, how long do you intend to stay in the UK?
cy: Gan gynnwys yr amser rydych chi wedi'i dreulio yma'n barod, am faint ydych chi'n bwriadu aros yn y Deyrnas Unedig?

source: Including the time they have already spent here, how long does <em>{person_name}</em> intend to stay in the UK?
cy: Gan gynnwys yr amser y mae wedi’i dreulio yma’n barod, am faint y mae <em>{person_name}</em> yn bwriadu aros yn y Deyrnas Unedig?

source: During the week of 15 to {census_date}, were you doing any of the following?
cy: Yn ystod yr wythnos rhwng 15 a {census_date}, oeddech chi’n gwneud unrhyw un o’r canlynol?

source: During the week of 15 to {census_date}, was <em>{person_name}</em> doing any of the following?
cy: Yn ystod yr wythnos rhwng 15 a {census_date}, oedd <em>{person_name}</em> yn gwneud unrhyw un o’r canlynol?

source: Which of the following describes what you were doing during the week of 15 to {census_date}?
cy: Pa un o’r canlynol sy’n disgrifio’r hyn roeddech chi’n ei wneud yn ystod yr wythnos rhwng 15 a {census_date}?

source: Which of the following describes what <em>{person_name}</em> was doing during the week of 15 to {census_date}?
cy: Pa un o’r canlynol sy’n disgrifio’r hyn roedd <em>{person_name}</em> yn ei wneud yn ystod yr wythnos rhwng 15 a {census_date}?

source: Is there another UK address where you may have been included on a census questionnaire because you were a usual resident, or staying overnight there on Sunday {census_date}?
cy: Oes cyfeiriad arall yn y Deyrnas Unedig y gallech fod wedi cael eich cynnwys ynddo ar holiadur y cyfrifiad am eich bod yn breswylydd arferol, neu'n aros yno dros nos ddydd Sul {census_date}?

source: Is there another UK address where <em>{person_name}</em> may have been included on a census questionnaire because they were a usual resident, or staying overnight there on Sunday {census_date}?
cy: Oes cyfeiriad arall yn y Deyrnas Unedig y gallai <em>{person_name}</em> fod wedi cael ei gynnwys/chynnwys ynddo ar holiadur y cyfrifiad am ei fod/bod yn breswylydd arferol, neu'n aros yno dros nos ddydd Sul {census_date}?

source: What is the other address?
cy: Beth yw’r cyfeiriad arall?

source: Did <em>{person_name}</em> usually live in the UK?
cy: Oedd <em>{person_name}</em> yn byw yn y Deyrnas Unedig fel arfer?

source: What is <em>{person_name_possessive}</em> usual UK address?
cy: Beth yw cyfeiriad arferol <em>{person_name_possessive}</em> yn y Deyrnas Unedig?

source: Is there any other living accommodation at {household_address}?
cy: Oes unrhyw fan arall yn {household_address} lle mae rhywun yn byw?

source: Was there anyone living at your address on {census_date} that you have not included because they lived in a separate household?
cy: Oedd unrhyw un yn byw yn eich cyfeiriad ar {census_date} nad ydych chi wedi’i gynnwys am ei fod yn byw mewn cartref ar wahân?

# On Sunday {census_date}, was your usual address in the UK?
source: “Usual address” means the address at which you generally spend most time, for most people this will be their permanent or family home
cy: Ystyr "cyfeiriad arferol" yw'r cyfeiriad lle rydych chi’n treulio'r rhan fwyaf o amser ar y cyfan. I'r rhan fwyaf o bobl, hwn fydd eu cartref parhaol neu gartref y teulu.

# Did anyone else usually live in your household on Sunday {census_date}?
source: Remember to only include those people who share cooking facilities <strong>and</strong> share a living room, <strong>or</strong> sitting room, <strong>or</strong> dining area.
cy: Cofiwch gynnwys dim ond y bobl hynny sy’n rhannu cyfleusterau coginio <strong>ac</strong> yn rhannu ystafell fyw, <strong>neu</strong> lolfa, <strong>neu</strong> le bwyta.

# Did anyone else usually live in your household on Sunday {census_date}?
source: <strong>Anyone else is not part of your household and will be interviewed separately.</strong>
cy: <strong>Bydd unrhyw un arall yn cael cyfweliad ar wahân gan nad ydy’n rhan o’ch cartref.</strong>

# Did anyone else usually live in your household on Sunday {census_date}?
source: Remember to only include those people who share cooking facilities <strong>and</strong> share a living room, <strong>or</strong> sitting room, <strong>or</strong> dining area.<p>Anyone else is not part of your household and will be interviewed separately.</p>
cy: Cofiwch gynnwys dim ond y bobl hynny sy’n rhannu cyfleusterau coginio <strong>ac</strong> yn rhannu ystafell fyw, <strong>neu</strong> lolfa, <strong>neu</strong> le bwyta.<p>Bydd unrhyw un arall yn cael cyfweliad ar wahân gan nad ydy’n rhan o’ch cartref.</p>

# Are any of these people related to each other?
source: Remember to include partners and stepchildren as related
cy: Cofiwch gynnwys partneriaid a llysblant fel pobl sy'n perthyn

source: A visitor is a person staying overnight who usually lives at another address
cy: Mae ymwelydd yn golygu person sy’n aros dros nos sydd fel arfer yn byw mewn cyfeiriad arall

source: A visitor is a person staying overnight who usually lives at another address
cy: Mae ymwelydd yn golygu person sy’n aros dros nos sydd fel arfer yn byw mewn cyfeiriad arall

source: This refers to any interaction you might have with public authorities online, such as DVLA, HMRC, local council or health-related services
cy: Mae hyn yn cyfeirio at unrhyw gysylltiad ag awdurdodau cyhoeddus ar lein, fel DVLA, Cyllid a Thollau Ei Mawrhydi, cyngor lleol neu wasanaethau sy'n ymwneud ag iechyd

# During term time, where did you usually live?
source: If the <strong>coronavirus</strong> pandemic affected your usual term-time address, answer based on your situation on Sunday {census_date}.
cy: Os gwnaeth pandemig y <strong>coronafeirws</strong> effeithio ar eich cyfeiriad arferol yn ystod y tymor, atebwch ar sail eich sefyllfa ddydd Sul {census_date}.

# During term time, where did <em>{person_name}</em> usually live?
source: If the <strong>coronavirus</strong> pandemic affected their usual term-time address, answer based on their situation on Sunday {census_date}.
cy: Os gwnaeth pandemig y <strong>coronafeirws</strong> effeithio ar gyfeiriad arferol yr unigolyn yn ystod y tymor, atebwch ar sail ei sefyllfa ddydd {census_date}.

source: If the <strong>coronavirus</strong> pandemic affected your usual address one year ago, answer about where you were living <strong>before your circumstances changed</strong>.
cy: Os gwnaeth pandemig y <strong>coronafeirws</strong> effeithio ar eich cyfeiriad arferol flwyddyn yn ôl, atebwch am y cyfeiriad lle roeddech chi'n byw <strong>cyn i'ch amgylchiadau newid</strong>.

source: If the <strong>coronavirus</strong> pandemic affected their usual address one year ago, answer about where they were living <strong>before their circumstances changed</strong>.
cy: Os gwnaeth pandemig y <strong>coronafeirws</strong> effeithio ar ei gyfeiriad/chyfeiriad arferol flwyddyn yn ôl, atebwch am y cyfeiriad lle roedd yn byw <strong>cyn i amgylchiadau newid</strong>.

# During the week of 15 to {census_date}, were you doing any of the following?
source: If you had a job but were off work on <strong>furlough</strong>, in <strong>quarantine</strong> or <strong>self-isolating</strong>, answer “Temporarily away from work ill, on holiday or temporarily laid off”.
cy: Os oedd gennych chi swydd ond roeddech i ffwrdd o'r gwaith ar <strong>ffyrlo</strong>, dan <strong>gwarantin</strong> neu'n <strong>hunanynysu</strong>, atebwch “I ffwrdd o’ch gwaith dros dro yn sâl, ar wyliau, neu wedi’ch cadw dros dro o’ch gwaith am na allai eich cyflogwr gynnig gwaith ar y pryd”.

# During the week of 15 to {census_date}, were you doing any of the following?
source: Include casual or temporary work, even if only for one hour.
cy: Dylech gynnwys gwaith achlysurol neu dros dro, hyd yn oed os mai dim ond am awr y buoch chi’n gweithio.

source: If they had a job but were off work on <strong>furlough</strong>, in <strong>quarantine</strong> or <strong>self-isolating</strong>, answer “Temporarily away from work ill, on holiday or temporarily laid off”.
cy: Os oedd gan yr unigolyn swydd ond roedd i ffwrdd o'r gwaith ar <strong>ffyrlo</strong>, dan <strong>gwarantin</strong> neu'n <strong>hunanynysu</strong>, atebwch “I ffwrdd o’r gwaith dros dro yn sâl, ar wyliau, neu roedd yr unigolyn wedi’i gadw dros dro o’r gwaith am na allai'r cyflogwr gynnig gwaith ar y pryd”.

source: Include casual or temporary work, even if only for one hour.
cy: Dylech gynnwys gwaith achlysurol neu dros dro, hyd yn oed os mai dim ond am awr y bu'n gweithio.

# Is there any other living accommodation at {household_address}?
source: For example, separate bedsits, annexes, sheds
cy: Er enghraifft, fflat un ystafell ar wahân, anecs, sied
