Repository: ONSdigital/eq-questionnaire-schemas
Catalog: translations/*/census_household_gb_nir_*.po
Languages: ga

source: people who work away from home within the UK if this is their permanent or family home
ga: daoine a oibríonn ar shiúl ón bhaile taobh istigh den UK más é seo a dteach buan nó teaghlaigh

source: members of the armed forces if this is their permanent or family home
ga: baill de na fórsaí armtha más é seo a dteach buan nó teaghlaigh

source: people who are temporarily outside the UK for <strong>less than 12 months</strong>
ga: daoine atá taobh amuigh den UK go sealadach do níos <strong>lú ná 12 mhí</strong>

source: people staying, or expecting to stay, in an establishment such as a hospital, care home or hostel for <strong>less than 6 months</strong>
ga: daoine atá ag fanacht, nó ag dúil le fanacht i leithéidí ospidéil, teach cúraim nó brú ar feadh <strong>níos lú ná 6 mhí</strong>

source: other people who usually live here but are temporarily away from home
ga: daoine eile a chónaíonn anseo de ghnáth ach atá ar shiúl go sealadach

source: people staying temporarily who usually live in the UK but do not have another UK address for example, relatives, friends
ga: daoine a bheidh ag fanacht go sealadach a chónaíonn sa RA ach nach bhfuil seoladh ar bith eile acu sa RA, mar shampla, gaolta, cairde

source: people who usually live outside the UK who are staying in the UK for <strong>3 months or more</strong>
ga: daoine a chónaíonntaobh amuigh den UK de ghnáth atá ag fanacht sa UK ar feadh <strong>3 mhí nó níos mó</strong>

# What is your name?
source: Enter a first name
ga: Cuir isteach céadainm

# What is your name?
source: Enter a last name
ga: Cuir isteach sloinne

# Who else lives at {household_address}?
source: Enter a first name
ga: Cuir isteach céadainm

# Who else lives at {household_address}?
source: Enter a last name
ga: Cuir isteach sloinne

# Who lives at {household_address}?
source: Enter a first name
ga: Cuir isteach céadainm

# Who lives at {household_address}?
source: Enter a last name
ga: Cuir isteach sloinne

# Change details for <em>{person_name}</em> (You)
source: Enter a first name
ga: Cuir isteach céadainm

# Change details for <em>{person_name}</em> (You)
source: Enter a last name
ga: Cuir isteach sloinne

# Change details for <em>{person_name}</em>
source: Enter a first name
ga: Cuir isteach céadainm

# Change details for <em>{person_name}</em>
source: Enter a last name
ga: Cuir isteach sloinne

# Who do you need to add to {household_address}?
source: Enter a first name
ga: Cuir isteach céadainm

# Who do you need to add to {household_address}?
source: Enter a last name
ga: Cuir isteach sloinne

source: Enter a first name
ga: Cuir isteach céadainm

source: Enter a last name
ga: Cuir isteach sloinne

# What is your date of birth?
source: Enter a valid date of birth
ga: Cuir isteach dáta breithe bailí

# What is your date of birth?
source: Enter a date of birth
ga: Cuir isteach dáta breithe

# What is your date of birth?
source: Enter a date of birth after %(min)s
ga: Cuir isteach dáta breithe i ndiaidh %(min)s

# What is your date of birth?
source: Enter a date of birth before %(max)s
ga: Cuir isteach dáta breithe roimh %(max)s

# What is <em>{person_name_possessive}</em> date of birth?
source: Enter a valid date of birth
ga: Cuir isteach dáta breithe bailí

# What is <em>{person_name_possessive}</em> date of birth?
source: Enter a date of birth
ga: Cuir isteach dáta breithe

# What is <em>{person_name_possessive}</em> date of birth?
source: Enter a date of birth after %(min)s
ga: Cuir isteach dáta breithe i ndiaidh %(min)s

# What is <em>{person_name_possessive}</em> date of birth?
source: Enter a date of birth before %(max)s
ga: Cuir isteach dáta breithe roimh %(max)s

# What was <em>{person_name_possessive}</em> age on their last birthday?
source: Enter an age less than or equal to %(max)s years
ga: Cuir aois isteach atá níos lú ná nó cothrom le %(max)s bliain

# What year did you come to live in Northern Ireland?
source: Enter a year of arrival after %(min)s
ga: Cuir isteach bliain teacht isteach i ndiaidh %(min)s

# What year did you come to live in Northern Ireland?
source: Enter a year of arrival before %(max)s
ga: Cuir isteach bliain teacht isteach roimh %(max)s

# What year did <em>{person_name}</em> come to live in Northern Ireland?
source: Enter a year of arrival after %(min)s
ga: Cuir isteach bliain teacht isteach i ndiaidh %(min)s

# What year did <em>{person_name}</em> come to live in Northern Ireland?
source: Enter a year of arrival before %(max)s
ga: Cuir isteach bliain teacht isteach roimh %(max)s

# What is your name?
source: First name
ga: Céadainm

# What is your name?
source: Middle names
ga: Lárainmneacha

# What is your name?
source: Last name
ga: Sloinne

source: Select all that apply. You can select more than one for each person
ga: Roghnaigh gach rud atá bainteach. Is féidir níos mó ná rud amháin a roghnú do gach duine

source: Select all that apply. You can select more than one for each person
ga: Roghnaigh gach rud atá bainteach. Is féidir níos mó ná rud amháin a roghnú do gach duine

# Who else lives at {household_address}?
source: First name
ga: Céadainm

# Who else lives at {household_address}?
source: Middle names
ga: Lárainmneacha

# Who else lives at {household_address}?
source: Last name
ga: Sloinne

# Who lives at {household_address}?
source: First name
ga: Céadainm

# Who lives at {household_address}?
source: Middle names
ga: Lárainmneacha

# Who lives at {household_address}?
source: Last name
ga: Sloinne

# Change details for <em>{person_name}</em> (You)
source: First name
ga: Céadainm

# Change details for <em>{person_name}</em> (You)
source: Middle names
ga: Lárainmneacha

# Change details for <em>{person_name}</em> (You)
source: Last name
ga: Sloinne

# Change details for <em>{person_name}</em>
source: First name
ga: Céadainm

# Change details for <em>{person_name}</em>
source: Middle names
ga: Lárainmneacha

# Change details for <em>{person_name}</em>
source: Last name
ga: Sloinne

# Who do you need to add to {household_address}?
source: First name
ga: Céadainm

# Who do you need to add to {household_address}?
source: Middle names
ga: Lárainmneacha

# Who do you need to add to {household_address}?
source: Last name
ga: Sloinne

source: First name
ga: Céadainm

source: Last name
ga: Sloinne

# What was <em>{person_name_possessive}</em> age on their last birthday?
source: Age
ga: Aois

# During term time, in which country outside the UK do you usually live?
source: Current name of country
ga: Ainm reatha na tire

source: Current name of country
ga: Ainm reatha na tire

# You selected “Elsewhere”. What is your country of birth?
source: Current name of country
ga: Ainm reatha na tire

source: Current name of country
ga: Ainm reatha na tire

# In which country outside the UK was your usual address one year ago?
source: Current name of country
ga: Ainm reatha na tire

source: Current name of country
ga: Ainm reatha na tire

# You selected “Other”. What passports do you hold?
source: Passports
ga: Pasanna

# You selected “Other”. What passports does <em>{person_name}</em> hold?
source: Passports
ga: Pasanna

# You selected “Other”. What other passports do you hold?
source: Passports
ga: Pasanna

# You selected “Other”. What other passports does <em>{person_name}</em> hold?
source: Passports
ga: Pasanna

# You selected “Other”. How would you describe your national identity?
source: National identity
ga: Féiniúlacht náisiúnta

source: National identity
ga: Féiniúlacht náisiúnta

# You selected “Other”. How would you describe your other national identity?
source: National identity
ga: Féiniúlacht náisiúnta

source: National identity
ga: Féiniúlacht náisiúnta

# You selected “Any other ethnic group”. How would you describe your ethnic group?
source: Ethnic group
ga: Grúpa eitneach

source: Ethnic group
ga: Grúpa eitneach

source: Religion
ga: Reiligiún

source: Religion
ga: Reiligiún

source: Religion
ga: Reiligiún

source: Religion
ga: Reiligiún

source: Main language
ga: Príomhtheanga

source: Main language
ga: Príomhtheanga

# What is the name of the organisation or business you work for?
source: Organisation or business name
ga: Ainm na heagraíochta nó an ghnó

source: Organisation or business name
ga: Ainm na heagraíochta nó an ghnó

# What was the name of the organisation or business you worked for?
source: Organisation or business name
ga: Ainm na heagraíochta nó an ghnó

source: Organisation or business name
ga: Ainm na heagraíochta nó an ghnó

# What is your full job title?
source: Job title
ga: Teideal poist

# What is <em>{person_name_possessive}</em> full job title?
source: Job title
ga: Teideal poist

# What was your full job title?
source: Job title
ga: Teideal poist

# What was <em>{person_name_possessive}</em> full job title?
source: Job title
ga: Teideal poist

# Briefly describe what you do in your main job.
source: Job description
ga: Cur síos poist

# Briefly describe what <em>{person_name}</em> does in their main job.
source: Job description
ga: Cur síos poist

# Briefly describe what you did in your main job.
source: Job description
ga: Cur síos poist

# Briefly describe what <em>{person_name}</em> did in their main job.
source: Job description
ga: Cur síos poist

# What is the main activity of your organisation, business or freelance work?
source: Main activity
ga: Príomhghníomhaíocht

source: Main activity
ga: Príomhghníomhaíocht

# What was the main activity of your organisation, business or freelance work?
source: Main activity
ga: Príomhghníomhaíocht

source: Main activity
ga: Príomhghníomhaíocht

# In which country is your main place of <em>work</em>?
source: Current name of country
ga: Ainm reatha na tire

source: Current name of country
ga: Ainm reatha na tire

# In which country was your main place of <em>work</em>?
source: Current name of country
ga: Ainm reatha na tire

source: Current name of country
ga: Ainm reatha na tire

# In which town and county is your main place of <em>work</em>?
source: Town or city
ga: Baile nó cathair

# In which town and county is your main place of <em>work</em>?
source: County
ga: Contae

source: Town or city
ga: Baile nó cathair

source: County
ga: Contae

# In which town and county was your main place of <em>work</em>?
source: Town or city
ga: Baile nó cathair

# In which town and county was your main place of <em>work</em>?
source: County
ga: Contae

source: Town or city
ga: Baile nó cathair

source: County
ga: Contae

# In which country is your course of <em>study</em>, including school?
source: Current name of country
ga: Ainm reatha na tire

source: Current name of country
ga: Ainm reatha na tire

# In which country outside the UK does <em>{person_name}</em> usually live?
source: Current name of country
ga: Ainm reatha na tire

# During term time, in which country outside the UK do you usually live?
source: Enter your own answer or select from suggestions
ga: Iontráil do fhreagra féin

source: Enter your own answer or select from suggestions
ga: Iontráil do fhreagra féin

# You selected “Elsewhere”. What is your country of birth?
source: Enter your own answer or select from suggestions
ga: Iontráil do fhreagra féin

source: Enter your own answer or select from suggestions
ga: Iontráil do fhreagra féin

# In which country outside the UK was your usual address one year ago?
source: Enter your own answer or select from suggestions
ga: Iontráil do fhreagra féin

source: Enter your own answer or select from suggestions
ga: Iontráil do fhreagra féin

# You selected “Other”. What passports do you hold?
source: Enter your own answer or select from suggestions
ga: Iontráil do fhreagra féin

# You selected “Other”. What passports does <em>{person_name}</em> hold?
source: Enter your own answer or select from suggestions
ga: Iontráil do fhreagra féin

# You selected “Other”. What other passports do you hold?
source: Enter your own answer or select from suggestions
ga: Iontráil do fhreagra féin

# You selected “Other”. What other passports does <em>{person_name}</em> hold?
source: Enter your own answer or select from suggestions
ga: Iontráil do fhreagra féin

# You selected “Other”. How would you describe your national identity?
source: Enter your own answer or select from suggestions
ga: Iontráil do fhreagra féin

source: Enter your own answer or select from suggestions
ga: Iontráil do fhreagra féin

# You selected “Other”. How would you describe your other national identity?
source: Enter your own answer or select from suggestions
ga: Iontráil do fhreagra féin

source: Enter your own answer or select from suggestions
ga: Iontráil do fhreagra féin

# You selected “Any other ethnic group”. How would you describe your ethnic group?
source: Enter your own answer or select from suggestions
ga: Iontráil do fhreagra féin

source: Enter your own answer or select from suggestions
ga: Iontráil do fhreagra féin

source: Enter your own answer or select from suggestions
ga: Iontráil do fhreagra féin

source: Enter your own answer or select from suggestions
ga: Iontráil do fhreagra féin

source: Enter your own answer or select from suggestions
ga: Iontráil do fhreagra féin

source: Enter your own answer or select from suggestions
ga: Iontráil do fhreagra féin

source: Enter your own answer or select from suggestions
ga: Iontráil do fhreagra féin

source: Enter your own answer or select from suggestions
ga: Iontráil do fhreagra féin

# In which country is your main place of <em>work</em>?
source: Enter your own answer or select from suggestions
ga: Iontráil do fhreagra féin

source: Enter your own answer or select from suggestions
ga: Iontráil do fhreagra féin

# In which country was your main place of <em>work</em>?
source: Enter your own answer or select from suggestions
ga: Iontráil do fhreagra féin

source: Enter your own answer or select from suggestions
ga: Iontráil do fhreagra féin

# In which country is your course of <em>study</em>, including school?
source: Enter your own answer or select from suggestions
ga: Iontráil do fhreagra féin

source: Enter your own answer or select from suggestions
ga: Iontráil do fhreagra féin

# In which country outside the UK does <em>{person_name}</em> usually live?
source: Enter your own answer or select from suggestions
ga: Iontráil do fhreagra féin

source: {second_person_name} is your <em>…</em>
ga: {second_person_name} is ea do <em>…</em>

# Thinking about {first_person_name}, {second_person_name} is their <em>…</em>
source: {second_person_name} is {first_person_name_possessive} <em>…</em>
ga: Is é/í {second_person_name} <em>…</em> {first_person_name_possessive}

# Do you usually live at {household_address}?
source: Yes, I usually live here
ga: Cónaím anseo de ghnáth

# Do you usually live at {household_address}?
source: No, I don’t usually live here
ga: Ní chónaím anseo de ghnáth

source: Family members and partners
ga: Baill teaghlaigh agus páirtnéirí

source: Housemates, tenants or lodgers
ga: Comrádaithe tí, tionóntaí agus lóistéirí

source: People who usually live outside the UK who are staying in the UK for 3 months or more
ga: Daoine a chónaíonntaobh amuigh den UK de ghnáth atá ag fanacht sa UK ar feadh 3 mhí nó níos mó

source: People temporarily away
ga: Daoine atá ar shiúl go sealadach

source: People staying temporarily who usually live in the UK but do not have another UK address
ga: Daoine a bheidh ag fanacht go sealadach a chónaíonn sa UK ach nach bhfuil seoladh ar bith eile acu sa UK

source: None of these apply, I am the only person who usually lives here
ga: Ní bhaineann ceann ar bith acu seo le hábhar, mise an t-aon duine amháin a chónaíonn anseo de ghnáth

source: Family members and partners
ga: Baill teaghlaigh agus páirtnéirí

source: Housemates, tenants or lodgers
ga: Comrádaithe tí, tionóntaí agus lóistéirí

source: People who usually live outside the UK who are staying in the UK for 3 months or more
ga: Daoine a chónaíonntaobh amuigh den UK de ghnáth atá ag fanacht sa UK ar feadh 3 mhí nó níos mó

source: People temporarily away
ga: Daoine atá ar shiúl go sealadach

source: People staying temporarily who usually live in the UK but do not have another UK address
ga: Daoine a bheidh ag fanacht go sealadach a chónaíonn sa UK ach nach bhfuil seoladh ar bith eile acu sa UK

source: None of these apply, no-one usually lives here
ga: Ní bhaineann ceann ar bith acu seo le hábhar, mise an t-aon duine amháin a chónaíonn anseo de ghnáth

# Does anyone live at {household_address}?
source: Yes, I need to add a person
ga: Cónaíonn, caithfidh mé duine eile a chur isteach

# Does anyone live at {household_address}?
source: No, I do not need to add anyone
ga: Ní bheidh, ní chaithfidh mé duine eile a chur isteach

# Does anyone else live at {household_address}?
source: Yes, I need to add {ordinality} person
ga: Cónaíonn, caithfidh mé duine eile {ordinality} a chur isteach

# Does anyone else live at {household_address}?
source: No, I do not need to add anyone
ga: Ní bheidh, ní chaithfidh mé duine eile a chur isteach

# Are you sure you want to remove <em>{person_name}</em>?
source: Yes, I want to remove this person
ga: Tá, ba mhaith liom an duine seo a bhaint

# Are you sure you want to remove <em>{person_name}</em>?
source: No, I do not want to remove this person
ga: Níl, níor mhaith liom an duine seo a bhaint

source: Yes, I need to add someone
ga: Caithfidh mé duine éigin eile a chur isteach

source: No, there is {cardinality} person living here
ga: Ní gá, cónaíonn {cardinality} duine anseo

source: People who usually live somewhere else in the UK, for example, boyfriends, girlfriends, friends or relatives
ga: Daoine a chonaíonn áit éigin eile sa UK de ghnáth, mar shampla, buachaillí/cailíní, cairde nó gaolta

source: People staying here because it is their second address, for example, for work. Their permanent or family home is elsewhere
ga: Daoine atá ag fanacht anseo mar gheall gurb é seo an dara seoladh atá acu, mar shampla, d'obair. Tá a dteach buan nó teaghlaigh suite in áit éigin eile

source: People who usually live outside the UK who are staying in the UK for less than three months
ga: Daoine a chónaíonn taobh amuigh den UK de ghnáth atá ag fanacht sa UK ar feadh níos lú ná trí mhí

source: People here on holiday
ga: Daoine atá anseo ar saoire

source: There are no visitors staying here overnight on {census_date}
ga: Níl cuairteoir ar bith ag fanacht anseo thar oíche ar {census_date}

source: Yes, I need to add {ordinality} visitor
ga: Beidh, caithfidh mé an {ordinality} cuairteoir a churisteach

source: No, I do not need to add anyone
ga: Ní bheidh, ní chaithfidh mé duine eile a chur isteach

# {second_person_name} is your <em>…</em>
source: Husband or wife
ga: Fear céile nó bean chéile

# {second_person_name} is your <em>…</em>
source: Civil partner
ga: Páirtnéir sibhialta

# {second_person_name} is your <em>…</em>
source: Partner
ga: Páirtnéir

# {second_person_name} is your <em>…</em>
source: Son or daughter
ga: Mac nó iníon

# {second_person_name} is your <em>…</em>
source: Step-child
ga: Leasleanbh

# {second_person_name} is your <em>…</em>
source: Brother or sister
ga: Deartháir nó deirfiúr

# {second_person_name} is your <em>…</em>
source: Step-brother or step-sister
ga: Leas-dheartháir nó leas-dheirfiúr

# {second_person_name} is your <em>…</em>
source: Mother or father
ga: Máthair nó athair

# {second_person_name} is your <em>…</em>
source: Step-mother or step-father
ga: Leasmháthair nó leasathair

# {second_person_name} is your <em>…</em>
source: Grandchild
ga: Garpháiste

# {second_person_name} is your <em>…</em>
source: Grandparent
ga: Seantuismitheoir

# {second_person_name} is your <em>…</em>
source: Other relation
ga: Gaol eile

# {second_person_name} is your <em>…</em>
source: Unrelated
ga: Neamhghaolta

# Thinking about {first_person_name}, {second_person_name} is their <em>…</em>
source: Husband or wife
ga: Fear céile nó bean chéile

# Thinking about {first_person_name}, {second_person_name} is their <em>…</em>
source: Civil partner
ga: Páirtnéir sibhialta

# Thinking about {first_person_name}, {second_person_name} is their <em>…</em>
source: Partner
ga: Páirtnéir

# Thinking about {first_person_name}, {second_person_name} is their <em>…</em>
source: Son or daughter
ga: Mac nó iníon

# Thinking about {first_person_name}, {second_person_name} is their <em>…</em>
source: Step-child
ga: Leasleanbh

# Thinking about {first_person_name}, {second_person_name} is their <em>…</em>
source: Brother or sister
ga: Deartháir nó deirfiúr

# Thinking about {first_person_name}, {second_person_name} is their <em>…</em>
source: Step-brother or step-sister
ga: Leasdheartháir nó leasdheirfiúr

# Thinking about {first_person_name}, {second_person_name} is their <em>…</em>
source: Mother or father
ga: Máthair nó athair

# Thinking about {first_person_name}, {second_person_name} is their <em>…</em>
source: Step-mother or step-father
ga: Leasmháthair nó leasathair

# Thinking about {first_person_name}, {second_person_name} is their <em>…</em>
source: Grandchild
ga: Garpháiste

# Thinking about {first_person_name}, {second_person_name} is their <em>…</em>
source: Grandparent
ga: Seantuismitheoir

# Thinking about {first_person_name}, {second_person_name} is their <em>…</em>
source: Other relation
ga: Gaol eile

# Thinking about {first_person_name}, {second_person_name} is their <em>…</em>
source: Unrelated
ga: Neamhghaolta

# Are any of these people related to you?
source: Yes
ga: Tá

# Are any of these people related to you?
source: No, none of these people are related to me
ga: Níl duine ar bith acu seo muinteartha dom

# Are any of these people related to <em>{person_name}</em>?
source: Yes
ga: Tá

# Are any of these people related to <em>{person_name}</em>?
source: No, none of these people are related to {person_name}
ga: Níl duine ar bith acu seo muinteartha do {person_name}

# What type of accommodation is <em>{household_address}</em>?
source: Whole house or bungalow
ga: Teach no bungaló iomlán

# What type of accommodation is <em>{household_address}</em>?
source: Flat, maisonette or apartment
ga: Árasán nó maisonette

# What type of accommodation is <em>{household_address}</em>?
source: Caravan or other mobile or temporary structure
ga: Carbhán nó struchtúr gluaisteach nó sealadach eile

# Which of the following is your house or bungalow?
source: Detached
ga: Teach no bungaló scoite

# Which of the following is your house or bungalow?
source: Semi-detached
ga: Teach no bungaló leathscoite

# Which of the following is your house or bungalow?
source: Terraced
ga: Teach nó bungaló sraithe

# Where is your flat, maisonette or apartment?
source: In a purpose-built block of flats
ga: I mbloc árasán saintógtha

# Where is your flat, maisonette or apartment?
source: Part of a converted or shared house
ga: Mar chuid de theach comhroinnte athchóirithe

# Where is your flat, maisonette or apartment?
source: In a commercial building
ga: I bhfoirgneamh tráchtála

source: Internal wheelchair usage
ga: Úsáid inmheánach do dhaoine i gcathaoireacha rothaí

source: External wheelchair access
ga: Rochtain sheachtrach do dhaoine i gcathaoireacha rothaí

source: Other physical or mobility difficulties
ga: Deacrachtaí fisiceacha nó gluaiseachta eile

source: Visual difficulties
ga: Deacrachtaí amhairc

source: Hearing difficulties
ga: Deacrachtaí éisteachta

source: Other
ga: Eile

source: None of these
ga: Ceann ar bith díobh seo

# What type of central heating does <em>{household_address}</em> have?
source: Oil
ga: Ola

# What type of central heating does <em>{household_address}</em> have?
source: Mains gas
ga: Gás príomhlíne

# What type of central heating does <em>{household_address}</em> have?
source: Tank or bottled gas
ga: Gás taisceadáin nó buidéalaithe

# What type of central heating does <em>{household_address}</em> have?
source: Electric
ga: Leictreach
