Repository: ONSdigital/eq-questionnaire-schemas
Catalog: translations/*/census_household_gb_nir_*.po
Languages: ga

source: None of these conditions
ga: Ceann ar bith de na fadhbanna sláinte seo

source: No
ga: Ní thugaim

source: Yes, 1 to 19 hours a week
ga: Tugann, 1 go 19 n-uaire sa tseachtain

source: Yes, 20 to 34 hours a week
ga: Tugann, 20 go 34 uair sa tseachtain

source: Yes, 35 to 49 hours a week
ga: Tugann, 35 go 49 uair sa tseachtain

source: Yes, 50 hours or more a week
ga: Tugann, 50 uair nó níos mó sa tseachtain

source: No
ga: Ní thugaim

source: Yes, 1 to 19 hours a week
ga: Tugann, 1 go 19 n-uaire sa tseachtain

source: Yes, 20 to 34 hours a week
ga: Tugann, 20 go 34 uair sa tseachtain

source: Yes, 35 to 49 hours a week
ga: Tugann, 35 go 49 uair sa tseachtain

source: Yes, 50 hours or more a week
ga: Tugann, 50 uair nó níos mó sa tseachtain

# Which of the following best describes your sexual orientation?
source: Straight or Heterosexual
ga: Heitrighnéasach

# Which of the following best describes your sexual orientation?
source: Gay or Lesbian
ga: Aerach nó Leispiach

# Which of the following best describes your sexual orientation?
source: Bisexual
ga: Déghnéasach

# Which of the following best describes your sexual orientation?
source: Other sexual orientation
ga: Claonadh gnéis eile

# Which of the following best describes your sexual orientation?
source: Prefer not to say
ga: Níorbh fhearr liom a rá

source: Straight or Heterosexual
ga: Heitrighnéasach

source: Gay or Lesbian
ga: Aerach nó Leispiach

source: Bisexual
ga: Déghnéasach

source: Other sexual orientation
ga: Claonadh gnéis eile

source: Prefer not to say
ga: Níorbh fhearr liom a rá

# Have you achieved a qualification at degree level or above?
source: Yes
ga: Bhain

# Have you achieved a qualification at degree level or above?
source: No
ga: Níor bhain

# Has <em>{person_name}</em> achieved a qualification at degree level or above?
source: Yes
ga: Bhain

# Has <em>{person_name}</em> achieved a qualification at degree level or above?
source: No
ga: Níl

# Have you achieved a GCSE or equivalent qualification?
source: 5 or more GCSEs grades A* to C or 9 to 4
ga: 5 GCSE nó níos mó gráid A* go C nó 9 go 4

# Have you achieved a GCSE or equivalent qualification?
source: Any other GCSEs
ga: GCSE ar bith eile

# Have you achieved a GCSE or equivalent qualification?
source: None of these apply
ga: Ní bhaineann ceann ar bith díobh seo

# Has <em>{person_name}</em> achieved a GCSE or equivalent qualification?
source: 5 or more GCSEs grades A* to C or 9 to 4
ga: 5 GCSE nó níos mó gráid A* go C nó 9 go 4

# Has <em>{person_name}</em> achieved a GCSE or equivalent qualification?
source: Any other GCSEs
ga: GCSE ar bith eile

# Has <em>{person_name}</em> achieved a GCSE or equivalent qualification?
source: None of these apply
ga: Ní bhaineann ceann ar bith díobh seo

# Have you achieved an A level, AS level or equivalent qualifications?
source: 2 or more A levels
ga: 2 Ardleibhéal nó níos mó

# Have you achieved an A level, AS level or equivalent qualifications?
source: 1 A level
ga: 1 Ardleibhéal

# Have you achieved an A level, AS level or equivalent qualifications?
source: 1 AS level
ga: 1 leibhéal AS

# Have you achieved an A level, AS level or equivalent qualifications?
source: None of these apply
ga: Ní bhaineann ceann ar bith díobh seo

source: 2 or more A levels
ga: 2 Ardleibhéal nó níos mó

source: 1 A level
ga: 1 Ardleibhéal

source: 1 AS level
ga: 1 leibhéal AS

source: None of these apply
ga: Ní bhaineann ceann ar bith díobh seo

# Have you achieved an NVQ or equivalent qualification?
source: NVQ level 3 or equivalent
ga: NVQ leibhéal 3 nó a chomhionann

# Have you achieved an NVQ or equivalent qualification?
source: NVQ level 2 or equivalent
ga: NVQ leibhéal 2 nó a chomhionann

# Have you achieved an NVQ or equivalent qualification?
source: NVQ level 1 or equivalent
ga: NVQ leibhéal 1 nó a chomhionann

# Have you achieved an NVQ or equivalent qualification?
source: None of these apply
ga: Ní bhaineann ceann ar bith díobh seo

# Has <em>{person_name}</em> achieved an NVQ or equivalent qualification?
source: NVQ level 3 or equivalent
ga: NVQ leibhéal 3 nó a chomhionann

# Has <em>{person_name}</em> achieved an NVQ or equivalent qualification?
source: NVQ level 2 or equivalent
ga: NVQ leibhéal 2 nó a chomhionann

# Has <em>{person_name}</em> achieved an NVQ or equivalent qualification?
source: NVQ level 1 or equivalent
ga: NVQ leibhéal 1 nó a chomhionann

# Has <em>{person_name}</em> achieved an NVQ or equivalent qualification?
source: None of these apply
ga: Ní bhaineann ceann ar bith díobh seo

# Have you achieved any other qualifications?
source: Yes
ga: Bhain

# Have you achieved any other qualifications?
source: No qualifications
ga: Gan cáilíocht ar bith

# Has <em>{person_name}</em> achieved any other qualifications?
source: Yes
ga: Tá

# Has <em>{person_name}</em> achieved any other qualifications?
source: No qualifications
ga: Gan cáilíocht ar bith

# Have you completed an apprenticeship?
source: Yes
ga: Chríochnaigh

# Have you completed an apprenticeship?
source: No
ga: Níl

# Has <em>{person_name}</em> completed an apprenticeship?
source: Yes
ga: Chríochnaigh

# Has <em>{person_name}</em> completed an apprenticeship?
source: No
ga: Níl

# In the last seven days, were you doing any of the following?
source: Working as an employee
ga: Ag obair mar fhostaí

# In the last seven days, were you doing any of the following?
source: Self-employed or freelance
ga: Féinfhostaithe nó ag obair ar bhonn neamhspleách

# In the last seven days, were you doing any of the following?
source: Temporarily away from work ill, on holiday or temporarily laid off
ga: Ar shiúl ón obair go sealadach de dheasca tinnis, ar saoire nó scaoilte chun bealaigh go sealadach

# In the last seven days, were you doing any of the following?
source: On maternity or paternity leave
ga: Ar saoire mháithreachais nó atharthachta

# In the last seven days, were you doing any of the following?
source: Doing any other kind of paid work
ga: Ag déanamh obair íoctha ar bith eile

# In the last seven days, were you doing any of the following?
source: None of these apply
ga: Ní bhaineann ceann ar bith díobh seo

# In the last seven days, was <em>{person_name}</em> doing any of the following?
source: Working as an employee
ga: Ag obair mar fhostaí

# In the last seven days, was <em>{person_name}</em> doing any of the following?
source: Self-employed or freelance
ga: Féinfhostaithe nó ag obair ar bhonn neamhspleách

# In the last seven days, was <em>{person_name}</em> doing any of the following?
source: Temporarily away from work ill, on holiday or temporarily laid off
ga: Ar shiúl ón obair go sealadach de dheasca tinnis, ar saoire nó scaoilte chun bealaigh go sealadach

# In the last seven days, was <em>{person_name}</em> doing any of the following?
source: On maternity or paternity leave
ga: Ar saoire mháithreachais nó atharthachta

# In the last seven days, was <em>{person_name}</em> doing any of the following?
source: Doing any other kind of paid work
ga: Ag déanamh obair íoctha ar bith eile

# In the last seven days, was <em>{person_name}</em> doing any of the following?
source: None of these apply
ga: Ní bhaineann ceann ar bith díobh seo

# Which of the following describes what you were doing in the last seven days?
source: Retired
ga: Ar scor

# Which of the following describes what you were doing in the last seven days?
source: Studying
ga: Ag staidéar

# Which of the following describes what you were doing in the last seven days?
source: Looking after home or family
ga: Ag tabhairt aire don teach nó don teaghlach

# Which of the following describes what you were doing in the last seven days?
source: Long-term sick or disabled
ga: Tinn nó míchumasach san fhadtéarma

# Which of the following describes what you were doing in the last seven days?
source: Other
ga: Eile

source: Retired
ga: Ar scor

source: Studying
ga: Ag staidéar

source: Looking after home or family
ga: Ag tabhairt aire don teach nó don teaghlach

source: Long-term sick or disabled
ga: Tinn nó míchumasach san fhadtéarma

source: Other
ga: Eile

# In the last four weeks, were you actively looking for any kind of paid work?
source: Yes
ga: Bhí

# In the last four weeks, were you actively looking for any kind of paid work?
source: No
ga: Ní raibh

source: Yes
ga: Tá

source: No
ga: Níl

# If a job became available now, could you start it within two weeks?
source: Yes
ga: D’fhéadfainn

# If a job became available now, could you start it within two weeks?
source: No
ga: Ní fhéadfainn

source: Yes
ga: Tá

source: No
ga: Níl

# In the last seven days, were you waiting to start a job already accepted?
source: Yes
ga: Bhí

# In the last seven days, were you waiting to start a job already accepted?
source: No
ga: Ní raibh

source: Yes
ga: Tá

source: No
ga: Níl

# Have you ever done any paid work?
source: Yes, in the last 12 months
ga: Rinne, sa 12 mhí is déanaí

# Have you ever done any paid work?
source: Yes, but not in the last 12 months
ga: Rinne, ach gan sa 12 mhí is déanaí

# Have you ever done any paid work?
source: No, have never worked
ga: Ní dhearna mé obair ar bith riamh

# Has <em>{person_name}</em> ever done any paid work?
source: Yes, in the last 12 months
ga: Rinne, sa 12 mhí is déanaí

# Has <em>{person_name}</em> ever done any paid work?
source: Yes, but not in the last 12 months
ga: Rinne, ach gan sa 12 mhí is déanaí

# Has <em>{person_name}</em> ever done any paid work?
source: No, has never worked
ga: Ní dhearna obair ar bith riamh roimhe

# In your main job, what is your employment status?
source: Employee
ga: Fostaí

# In your main job, what is your employment status?
source: Self-employed or freelance without employees
ga: Féinfhostaithe nó ag obair go neamhspleách gan fostaí ar bith

# In your main job, what is your employment status?
source: Self-employed with employees
ga: Féinfhostaithe le fostaithe

# In their main job, what is <em>{person_name_possessive}</em> employment status?
source: Employee
ga: Fostaí

# In their main job, what is <em>{person_name_possessive}</em> employment status?
source: Self-employed or freelance without employees
ga: Féinfhostaithe nó ag obair go neamhspleách gan fostaí ar bith

# In their main job, what is <em>{person_name_possessive}</em> employment status?
source: Self-employed with employees
ga: Féinfhostaithe le fostaithe

# In your main job, what was your employment status?
source: Employee
ga: Fostaí

# In your main job, what was your employment status?
source: Self-employed or freelance without employees
ga: Féinfhostaithe nó ag obair go neamhspleách gan fostaí ar bith

# In your main job, what was your employment status?
source: Self-employed with employees
ga: Féinfhostaithe le fostaithe

# In their main job, what was <em>{person_name_possessive}</em> employment status?
source: Employee
ga: Fostaí

# In their main job, what was <em>{person_name_possessive}</em> employment status?
source: Self-employed or freelance without employees
ga: Féinfhostaithe nó ag obair go neamhspleách gan fostaí ar bith

# In their main job, what was <em>{person_name_possessive}</em> employment status?
source: Self-employed with employees
ga: Féinfhostaithe le fostaithe

# What is the name of the organisation or business you work for?
source: No organisation or work for a private individual
ga: Eagraíocht nó obair ar bith do dhuine aonair príobháideach

source: No organisation or works for a private individual
ga: Eagraíocht nó obair ar bith do dhuine aonair príobháideach

# What was the name of the organisation or business you worked for?
source: No organisation or worked for a private individual
ga: Eagraíocht nó obair ar bith do dhuine aonair príobháideach

source: No organisation or worked for a private individual
ga: Eagraíocht nó obair ar bith do dhuine aonair príobháideach

# Do you supervise or oversee the work of other employees on a day-to-day basis?
source: Yes
ga: Déanaim

# Do you supervise or oversee the work of other employees on a day-to-day basis?
source: No
ga: Ní dhéanaim

source: Yes
ga: Déanann

source: No
ga: Ní dhéanann

# Did you supervise or oversee the work of other employees on a day-to-day basis?
source: Yes
ga: Rinne

# Did you supervise or oversee the work of other employees on a day-to-day basis?
source: No
ga: Ní dhearna

source: Yes
ga: Rinne

source: No
ga: Ní dhearna

# In your main job, how many hours a week do you usually work?
source: 0 to 15 hours a week
ga: 0 go 15 uair sa tseachtain

# In your main job, how many hours a week do you usually work?
source: 16 to 30 hours a week
ga: 16 go 30 uair sa tseachtain

# In your main job, how many hours a week do you usually work?
source: 31 to 48 hours a week
ga: 31 go 48 uair sa tseachtain

# In your main job, how many hours a week do you usually work?
source: 49 hours or more a week
ga: 49 uair nó níos mó sa tseachtain

source: 0 to 15 hours a week
ga: 0 go 15 uair sa tseachtain

source: 16 to 30 hours a week
ga: 16 go 30 uair sa tseachtain

source: 31 to 48 hours a week
ga: 31 go 48 uair sa tseachtain

source: 49 hours or more a week
ga: 49 uair nó níos mó sa tseachtain

# In your main job, how many hours a week did you usually work?
source: 0 to 15 hours a week
ga: 0 go 15 uair sa tseachtain

# In your main job, how many hours a week did you usually work?
source: 16 to 30 hours a week
ga: 16 go 30 uair sa tseachtain

# In your main job, how many hours a week did you usually work?
source: 31 to 48 hours a week
ga: 31 go 48 uair sa tseachtain

# In your main job, how many hours a week did you usually work?
source: 49 hours or more a week
ga: 49 uair nó níos mó sa tseachtain

source: 0 to 15 hours a week
ga: 0 go 15 uair sa tseachtain

source: 16 to 30 hours a week
ga: 16 go 30 uair sa tseachtain

source: 31 to 48 hours a week
ga: 31 go 48 uair sa tseachtain

source: 49 hours or more a week
ga: 49 uair nó níos mó sa tseachtain

# Where is your main place of <em>work</em>?
source: At a workplace
ga: San áit oibre

# Where is your main place of <em>work</em>?
source: At or from home
ga: Sa bhaile nó ón bhaile

# Where is your main place of <em>work</em>?
source: No fixed place
ga: Gan aon áit sheasta

# Where is <em>{person_name_possessive}</em> main place of <em>work</em>?
source: At a workplace
ga: San áit oibre

# Where is <em>{person_name_possessive}</em> main place of <em>work</em>?
source: At or from home
ga: Sa bhaile nó ón bhaile

# Where is <em>{person_name_possessive}</em> main place of <em>work</em>?
source: No fixed place
ga: Gan aon áit sheasta

# Where did you mainly <em>work</em>?
source: At a workplace
ga: San áit oibre

# Where did you mainly <em>work</em>?
source: At or from home
ga: Sa bhaile nó ón bhaile

# Where did you mainly <em>work</em>?
source: No fixed place
ga: Gan aon áit sheasta

# Where did <em>{person_name}</em> mainly <em>work</em>?
source: At a workplace
ga: San áit oibre

# Where did <em>{person_name}</em> mainly <em>work</em>?
source: At or from home
ga: Sa bhaile nó ón bhaile

# Where did <em>{person_name}</em> mainly <em>work</em>?
source: No fixed place
ga: Gan aon áit sheasta

# Is your main place of <em>work</em> in the UK?
source: Yes
ga: Tá

# Is your main place of <em>work</em> in the UK?
source: No, it is in another country
ga: Ní hea, tá sé i dtír eile

# Is <em>{person_name_possessive}</em> main place of <em>work</em> in the UK?
source: Yes
ga: Tá

# Is <em>{person_name_possessive}</em> main place of <em>work</em> in the UK?
source: No, it is in another country
ga: Ní hea, tá sé i dtír eile

# Was your main place of <em>work</em> in the UK?
source: Yes
ga: Bhí

# Was your main place of <em>work</em> in the UK?
source: No, it was in another country
ga: Ní hea, bhí sé i dtír eile

# Was <em>{person_name_possessive}</em> main place of <em>work</em> in the UK?
source: Yes
ga: Bhí

# Was <em>{person_name_possessive}</em> main place of <em>work</em> in the UK?
source: No, it was in another country
ga: Ní hea, bhí sé i dtír eile

# How do you usually travel to your main place of <em>work</em>?
source: Driving a car or van
ga: Ag tiomáint gluaisteáin nó veain

# How do you usually travel to your main place of <em>work</em>?
source: Passenger in a car or van
ga: Paisinéir i ngluaisteán nó i veain

# How do you usually travel to your main place of <em>work</em>?
source: Car or van pool, sharing driving
ga: Ag roinnt gluaisteáin nó veain, nó ag roinnt tiomána

# How do you usually travel to your main place of <em>work</em>?
source: Bus, minibus or coach
ga: Bus, mionbus nó cóiste

# How do you usually travel to your main place of <em>work</em>?
source: Taxi
ga: Tacsaí

# How do you usually travel to your main place of <em>work</em>?
source: Train
ga: Traein

# How do you usually travel to your main place of <em>work</em>?
source: Motorcycle, scooter or moped
ga: Gluaisrothar, scútar nó móipéid

# How do you usually travel to your main place of <em>work</em>?
source: Bicycle
ga: Rothar

# How do you usually travel to your main place of <em>work</em>?
source: On foot
ga: Siúl

# How do you usually travel to your main place of <em>work</em>?
source: Other
ga: Eile

source: Driving a car or van
ga: Ag tiomáint gluaisteáin nó veain

source: Passenger in a car or van
ga: Paisinéir i ngluaisteán nó i veain

source: Car or van pool, sharing driving
ga: Ag roinnt gluaisteáin nó veain, nó ag roinnt tiomána

source: Bus, minibus or coach
ga: Bus, mionbus nó cóiste

source: Taxi
ga: Tacsaí

source: Train
ga: Traein

source: Motorcycle, scooter or moped
ga: Gluaisrothar, scútar nó móipéid

source: Bicycle
ga: Rothar

source: On foot
ga: Siúl

source: Other
ga: Eile

# How did you usually travel to your main place of <em>work</em>?
source: Driving a car or van
ga: Ag tiomáint gluaisteáin nó veain

# How did you usually travel to your main place of <em>work</em>?
source: Passenger in a car or van
ga: Paisinéir i ngluaisteán nó i veain

# How did you usually travel to your main place of <em>work</em>?
source: Car or van pool, sharing driving
ga: Ag roinnt gluaisteáin nó veain, nó ag roinnt tiomána

# How did you usually travel to your main place of <em>work</em>?
source: Bus, minibus or coach
ga: Bus, mionbus nó cóiste

# How did you usually travel to your main place of <em>work</em>?
source: Taxi
ga: Tacsaí

# How did you usually travel to your main place of <em>work</em>?
source: Train
ga: Traein

# How did you usually travel to your main place of <em>work</em>?
source: Motorcycle, scooter or moped
ga: Gluaisrothar, scútar nó móipéid

# How did you usually travel to your main place of <em>work</em>?
source: Bicycle
ga: Rothar

# How did you usually travel to your main place of <em>work</em>?
source: On foot
ga: Siúl

# How did you usually travel to your main place of <em>work</em>?
source: Other
ga: Eile

source: Driving a car or van
ga: Ag tiomáint gluaisteáin nó veain

source: Passenger in a car or van
ga: Paisinéir i ngluaisteán nó i veain

source: Car or van pool, sharing driving
ga: Ag roinnt gluaisteáin nó veain, na tiomána

source: Bus, minibus or coach
ga: Bus, mionbus nó cóiste

source: Taxi
ga: Tacsaí

source: Train
ga: Traein

source: Motorcycle, scooter or moped
ga: Gluaisrothar, scútar nó móipéid

source: Bicycle
ga: Rothar

source: On foot
ga: Siúl

source: Other
ga: Eile

# Where is your main place of <em>study</em>?
source: At a campus or school
ga: Ag campas nó ar scoil

# Where is your main place of <em>study</em>?
source: At or from home
ga: Sa bhaile nó ón bhaile

# Where is your main place of <em>study</em>?
source: No fixed place
ga: Gan aon áit sheasta

# Where is <em>{person_name_possessive}</em> main place of <em>study</em>?
source: At a campus or school
ga: Ag campas nó ar scoil

# Where is <em>{person_name_possessive}</em> main place of <em>study</em>?
source: At or from home
ga: Sa bhaile nó ón bhaile

# Where is <em>{person_name_possessive}</em> main place of <em>study</em>?
source: No fixed place
ga: Gan aon áit sheasta

# Is your place of <em>study</em> in Northern Ireland?
source: Yes
ga: Tá

# Is your place of <em>study</em> in Northern Ireland?
source: No, it is in another country
ga: Ní hea, tá sé i dtír eile

source: Yes
ga: Tá

source: No, it is in another country
ga: Ní hea, tá sé i dtír eile

source: Driving a car or van
ga: Ag tiomáint gluaisteáin nó veain

source: Passenger in a car or van
ga: Paisinéir i ngluaisteán nó i veain

source: Car or van pool, sharing driving
ga: Ag roinnt gluaisteáin nó veain, na tiomána

source: Bus, minibus or coach
ga: Bus, mionbus nó cóiste

source: Taxi
ga: Tacsaí

source: Train
ga: Traein

source: Motorcycle, scooter or moped
ga: Gluaisrothar, scútar nó móipéid

source: Bicycle
ga: Rothar

source: On foot
ga: Siúl

source: Other
ga: Eile

source: Driving a car or van
ga: Ag tiomáint gluaisteáin nó veain

source: Passenger in a car or van
ga: Paisinéir i ngluaisteán nó i veain

source: Car or van pool, sharing driving
ga: Ag roinnt gluaisteáin nó veain, na tiomána

source: Bus, minibus or coach
ga: Bus, mionbus nó cóiste

source: Taxi
ga: Tacsaí

source: Train
ga: Traein

source: Motorcycle, scooter or moped
ga: Gluaisrothar, scútar nó móipéid

source: Bicycle
ga: Rothar

source: On foot
ga: Siúl

source: Other
ga: Eile

# What is <em>{person_name_possessive}</em> usual address?
source: An address in the UK
ga: Seoladh sa RA

# What is <em>{person_name_possessive}</em> usual address?
source: An address outside the UK
ga: Seoladh taobh amuigh den RA

# What is <em>{person_name_possessive}</em> usual address?
source: Same address as {first_person}
ga: An seoladh céanna leis an {first_person}

source: Include babies born on or before {census_date}, children, students and schoolchildren who live away from home during term time
ga: Cuir san áireamh leanaí a rugadh ar nó roimh {census_date}, páistí, mic léinn agus páistí scoile a chónaíonn ar shiúl ón bhaile le linn am téarma

source: For example, working away, on holiday, in the armed forces, living in an establishment such as a care home for up to 6 months, abroad for up to a year
ga: Mar shampla, ag obair ar shiúl ón bhaile, ar saoire, sna fórsaí armtha, cónaíonn i leithéidí baile cúraim ar feadh suas le sé mhí, thar lear ar feadh suas le bliain

source: For example, UK residents between addresses or currently without a home
ga: Mar shampla, cónaitheoirí RA atá idir sheoltaí nó gan áit chónaithe faoi láthair

source: Include babies born on or before {census_date}, children, students and schoolchildren who live away from home during term time
ga: Cuir san áireamh leanaí a rugadh ar nó roimh {census_date}, páistí, mic léinn agus páistí scoile a chónaíonn ar shiúl ón bhaile le linn am téarma

source: For example, working away, on holiday, in the armed forces, living in an establishment such as a care home for up to 6 months, abroad for up to a year
ga: Mar shampla, ag obair ar shiúl ón bhaile, ar saoire, sna fórsaí armtha, cónaíonn i leithéidí baile cúraim ar feadh suas le sé mhí, thar lear ar feadh suas le bliain

source: For example, UK residents between addresses or currently without a home
ga: Mar shampla, cónaitheoirí RA atá idir sheoltaí nó gan áit chónaithe faoi láthair

source: For example, this is a second address or holiday home
ga: Mar shampla, is é seo an dara seoladh nó is teach saoire é

# {second_person_name} is your <em>…</em>
source: Including half-brother or half-sister
ga: Leathdheartháir nó leathdheirfiúr san áireamh

# {second_person_name} is your <em>…</em>
source: Including foster child
ga: Páiste altrama san áireamh

# Thinking about {first_person_name}, {second_person_name} is their <em>…</em>
source: Including half-brother or half-sister
ga: Leathdheartháir nó leathdheirfiúr san áireamh

# Thinking about {first_person_name}, {second_person_name} is their <em>…</em>
source: Including foster child
ga: Páiste altrama san áireamh
