Repository: ONSdigital/eq-questionnaire-schemas
Catalog: translations/*/census_household_gb_wls_*.po
Languages: cy

# Do you mainly work in the UK?
source: If the <strong>coronavirus</strong> pandemic has affected where you mainly work, select the answer that best describes your <strong>current circumstances</strong>
cy: Os yw pandemig y <strong>coronafeirws</strong> wedi effeithio ar ble rydych chi'n gweithio'n bennaf, dewiswch yr ateb sy'n disgrifio orau eich <strong>amgylchiadau ar hyn o bryd</strong>

# Does <em>{person_name}</em> mainly work in the UK?
source: If the <strong>coronavirus</strong> pandemic has affected where they mainly work, select the answer that best describes their <strong>current circumstances</strong>
cy: Os yw pandemig y <strong>coronafeirws</strong> wedi effeithio ar ble rydych chi'n gweithio'n bennaf, dewiswch yr ateb sy'n disgrifio orau yr <strong>amgylchiadau ar hyn o bryd</strong>

# Are you sure you want to remove <em>{person_name}</em>?
source: All of the information entered about this person will be deleted
cy: Caiff yr holl wybodaeth a roddwyd am y person hwn ei dileu

# Do you usually live at {household_address}?
source: What we mean by “usually live”
cy: Beth mae “byw fel arfer” yn ei olygu

source: Who to include
cy: Pwy i’w gynnwys

source: Who to include
cy: Pwy i’w gynnwys

source: What we mean by “household”
cy: Pwy sy’n cael eu cyfrif yn “aelodau o’r cartref”

# Do you stay at another address for more than 30 days a year?
source: What we mean by “another address”
cy: Beth mae “cyfeiriad arall” yn ei olygu

source: What we mean by “another address”
cy: Beth mae “cyfeiriad arall” yn ei olygu

# What is your main language?
source: What we mean by “main language”
cy: Beth mae “prif iaith” yn ei olygu

# What is <em>{person_name_possessive}</em> main language?
source: What we mean by “main language”
cy: Beth mae “prif iaith” yn ei olygu

source: What we mean by “physical and mental health conditions or illnesses”
cy: Beth mae "cyflwr neu salwch corfforol neu feddyliol” yn ei olygu

source: What we mean by “physical and mental health conditions or illnesses”
cy: Beth mae "cyflwr neu salwch corfforol neu feddyliol” yn ei olygu

source: What we mean by “reduce your ability”
cy: Beth mae “lleihau eich gallu” yn ei olygu

source: What we mean by “reduce their ability”
cy: Beth mae “lleihau gallu” yn ei olygu

# Have you achieved a qualification at degree level or above?
source: What we mean by “degree level or above”
cy: Beth mae “lefel gradd neu uwch” yn ei olygu

# Has <em>{person_name}</em> achieved a qualification at degree level or above?
source: What we mean by “degree level or above”
cy: Beth mae “lefel gradd neu uwch” yn ei olygu

# Have you achieved an NVQ or equivalent qualification?
source: What we mean by “NVQ”
cy: Beth mae “NVQ” yn ei olygu

# Has <em>{person_name}</em> achieved an NVQ or equivalent qualification?
source: What we mean by “NVQ”
cy: Beth mae “NVQ” yn ei olygu

# Have you achieved an AS, A level or equivalent qualification?
source: What we mean by “AS and A level”
cy: Beth mae “Lefel AS (Safon UG) a Lefel A (Safon Uwch)” yn ei olygu

# Has <em>{person_name}</em> achieved an AS, A level or equivalent qualification?
source: What we mean by “AS and A level”
cy: Beth mae “Lefel AS (Safon UG) a Lefel A (Safon Uwch)” yn ei olygu

# Have you achieved a GCSE or equivalent qualification?
source: What we mean by “GCSE”
cy: Beth mae “TGAU” yn ei olygu

# Has <em>{person_name}</em> achieved a GCSE or equivalent qualification?
source: What we mean by “GCSE”
cy: Beth mae “TGAU” yn ei olygu

# Where do you mainly work?
source: What we mean by “mainly work”
cy: Beth mae "gweithio'n bennaf" yn ei olygu

# Where does <em>{person_name}</em> mainly work?
source: What we mean by “mainly work”
cy: Beth mae "gweithio'n bennaf" yn ei olygu

# Do you usually live at {household_address}?
source: This is often your permanent or family home.
cy: Hwn fydd eich cartref parhaol neu gartref y teulu fel arfer.

# Do you usually live at {household_address}?
source: If you have more than one address, include yourself at the home address where you generally spend most of your time. If you split your time equally then use the home address where you are staying overnight on Sunday {census_date}.
cy: Os oes gennych chi fwy nag un cyfeiriad, dylech gynnwys eich hun yn y cyfeiriad cartref lle rydych chi’n treulio’r rhan fwyaf o’ch amser ar y cyfan. Os ydych chi’n rhannu eich amser yn gyfartal, defnyddiwch y cyfeiriad cartref lle rydych chi’n aros dros nos ddydd Sul {census_date}.

# Do you usually live at {household_address}?
source: <strong>Students</strong>, include yourself at both your term-time and out of term-time addresses.
cy: <strong>Fyfyrwyr</strong>, dylech gynnwys eich hun yn eich cyfeiriad yn ystod y tymor a’ch cyfeiriad y tu allan i’r tymor.

# Do you usually live at {household_address}?
source: <strong>People with a second address for work</strong>, include yourself at your home address.
cy: <strong>Bobl sydd ag ail gyfeiriad ar gyfer gwaith</strong>, dylech gynnwys eich hun yn eich cyfeiriad cartref.

# Do you usually live at {household_address}?
source: <strong>Armed forces members</strong>, include yourself at your home address if you have one.
cy: <strong>Aelodau o’r lluoedd arfog</strong>, dylech gynnwys eich hun yn eich cyfeiriad cartref os oes un gennych chi.

source: This is often their permanent or family home.
cy: Hwn fydd eu cartref parhaol neu gartref y teulu fel arfer.

source: If someone has more than one home address, include them at this address if they generally spend most of their time here. For example, children whose parents live apart. If they split their time equally then include them at this address if they are staying overnight on Sunday {census_date}.
cy: Os oes gan rywun fwy nag un cyfeiriad cartref, dylech gynnwys yr unigolyn yn y cyfeiriad hwn os bydd yn treulio’r rhan fwyaf o’i amser yma ar y cyfan. Er enghraifft, plant sydd â rhieni sy’n byw ar wahân. Os yw’r unigolyn yn rhannu ei amser yn gyfartal yna dylech ei gynnwys yn y cyfeiriad hwn os yw’n aros dros nos ddydd Sul {census_date}.

source: Remember to include
cy: Cofiwch gynnwys

source: This is often their permanent or family home.
cy: Hwn fydd eu cartref parhaol neu gartref y teulu fel arfer.

source: If someone has more than one home address, include them at this address if they generally spend most of their time here. For example, children whose parents live apart. If they split their time equally then include them at this address if they are staying overnight on Sunday {census_date}.
cy: Os oes gan rywun fwy nag un cyfeiriad cartref, dylech gynnwys yr unigolyn yn y cyfeiriad hwn os bydd yn treulio’r rhan fwyaf o’i amser yma ar y cyfan. Er enghraifft, plant sydd â rhieni sy’n byw ar wahân. Os yw’r unigolyn yn rhannu ei amser yn gyfartal yna dylech ei gynnwys yn y cyfeiriad hwn os yw’n aros dros nos ddydd Sul {census_date}.

source: Remember to include
cy: Cofiwch gynnwys

source: This is one person living alone or a group of people, not necessarily related, living at the same address, who share cooking facilities and share a living room or sitting room or dining area.
cy: Un person sy'n byw ar ei ben ei hun neu grŵp o bobl, nad oes rhaid iddyn nhw fod yn perthyn i’w gilydd, sy’n byw yn yr un cyfeiriad, ac sy’n rhannu cyfleusterau coginio ac ystafell fyw neu lolfa neu le bwyta.

# Do you stay at another address for more than 30 days a year?
source: This is a single address that is different to the one at the start of this questionnaire. This might be another parent or guardian’s address, a term-time address, a partner’s address or a holiday home.
cy: Cyfeiriad unigol yw hwn sy’n wahanol i’r un ar ddechrau’r holiadur hwn. Gall fod yn gyfeiriad rhiant neu warcheidwad arall, cyfeiriad yn ystod y tymor, cyfeiriad partner neu gyfeiriad tŷ gwyliau.

source: This is a single address that is different to the one at the start of this questionnaire. This might be another parent or guardian’s address, a term-time address, a partner’s address or a holiday home.
cy: Cyfeiriad unigol yw hwn sy’n wahanol i’r un ar ddechrau’r holiadur hwn. Gall fod yn gyfeiriad rhiant neu warcheidwad arall, cyfeiriad yn ystod y tymor, cyfeiriad partner neu gyfeiriad tŷ gwyliau.

# What is your main language?
source: This is the language you use most naturally. For example, it could be the language you use at home.
cy: Dyma’r iaith rydych chi’n ei defnyddio’n fwyaf naturiol, er enghraifft, gallai fod yr iaith rydych chi’n ei defnyddio gartref.

# What is <em>{person_name_possessive}</em> main language?
source: This is the language they use most naturally. For example, it could be the language they use at home.
cy: Dyma’r iaith mae’r unigolyn yn ei defnyddio’n fwyaf naturiol, er enghraifft, gallai fod yr iaith mae’n ei defnyddio gartref.

source: This is about health conditions, illnesses or impairments you may have.
cy: Mae hyn yn ymwneud â chyflwr iechyd, salwch neu nam a all fod gennych chi.

source: Consider conditions that always affect you and those that flare up from time to time. These may include, for example, sensory conditions, developmental conditions or learning impairments.
cy: Dylech ystyried cyflyrau sydd bob amser yn effeithio arnoch chi a’r rhai sy’n ailgodi o bryd i’w gilydd. Gall hyn gynnwys cyflwr ar y synhwyrau, cyflwr datblygiadol neu anhawster dysgu, er enghraifft.

source: This is about health conditions, illnesses or impairments they may have.
cy: Mae hyn yn ymwneud â chyflwr iechyd, salwch neu nam a all fod gan yr unigolyn.

source: Consider conditions that always affect them and those that flare up from time to time. These may include, for example, sensory conditions, developmental conditions or learning impairments.
cy: Dylech ystyried cyflyrau sydd bob amser yn effeithio ar yr unigolyn a’r rhai sy’n ailgodi o bryd i’w gilydd. Gall hyn gynnwys cyflwr ar y synhwyrau, cyflwr datblygiadol neu anhawster dysgu, er enghraifft.

source: This is about whether your health condition or illness currently affects your ability to carry out day-to-day activities.
cy: Mae hyn yn ymwneud â faint o effaith mae eich cyflwr iechyd neu'ch salwch yn ei chael ar eich gallu i wneud gweithgareddau pob dydd ar hyn o bryd.

source: Consider whether you are still affected while receiving any treatment, medication or using any devices for your condition or illness. For example, if you use a hearing aid and are not restricted in carrying out your day-to-day activities when doing so, select “Not at all”.
cy: Dylech ystyried a yw eich cyflwr neu'ch salwch yn dal i effeithio arnoch wrth i chi gael unrhyw driniaeth neu feddyginiaeth, neu wrth i chi ddefnyddio unrhyw ddyfeisiau ar ei gyfer. Er enghraifft, os ydych chi’n defnyddio cymorth clyw, ac nad yw eich gallu i wneud gweithgareddau pob dydd yn cael ei gyfyngu o gwbl wrth i chi ei ddefnyddio, dylech ddewis "Ddim o gwbl".

source: You should select “Yes, a lot” if you usually need some level of support from family members, friends or personal social services for most normal daily activities.
cy: Dylech ddewis “Ydy, yn fawr” os oes angen rhywfaint o gymorth arnoch chi fel arfer, gan aelodau o'r teulu, ffrindiau neu wasanaethau cymdeithasol personol ar gyfer y rhan fwyaf o weithgareddau arferol, pob dydd.

source: This is about whether their health condition or illness currently affects their ability to carry out day-to-day activities.
cy: Mae hyn yn ymwneud â faint o effaith mae cyflwr iechyd neu salwch yr unigolyn yn ei chael ar y gallu i wneud gweithgareddau pob dydd ar hyn o bryd.

source: Consider whether they are still affected while receiving any treatment, medication or using any devices for their condition or illness. For example, if they use a hearing aid and are not restricted in carrying out their day-to-day activities when doing so, select “Not at all”.
cy: Dylech ystyried a yw’r cyflwr neu'r salwch yn dal i effeithio ar yr unigolyn wrth gael unrhyw driniaeth neu feddyginiaeth, neu wrth ddefnyddio unrhyw ddyfeisiau ar ei gyfer. Er enghraifft, os yw’n defnyddio cymorth clyw, ac nad yw ei allu i wneud gweithgareddau pob dydd yn cael ei gyfyngu o gwbl wrth ei ddefnyddio, dylech ddewis "Ddim o gwbl".

source: You should select “Yes, a lot” if they usually need some level of support from family members, friends or personal social services for most normal daily activities.
cy: Dylech ddewis “Ydy, yn fawr” os oes angen rhywfaint o gymorth ar yr unigolyn fel arfer, gan aelodau o'r teulu, ffrindiau neu wasanaethau cymdeithasol personol ar gyfer y rhan fwyaf o weithgareddau arferol, pob dydd.

# Have you achieved a qualification at degree level or above?
source: This is any higher education qualification, achieved in the UK or another country, at level 4 or above.
cy: Mae hyn yn golygu unrhyw gymhwyster addysg uwch, a gafodd ei ennill yn y Deyrnas Unedig neu wlad arall, ar lefel 4 neu uwch.

# Have you achieved a qualification at degree level or above?
source: Students are usually aged 18 years or over when they begin these qualifications through a college or university.
cy: Fel arfer bydd myfyrwyr yn 18 oed neu’n hŷn yn dechrau astudio’r cymwysterau hyn drwy goleg neu brifysgol.

# Have you achieved a qualification at degree level or above?
source: Examples include level 4 and 5 qualifications, bachelor’s degrees with or without honours, master’s degrees, PhD or other doctorates and professional qualifications, such as PGCE or chartership.
cy: Mae enghreifftiau yn cynnwys cymwysterau lefel 4 a 5, graddau baglor gyda neu heb anrhydedd, graddau meistr, PhD neu ddoethuriaethau eraill a chymwysterau proffesiynol, fel TAR neu siarteriaeth.

# Has <em>{person_name}</em> achieved a qualification at degree level or above?
source: This is any higher education qualification, achieved in the UK or another country, at level 4 or above.
cy: Mae hyn yn golygu unrhyw gymhwyster addysg uwch, a gafodd ei ennill yn y Deyrnas Unedig neu wlad arall, ar lefel 4 neu uwch.

# Has <em>{person_name}</em> achieved a qualification at degree level or above?
source: Students are usually aged 18 years or over when they begin these qualifications through a college or university.
cy: Fel arfer bydd myfyrwyr yn 18 oed neu’n hŷn yn dechrau astudio’r cymwysterau hyn drwy goleg neu brifysgol.

# Has <em>{person_name}</em> achieved a qualification at degree level or above?
source: Examples include level 4 and 5 qualifications, bachelor’s degrees with or without honours, master’s degrees, PhD or other doctorates and professional qualifications, such as PGCE or chartership.
cy: Mae enghreifftiau yn cynnwys cymwysterau lefel 4 a 5, graddau baglor gyda neu heb anrhydedd, graddau meistr, PhD neu ddoethuriaethau eraill a chymwysterau proffesiynol, fel TAR neu siarteriaeth.

# Have you achieved an NVQ or equivalent qualification?
source: This is a National Vocational Qualification. NVQs are competency and skills-based qualifications that can be achieved in school, college or at work.
cy: Cymhwyster Galwedigaethol Cenedlaethol yw hwn. Mae NVQs yn gymwysterau sy’n seiliedig ar gymwyseddau a sgiliau ac mae’n bosibl eu hennill mewn ysgolion, colegau neu yn y gwaith.

# Have you achieved an NVQ or equivalent qualification?
source: If you have achieved similar qualifications, such as Scottish Vocational Qualifications or other vocational qualifications outside of the UK, choose the options you think are the closest match.
cy: Os ydych chi wedi ennill cymwysterau tebyg, fel Cymwysterau Galwedigaethol yr Alban neu gymwysterau galwedigaethol eraill y tu allan i’r Deyrnas Unedig, dewiswch yr opsiynau sydd agosaf yn eich barn chi.

# Has <em>{person_name}</em> achieved an NVQ or equivalent qualification?
source: This is a National Vocational Qualification. NVQs are competency and skills-based qualifications that can be achieved in school, college or at work.
cy: Cymhwyster Galwedigaethol Cenedlaethol yw hwn. Mae NVQs yn gymwysterau sy’n seiliedig ar gymwyseddau a sgiliau ac mae’n bosibl eu hennill mewn ysgolion, colegau neu yn y gwaith.

# Has <em>{person_name}</em> achieved an NVQ or equivalent qualification?
source: If they have achieved similar qualifications, such as Scottish Vocational Qualifications or other vocational qualifications outside of the UK, choose the options they think are the closest match.
cy: Os yw’r unigolyn wedi ennill cymwysterau tebyg, fel Cymwysterau Galwedigaethol yr Alban neu gymwysterau galwedigaethol eraill y tu allan i’r Deyrnas Unedig, dewiswch yr opsiynau y mae’n credu sydd agosaf.

# Have you achieved an AS, A level or equivalent qualification?
source: These are advanced-level, subject-based qualifications that are often needed to get a place at university. Students in Wales and England usually complete AS levels by the age of 17 years and A levels by the age of 18 years.
cy: Cymwysterau lefel uwch sy’n seiliedig ar bynciau yw’r rhain ac mae eu hangen nhw yn aml er mwyn cael lle mewn prifysgol. Bydd myfyrwyr yng Nghymru a Lloegr fel arfer yn cwblhau Lefel AS (Safon UG) erbyn eu bod yn 17 oed a Lefel A (Safon Uwch) erbyn eu bod yn 18 oed.

# Have you achieved an AS, A level or equivalent qualification?
source: If you have achieved similar qualifications outside of Wales and England, choose the options you think are the closest match.
cy: Os ydych chi wedi ennill cymwysterau tebyg y tu allan i Gymru a Lloegr, dewiswch yr opsiynau sydd agosaf yn eich barn chi.

# Have you achieved an AS, A level or equivalent qualification?
source: An International Baccalaureate diploma is equivalent to three A levels.
cy: Mae diploma Bagloriaeth Ryngwladol yn cyfateb i dair Lefel A (Safon Uwch).

# Has <em>{person_name}</em> achieved an AS, A level or equivalent qualification?
source: These are advanced-level, subject-based qualifications that are often needed to get a place at university. Students in Wales and England usually complete AS levels by the age of 17 years and A levels by the age of 18 years.
cy: Cymwysterau lefel uwch sy’n seiliedig ar bynciau yw’r rhain ac mae eu hangen nhw yn aml er mwyn cael lle mewn prifysgol. Bydd myfyrwyr yng Nghymru a Lloegr fel arfer yn cwblhau Lefel AS (Safon UG) erbyn eu bod yn 17 oed a Lefel A (Safon Uwch) erbyn eu bod yn 18 oed.

# Has <em>{person_name}</em> achieved an AS, A level or equivalent qualification?
source: If they have achieved similar qualifications outside of Wales and England, choose the options they think are the closest match.
cy: Os yw’r unigolyn wedi ennill cymwysterau tebyg y tu allan i Gymru a Lloegr, dewiswch yr opsiynau y mae’n credu sydd agosaf.

# Has <em>{person_name}</em> achieved an AS, A level or equivalent qualification?
source: An International Baccalaureate diploma is equivalent to three A levels.
cy: Mae diploma Bagloriaeth Ryngwladol yn cyfateb i dair Lefel A (Safon Uwch).

# Have you achieved a GCSE or equivalent qualification?
source: This is a General Certificate of Secondary Education. GCSEs are subject based. Students in Wales and England usually complete GCSEs at school by the age of 16 years.
cy: Tystysgrif Gyffredinol Addysg Uwchradd yw hon. Mae TGAU yn seiliedig ar bynciau. Bydd myfyrwyr yng Nghymru a Lloegr fel arfer yn cwblhau TGAU mewn ysgol erbyn eu bod yn 16 oed.

# Have you achieved a GCSE or equivalent qualification?
source: If you have achieved CSEs, O levels or other similar qualifications outside of Wales and England, choose the options you think are the closest match.
cy: Os ydych chi wedi ennill cymwysterau TAU neu Lefel O neu gymwysterau tebyg eraill y tu allan i Gymru a Lloegr, dewiswch yr opsiynau sydd agosaf yn eich barn chi.

# Has <em>{person_name}</em> achieved a GCSE or equivalent qualification?
source: This is a General Certificate of Secondary Education. GCSEs are subject based. Students in Wales and England usually complete GCSEs at school by the age of 16 years.
cy: Tystysgrif Gyffredinol Addysg Uwchradd yw hon. Mae TGAU yn seiliedig ar bynciau. Bydd myfyrwyr yng Nghymru a Lloegr fel arfer yn cwblhau TGAU mewn ysgol erbyn eu bod yn 16 oed.

# Has <em>{person_name}</em> achieved a GCSE or equivalent qualification?
source: If they have achieved CSEs, O levels or other similar qualifications outside of Wales and England, choose the options they think are the closest match.
cy: Os yw’r unigolyn wedi ennill cymwysterau TAU neu Lefel O neu gymwysterau tebyg eraill y tu allan i Gymru a Lloegr, dewiswch yr opsiynau y mae’n credu sydd agosaf.

# Where do you mainly work?
source: This is where you work most of the time in your main job.
cy: Dyma ble rydych chi'n gweithio y rhan fwyaf o'r amser yn eich prif swydd.

# Where do you mainly work?
source: For example, if you work from home three days a week and go to another place of work two days, select “At or from home”.
cy: Er enghraifft, os ydych chi'n gweithio o'r cartref 3 diwrnod yr wythnos ac yn mynd i weithle arall 2 ddiwrnod yr wythnos, dewiswch “Gartref neu o'r cartref”.

# Where does <em>{person_name}</em> mainly work?
source: This is where they work most of the time in their main job.
cy: Dyma ble mae'r unigolyn yn gweithio y rhan fwyaf o'r amser yn ei brif swydd.

# Where does <em>{person_name}</em> mainly work?
source: For example, if they work from home three days a week and go to another place of work two days, select “At or from home”.
cy: Er enghraifft, os yw'n gweithio o'r cartref 3 diwrnod yr wythnos ac yn mynd i weithle arall 2 ddiwrnod yr wythnos, dewiswch “Gartref neu o'r cartref”.

source: <strong>students</strong>, if this is either their term-time <strong>or</strong> their out of term-time address
cy: <strong>myfyrwyr</strong>, os mai hwn yw eu cyfeiriad yn ystod y tymor <strong>neu</strong> eu cyfeiriad y tu allan i’r tymor

source: <strong>people with a second address for work</strong>, if this is their home address
cy: <strong>pobl sydd ag ail gyfeiriad ar gyfer gwaith</strong>, os mai hwn yw eu cyfeiriad cartref

source: <strong>armed forces members</strong>, if this is their home address
cy: <strong>aelodau o’r lluoedd arfog</strong>, os mai hwn yw eu cyfeiriad cartref

source: <strong>students</strong>, if this is either their term-time <strong>or</strong> their out of term-time address
cy: <strong>myfyrwyr</strong>, os mai hwn yw eu cyfeiriad yn ystod y tymor <strong>neu</strong> eu cyfeiriad y tu allan i’r tymor

source: <strong>people with a second address for work</strong>, if this is their home address
cy: <strong>pobl sydd ag ail gyfeiriad ar gyfer gwaith</strong>, os mai hwn yw eu cyfeiriad cartref

source: <strong>armed forces members</strong>, if this is their home address
cy: <strong>aelodau o’r lluoedd arfog</strong>, os mai hwn yw eu cyfeiriad cartref

source: <p>Remember to include people who are</p>
cy: <p>Cofiwch gynnwys pobl sydd</p>

source: Temporarily away
cy: I ffwrdd o’r cartref dros dro

source: Temporarily staying
cy: Yn aros dros dro

# What passports do you hold?
source: Include
cy: Dylech gynnwys

# What passports does <em>{person_name}</em> hold?
source: Include
cy: Dylech gynnwys

# Are any of these people related to you?
source: Remember to include partners, step-parents and stepchildren as related
cy: Cofiwch gynnwys partneriaid, llysrieni a llysblant fel pobl sy’n perthyn

# Are any of these people related to <em>{person_name}</em>?
source: Remember to include partners, step-parents and stepchildren as related
cy: Cofiwch gynnwys partneriaid, llysrieni a llysblant fel pobl sy'n perthyn

# How many bedrooms are available for use only by this household?
source: Include all rooms built or converted for use as bedrooms
cy: Dylech gynnwys pob ystafell a gafodd ei hadeiladu neu ei throi i’w defnyddio fel ystafell wely
