Repository: ONSdigital/eq-questionnaire-schemas
Catalog: translations/*/census_household_gb_wls_*.po
Languages: cy

source: Census 2021
cy: Cyfrifiad 2021

source: Voluntary
cy: Gwirfoddol

source: Submit census
cy: Cyflwyno’r cyfrifiad

source: By submitting this census you are confirming that, to the best of your knowledge and belief, the details provided are correct.
cy: Drwy gyflwyno’r cyfrifiad hwn rydych chi’n cadarnhau bod y manylion rydych chi wedi’u rhoi yn gywir, hyd eithaf eich gwybodaeth a’ch cred.

source: You must submit this census to complete it
cy: Mae’n rhaid i chi gyflwyno’r cyfrifiad hwn er mwyn ei gwblhau

source: People who live here
cy: Pobl sy’n byw yma

source: Relationships
cy: Perthynas

source: Household and accommodation
cy: Cartref a llety

source: Visitors
cy: Ymwelwyr

source: Circumstances due to coronavirus
cy: Amgylchiadau o ganlyniad i'r coronafeirws

source: Introduction to people who live here
cy: Cyflwyniad i – pobl sy'n byw yma

source: Where you usually live
cy: Ble rydych chi'n byw fel arfer

source: Name of Person {list_item_position}
cy: Enw Unigolyn {list_item_position}

source: Who else lives here
cy: Pwy arall sy'n byw yma

source: People living here
cy: Pobl sy'n byw yma

source: Change details for Person {list_item_position}
cy: Newid manylion ar gyfer Unigolyn {list_item_position}

source: Remove Person {list_item_position}
cy: Dileu Unigolyn {list_item_position}

source: Any more people living here
cy: Unrhyw bobl eraill sy'n byw yma

source: Add name of Person {list_item_position}
cy: Ychwanegu enw Unigolyn {list_item_position}

source: Visitors staying here
cy: Ymwelwyr sy'n aros yma

source: Any more visitors
cy: Unrhyw ymwelwyr eraill

source: Name of Visitor {list_item_position}
cy: Enw Ymwelydd {list_item_position}

source: Change details for Visitor {list_item_position}
cy: Newid manylion ar gyfer Ymwelydd {list_item_position}

source: Remove Visitor {list_item_position}
cy: Dileu Ymwelydd {list_item_position}

source: People who live here and overnight visitors summary
cy: Crynodeb – pobl sy'n byw yma ac ymwelwyr sy'n aros dros nos

source: Introduction to household relationships
cy: Cyflwyniad i – perthynas aelodau o'r cartref â'i gilydd

source: How Person {list_item_position} is related to Person {to_list_item_position}
cy: Sut mae Unigolyn {list_item_position} yn perthyn i Unigolyn {to_list_item_position}

source: How person {list_item_position} is related to anyone else
cy: Sut mae Unigolyn {list_item_position} yn perthyn i unrhyw un arall

source: Introduction to household and accommodation
cy: Cyflwyniad i – cartref a llety

source: Accommodation type
cy: Math o gartref

source: Type of house
cy: Math o dŷ

source: Type of flat
cy: Math o fflat

source: All rooms only for this household
cy: Pob ystafell ar gyfer y cartref hwn yn unig

source: Number of bedrooms
cy: Nifer yr ystafelloedd gwely

source: Central heating
cy: Gwres canolog

source: Owned or rented accommodation
cy: Cartref y mae aelod neu aelodau o'r cartref yn berchen arno neu'n ei rentu

source: Number of vehicles
cy: Nifer y cerbydau

source: Household and accommodation summary
cy: Crynodeb – cartref a llety

source: Introduction to individual questions
cy: Cyflwyniad i – cwestiynau i unigolion

source: Individual circumstances due to coronavirus
cy: Amgylchiadau unigolion o ganlyniad i'r coronafeirws

source: Who is answering
cy: Pwy sy'n ateb

source: Date of birth
cy: Dyddiad geni

source: Confirm age
cy: Cadarnhau oedran

source: Sex
cy: Rhyw

source: Legal marital or registered civil partnership status
cy: Statws priodasol neu statws partneriaeth sifil gofrestredig yn gyfreithiol

source: Sex of current spouse
cy: Rhyw eich priod presennol

source: Sex of previous spouse
cy: Rhyw eich priod blaenorol

source: Sex of current partner
cy: Rhyw eich partner presennol

source: Sex of previous partner
cy: Rhyw eich partner blaenorol

source: Another address, more than 30 days a year
cy: Cyfeiriad arall, mwy na 30 diwrnod y flwyddyn

source: Other address outside the UK
cy: Cyfeiriad arall y tu allan i'r Deyrnas Unedig

source: Other UK address
cy: Cyfeiriad arall yn y Deyrnas Unedig

source: Type of address
cy: Math o gyfeiriad

source: Student in full-time education
cy: Myfyriwr mewn addysg amser llawn

source: Term-time location
cy: Lleoliad yn ystod y tymor

source: Term-time address country
cy: Gwlad eich cyfeiriad yn ystod y tymor

source: Term-time address outside UK
cy: Cyfeiriad y tu allan i'r Deyrnas Unedig yn ystod y tymor

source: Term-time address UK
cy: Cyfeiriad yn y Deyrnas Unedig yn ystod y tymor

source: Country of birth
cy: Gwlad enedigol

source: Country of birth outside UK
cy: Gwlad enedigol y tu allan i'r Deyrnas Unedig

source: Arrived to live in the UK
cy: Wedi dod i fyw yn y Deyrnas Unedig

source: Arrived in the UK on or after 21 March 2020
cy: Wedi dod i'r Deyrnas Unedig ar 21 Mawrth 2020 neu ar ôl hynny

source: Planned length of stay in the UK
cy: Cyfnod y bwriedir aros yn y DU

source: Location one year ago
cy: Lleoliad flwyddyn yn ôl

source: Address one year ago outside UK
cy: Cyfeiriad flwyddyn yn ôl y tu allan i'r Deyrnas Unedig

source: Address one year ago
cy: Cyfeiriad flwyddyn yn ôl

source: National identity
cy: Hunaniaeth genedlaethol

source: Other national identity
cy: Hunaniaeth genedlaethol arall

source: Other national identities
cy: Hunaniaethau cenedlaethol eraill

source: Ethnic group
cy: Grŵp ethnig

source: White ethnic group or background
cy: Grŵp ethnig neu gefndir Gwyn

source: Other White ethnic group or background
cy: Grŵp ethnig neu gefndir Gwyn arall

source: Mixed or Multiple ethnic group or background
cy: Grŵp ethnig neu gefndir Cymysg neu Amlethnig

source: Other Mixed or Multiple ethnic group or background
cy: Grŵp ethnig neu gefndir Cymysg neu Amlethnig arall

source: Asian, Asian Welsh or Asian British ethnic group or background
cy: Grŵp ethnig neu gefndir Asiaidd, Asiaidd Cymreig neu Asiaidd Prydeinig

source: Other Asian ethnic group or background
cy: Grŵp ethnig neu gefndir Asiaidd arall

source: Black, Black Welsh, Black British, Caribbean or African ethnic group or background
cy: Grŵp ethnig neu gefndir Du, Du Cymreig, Du Prydeinig, Caribïaidd neu Affricanaidd

source: Other African ethnic group or background
cy: Grŵp ethnig neu gefndir Affricanaidd arall

source: Other Black, Black British or Caribbean ethnic group or background
cy: Grŵp ethnig neu gefndir Du, Du Prydeinig neu Garibïaidd arall

source: Other ethnic group or background
cy: Grŵp ethnig neu gefndir arall

source: Other ethnic group or background describe
cy: Grŵp ethnig neu gefndir arall (disgrifiwch)

source: Religion
cy: Crefydd

source: Other religion
cy: Crefydd arall

source: Welsh language skills
cy: Sgiliau iaith Gymraeg

source: Main language
cy: Prif iaith

source: Other language
cy: Iaith arall

source: Level of spoken English
cy: Lefel sgiliau siarad Saesneg

source: Passports
cy: Pasbortau

source: Other passports
cy: Pasbortau eraill

source: Other passports multiple
cy: Pasbortau eraill (lluosog)

source: General health
cy: Iechyd cyffredinol

source: Health conditions or illnesses
cy: Cyflwr iechyd neu salwch

source: Health conditions or illnesses that reduce activity
cy: Cyflwr iechyd neu salwch sy'n lleihau gweithgarwch

source: Look after or support others
cy: Yn helpu neu'n gofalu am bobl eraill

source: Sexual orientation
cy: Cyfeiriadedd rhywiol

source: Gender identity
cy: Hunaniaeth o ran rhywedd

source: Introduction to qualifications questions
cy: Cyflwyniad i – cwestiynau am gymwysterau

source: Apprenticeship
cy: Prentisiaeth

source: Degree-level or higher qualification
cy: Cymhwyster ar lefel gradd neu uwch

source: NVQ or equivalent qualification
cy: NVQ neu gymhwyster cyfatebol

source: AS, A level or equivalent qualification
cy: Lefel AS (Safon UG), Lefel A (Safon Uwch) neu gymhwyster cyfatebol

source: GCSE or equivalent qualification
cy: TGAU neu gymhwyster cyfatebol

source: Any other qualifications
cy: Unrhyw gymwysterau eraill

source: Served in the UK Armed Forces
cy: Wedi gwasanaethu yn Lluoedd Arfog y Deyrnas Unedig

source: Employment status in the last seven days
cy: Statws cyflogaeth yn ystod y 7 diwrnod diwethaf

source: Not employed status in the last seven days
cy: Statws ddim yn gyflogedig yn ystod y 7 diwrnod diwethaf

source: Looking for paid work
cy: Yn chwilio am waith am dâl

source: Available to start work in the next two weeks
cy: Ar gael i ddechrau gweithio yn y pythefnos nesaf

source: Waiting to start a job already accepted
cy: Yn aros i ddechrau swydd a oedd eisoes wedi'i derbyn

source: Ever done any paid work
cy: Erioed wedi gwneud unrhyw waith am dâl

source: Introduction to main job questions
cy: Cyflwyniad i – cwestiynau am brif swydd

source: Main job employment status
cy: Statws cyflogaeth yn y brif swydd

source: Business name
cy: Enw'r busnes

source: Job title
cy: Teitl swydd

source: Job description
cy: Disgrifiad swydd

source: Business type
cy: Math o fusnes

source: Supervise other employees
cy: Goruchwylio gweithwyr eraill

source: Hours worked
cy: Oriau gwaith

source: Travel to work
cy: Teithio i'r gwaith

source: Type of workplace
cy: Math o weithle

source: Mainly work in the UK
cy: Yn gweithio yn y Deyrnas Unedig yn bennaf

source: Workplace address
cy: Cyfeiriad y gweithle

source: Depot address
cy: Cyfeiriad y depo

source: Mainly work outside the UK
cy: Yn gweithio y tu allan i’r Deyrnas Unedig yn bennaf

source: Person {list_item_position}
cy: Unigolion {list_item_position}

source: Individual summary
cy: Crynodeb – unigolion

source: Introduction to visitor questions
cy: Cyflwyniad i – cwestiynau am ymwelwyr

source: Usual address
cy: Cyfeiriad arferol

source: Usual address details
cy: Manylion y cyfeiriad arferol

source: Usual address country
cy: Gwlad y cyfeiriad arferol

source: Visitor {list_item_position}
cy: Ymwelydd {list_item_position}

source: Visitor summary
cy: Crynodeb – ymwelwyr

source: {person_name} (Visitor)
cy: {person_name} (ymwelydd)

source: You said <em>{cardinality}</em> person is living here on Sunday {census_date}
cy: Dywedoch chi fod <em>{cardinality}</em> unigolyn yn byw yma ddydd Sul {census_date}

source: You said <em>{cardinality}</em> visitor is staying overnight here on Sunday {census_date}
cy: Dywedoch chi fod <em>{cardinality}</em> ymwelydd yn aros yma dros nos ddydd Sul {census_date}

source: Add someone to this household
cy: Ychwanegu rhywun at y cartref hwn

source: Add a visitor
cy: Ychwanegu ymwelydd

source: Who lives here
cy: Pwy sy'n byw yma

source: Personal details
cy: Manylion Personol

source: Identity and health
cy: Hunaniaeth ac Iechyd

source: Qualifications
cy: Cymwysterau

source: Employment
cy: Cyflogaeth

source: Household relationships
cy: Perthynas aelodau o'r cartref â’i gilydd

source: People who live at {household_address} and overnight visitors
cy: Pobl sy'n byw yn {household_address} ac ymwelwyr sy'n aros dros nos

source: Household members
cy: Aelodau o’r cartref

source: Visitors staying overnight on {census_date}
cy: Ymwelwyr sy’n aros dros nos ar {census_date}

source: Coronavirus (COVID-19) and Census 2021
cy: Y coronafeirws (COVID-19) a Chyfrifiad 2021

source: People who live in this household at {household_address}
cy: Pobl sy’n byw yn y cartref hwn yn {household_address}

source: Coronavirus (COVID-19)
cy: Y coronafeirws (COVID-19)

source: Main job
cy: Prif swydd

source: Last main job
cy: Prif swydd ddiwethaf

# People who live in this household at {household_address}
source: You will need to know
cy: Bydd angen i chi wybod

# Household and accommodation
source: You will need to know information such as
cy: Bydd angen i chi wybod pethau fel

# {person_name}
source: You will need to know personal details such as
cy: Bydd angen i chi wybod manylion personol fel

# Main job
source: Coronavirus (COVID-19)
cy: Y coronafeirws (COVID-19)

# {person_name}
source: You will need to know
cy: Bydd angen i chi wybod

# Coronavirus (COVID-19) and Census 2021
source: Circumstances may have changed during the coronavirus pandemic. Answer all questions based on the situation as it is now.
cy: Gall amgylchiadau fod wedi newid yn ystod pandemig y coronafeirws. Atebwch bob cwestiwn yn seiliedig ar y sefyllfa fel y mae ar hyn o bryd.

# People who live in this household at {household_address}
source: In this section, we are counting the people in this household at {household_address} on <strong>Sunday {census_date}</strong>.
cy: Yn yr adran hon, byddwn yn cyfrif y bobl sydd yn y cartref hwn yn {household_address} <strong>ddydd Sul {census_date}</strong>.

# People who live in this household at {household_address}
source: The Householder is responsible for ensuring that this questionnaire is completed and submitted.
cy: Deiliad y Cartref sy’n gyfrifol am sicrhau bod yr holiadur hwn yn cael ei lenwi a’i gyflwyno.

# Household relationships
source: In this section, we will ask you how the people who usually live in this household are related to each other.
cy: Yn yr adran hon, byddwn yn gofyn i chi sut mae'r bobl sydd fel arfer yn byw yn y cartref hwn yn perthyn i'w gilydd.

# Household relationships
source: Select the appropriate relationship from the options shown. The selected relationship will display at the bottom of the page for you to check.
cy: Dewiswch y berthynas briodol o'r opsiynau sydd i’w gweld. Bydd y berthynas a ddewiswch yn ymddangos ar waelod y dudalen i chi ei gwirio.

# Household and accommodation
source: In this section, we are going to ask you about this household‘s accommodation at {household_address}.
cy: Yn yr adran hon, byddwn yn gofyn i chi am y cartref hwn yn {household_address}.

# {person_name}
source: In this section, we are going to ask you questions about <strong>{person_name}</strong>.
cy: Yn yr adran hon, byddwn yn gofyn cwestiynau i chi am <strong>{person_name}</strong>.

# Coronavirus (COVID-19)
source: Circumstances for <strong>{person_name}</strong> may have changed during the coronavirus pandemic. Answer all questions based on the situation as it is now.
cy: Gall amgylchiadau <strong>{person_name}</strong> fod wedi newid yn ystod pandemig y coronafeirws. Atebwch bob cwestiwn yn seiliedig ar y sefyllfa fel y mae ar hyn o bryd.

# Qualifications
source: The next set of questions is about any qualifications you have ever achieved in Wales, England or worldwide, including equivalents, even if you are not using them now.
cy: Mae'r gyfres nesaf o gwestiynau yn ymwneud ag unrhyw gymwysterau rydych chi wedi’u hennill erioed yng Nghymru, Lloegr neu unrhyw le arall yn y byd, gan gynnwys cymwysterau cyfatebol, hyd yn oed os nad ydych yn eu defnyddio erbyn hyn.

# Qualifications
source: The next set of questions is about any qualifications <em>{person_name}</em> has ever achieved in Wales, England or worldwide, including equivalents, even if they are not using them now.
cy: Mae’r gyfres nesaf o gwestiynau yn ymwneud ag unrhyw gymwysterau y mae <em>{person_name}</em> wedi’u hennill erioed yng Nghymru, Lloegr neu unrhyw le arall yn y byd, gan gynnwys cymwysterau cyfatebol, hyd yn oed os nad yw’n eu defnyddio erbyn hyn.

# Main job
source: The next set of questions is about your main job. Your main job is the job in which you work the most hours.
cy: Mae’r gyfres nesaf o gwestiynau yn ymwneud â’ch prif swydd. Eich prif swydd yw’r swydd rydych chi’n gweithio’r nifer fwyaf o oriau ynddi.

# Main job
source: Your circumstances may have changed during the coronavirus pandemic. Answer all questions based on your situation as it is now.
cy: Gall eich amgylchiadau fod wedi newid yn ystod pandemig y coronafeirws. Atebwch bob cwestiwn yn seiliedig ar eich sefyllfa fel y mae ar hyn o bryd.

# Main job
source: The next set of questions is about <em>{person_name_possessive}</em> main job. Their main job is the job in which they work the most hours.
cy: Atebwch y gyfres nesaf o gwestiynau ar gyfer prif swydd <em>{person_name_possessive}</em>. Prif swydd yr unigolyn yw’r swydd mae’n gweithio’r nifer fwyaf o oriau ynddi.

# Main job
source: Their circumstances may have changed during the coronavirus pandemic. Answer all questions based on their situation as it is now.
cy: Gall amgylchiadau'r unigolyn fod wedi newid yn ystod pandemig y coronafeirws. Atebwch bob cwestiwn yn seiliedig ar ei sefyllfa fel y mae ar hyn o bryd.

# Last main job
source: The next set of questions is about your last main job. This is the most recent job you had.
cy: Mae’r gyfres nesaf o gwestiynau yn ymwneud â’ch prif swydd ddiwethaf. Hon yw’r swydd fwyaf diweddar a oedd gennych chi.

# Last main job
source: If you had more than one job at the same time, answer for the job in which you usually worked the most hours.
cy: Os oedd gennych chi fwy nag un swydd ar yr un pryd, atebwch ar gyfer y swydd roeddech chi fel arfer yn gweithio’r nifer fwyaf o oriau ynddi.

# Last main job
source: The next set of questions is about <em>{person_name_possessive}</em> last main job. This is the most recent job they had.
cy: Mae’r gyfres nesaf o gwestiynau yn ymwneud â phrif swydd ddiwethaf <em>{person_name_possessive}</em>. Hon yw ei swydd fwyaf diweddar.

# Last main job
source: If they had more than one job at the same time, answer for the job in which they usually worked the most hours.
cy: Os oedd gan yr unigolyn fwy nag un swydd ar yr un pryd, atebwch ar gyfer y swydd roedd fel arfer yn gweithio’r nifer fwyaf o oriau ynddi.

# {person_name}
source: In this section, we are going to ask you about your visitor, <strong>{person_name}</strong>.
cy: Yn yr adran hon, byddwn yn gofyn cwestiynau i chi am eich ymwelydd, <strong>{person_name}</strong>.

# People who live in this household at {household_address}
source: names of people living at this address, including anyone currently away
cy: enwau'r bobl sy'n byw yn y cyfeiriad hwn, gan gynnwys unrhyw un sydd i ffwrdd ar hyn o bryd

# People who live in this household at {household_address}
source: names of visitors staying overnight in this household on {census_date}
cy: enwau ymwelwyr sy'n aros dros nos yn y cartref hwn ar {census_date}

# Household and accommodation
source: type of property, and if it‘s owned or rented
cy: pa fath o eiddo yw’r cartref, ac a ydych chi'n berchen arno neu'n ei rentu

# Household and accommodation
source: type of landlord if rented, for example, housing association, council or private
cy: pa fath o landlord sydd gennych chi os ydych chi'n ei rentu, er enghraifft, cymdeithas dai, cyngor neu landlord preifat

# Household and accommodation
source: type of central heating
cy: pa fath o wres canolog sydd yn y cartref

# {person_name}
source: date of birth
cy: dyddiad geni

# {person_name}
source: country of birth
cy: gwlad enedigol

# {person_name}
source: second or holiday homes
cy: ail gartref neu gartrefi gwyliau

# {person_name}
source: main language
cy: prif iaith

# {person_name}
source: general health
cy: iechyd cyffredinol

# {person_name}
source: unpaid care provided
cy: gofal di-dâl sy'n cael ei ddarparu

# {person_name}
source: qualifications
cy: cymwysterau

# {person_name}
source: employment details
cy: manylion cyflogaeth

# {person_name}
source: sex
cy: rhyw

# {person_name}
source: usual address
cy: cyfeiriad arferol

# People who live in this household at {household_address}
source: What we mean by “this household”
cy: Beth mae ''y cartref hwn'' yn ei olygu

# People who live in this household at {household_address}
source: This is one person living alone or a group of people, not necessarily related, living at the same address, who share cooking facilities <em>and</em> share a living room <em>or</em> sitting room <em>or</em> dining area.
cy: Un person sy'n byw ar ei ben ei hun neu grŵp o bobl, nad oes rhaid iddyn nhw fod yn perthyn i’w gilydd, sy’n byw yn yr un cyfeiriad, ac sy’n rhannu cyfleusterau coginio <em>ac</em> ystafell fyw <em>neu</em> lolfa <em>neu</em> le bwyta.

# People who live in this household at {household_address}
source: Any other household at this address will need to request a new household access code to start their own census.
cy: Bydd angen i aelodau unrhyw gartref arall yn y cyfeiriad hwn ofyn am god mynediad newydd i ddechrau eu cyfrifiad eu hunain.

source: Do you usually live at {household_address}?
cy: Ydych chi’n byw yn {household_address} fel arfer?

source: What is your name?
cy: Beth yw eich enw?

source: Do any of the following people also live at {household_address} on Sunday {census_date}?
cy: Oes unrhyw un o’r bobl ganlynol hefyd yn byw yn {household_address} ddydd Sul {census_date}?

source: Do any of the following people live at {household_address} on Sunday {census_date}?
cy: Oes unrhyw un o’r bobl ganlynol yn byw yn {household_address} ddydd Sul {census_date}?

source: Who else lives at {household_address}?
cy: Pwy arall sy’n byw yn {household_address}?

source: Who lives at {household_address}?
cy: Pwy sy’n byw yn {household_address}?

source: Change details for <em>{person_name}</em> (You)
cy: Newid manylion ar gyfer <em>{person_name}</em> (Chi)

source: Change details for <em>{person_name}</em>
cy: Newid manylion ar gyfer <em>{person_name}</em>

source: Does anyone else live at {household_address}?
cy: Oes unrhyw un arall yn byw yn {household_address}?

source: Are you sure you want to remove <em>{person_name}</em>?
cy: Ydych chi'n siŵr eich bod am ddileu <em>{person_name}</em>?

source: You said {cardinality} person lives at {household_address}. Do you need to add anyone?
cy: Dywedoch chi fod {cardinality} unigolyn yn byw yn {household_address}. Oes angen i chi ychwanegu unrhyw un?

source: Apart from everyone already included, who else is staying overnight on Sunday {census_date} at {household_address}?
cy: Ar wahân i bawb a gafodd eu cynnwys eisoes, pwy arall sy’n aros dros nos ddydd Sul {census_date} yn {household_address}?

source: Are there any other visitors staying overnight on Sunday {census_date} at {household_address}?
cy: Oes unrhyw ymwelwyr eraill yn aros dros nos ddydd Sul {census_date} yn {household_address}?

source: What is the name of the visitor staying overnight on Sunday {census_date} at {household_address}?
cy: Beth yw enw’r ymwelydd sy’n aros dros nos ddydd Sul {census_date} yn {household_address}?

source: What is the name of the {ordinality} visitor staying overnight on Sunday {census_date} at {household_address}?
cy: Beth yw enw’r {ordinality} ymwelydd sy’n aros dros nos ddydd Sul {census_date} yn {household_address}?

source: {second_person_name} is your <em>…</em>
cy: {second_person_name} yw eich <em>...</em>

source: Thinking about {first_person_name}, {second_person_name} is their <em>…</em>
cy: Gan feddwl am {first_person_name}, mae {second_person_name} yn <em>...</em> i {first_person_name}

source: Are any of these people related to you?
cy: Oes unrhyw un o’r bobl hyn yn perthyn i chi?

source: Are any of these people related to <em>{person_name}</em>?
cy: Oes unrhyw un o’r bobl hyn yn perthyn i <em>{person_name}</em>?

source: What type of accommodation is <em>{household_address}</em>?
cy: Pa fath o gartref yw <em>{household_address}</em>?

source: Which of the following is your house or bungalow?
cy: Pa un o'r canlynol yw eich tŷ neu eich byngalo?

source: Where is your flat, maisonette or apartment?
cy: Ble mae eich fflat neu maisonette?

source: Are all the rooms in this accommodation, including the kitchen, bathroom and toilet, behind a door that only this household can use?
cy: Ydy pob ystafell yn y cartref, gan gynnwys y gegin, yr ystafell ymolchi a'r toiled, y tu ôl i ddrws sydd ddim ond yn cael ei ddefnyddio gan aelodau o'r cartref hwn?

source: How many bedrooms are available for use only by this household?
cy: Sawl ystafell wely sydd at ddefnydd aelodau o'r cartref hwn yn unig?
