Repository: ONSdigital/eq-questionnaire-schemas
Catalog: translations/*/census_household_gb_nir_*.po
Languages: ga

# What type of central heating does <em>{household_address}</em> have?
source: Wood
ga: Adhmad

# What type of central heating does <em>{household_address}</em> have?
source: Solid fuel
ga: Breosla soladach

# What type of central heating does <em>{household_address}</em> have?
source: Renewable heating system
ga: Córas teasa in-athnuaite

# What type of central heating does <em>{household_address}</em> have?
source: Other central heating
ga: Teas lárnach eile

# What type of central heating does <em>{household_address}</em> have?
source: No central heating
ga: Gan teas lárnach

# What type of renewable energy systems does <em>{household_address}</em> have?
source: Solar panels for electricity
ga: Painéil ghréine do leictreachas

# What type of renewable energy systems does <em>{household_address}</em> have?
source: Solar panels for heating water
ga: Painéil ghréine le huisce a théamh

# What type of renewable energy systems does <em>{household_address}</em> have?
source: Wind turbine
ga: Tuirbín gaoithe

# What type of renewable energy systems does <em>{household_address}</em> have?
source: Other
ga: Eile

# What type of renewable energy systems does <em>{household_address}</em> have?
source: No renewable energy systems
ga: Gan córas fuinnimh in-athnuaite

# Does your household own or rent <em>{household_address}</em>?
source: Owns outright
ga: Is leis amach is amach é

# Does your household own or rent <em>{household_address}</em>?
source: Owns with a mortgage or loan
ga: Is leis é le morgáiste nó iasacht

# Does your household own or rent <em>{household_address}</em>?
source: Part-owns and part-rents
ga: Is páirtúinéir é nó páirt-thógann sé ar cíos é

# Does your household own or rent <em>{household_address}</em>?
source: Rents
ga: Tógann sé ar cíos é

# Does your household own or rent <em>{household_address}</em>?
source: Lives here rent-free
ga: Cónaíonn sé anseo gan cíos ar bith a ioc

# Who do you rent from?
source: Northern Ireland Housing Executive
ga: Feidhmeannas Tithíochta Thuaisceart Éireann

# Who do you rent from?
source: Housing association or charitable trust
ga: Cumann Tithíochta nó iontaobhas carthanachta

# Who do you rent from?
source: Private landlord
ga: Tiarna talún príobháideach

# Who do you rent from?
source: Private renting with a letting agent
ga: Tógáil ar cíos phríobhaideach le gníomhaire ligin

# Who do you rent from?
source: Employer of a household member
ga: Fostóir bhall den líon tí

# Who do you rent from?
source: Relative or friend of a household member
ga: Gaol nó cara bhall den líon tí

# Who do you rent from?
source: Other
ga: Eile

source: None
ga: Ceann ar bith

source: 4 or more
ga: 4 nó níos mó

# Are you <em>{person_name}?</em>
source: Yes, I am
ga: Is ea, Is mise

# Are you <em>{person_name}?</em>
source: No, I am answering on their behalf
ga: Ní hea, tá mé ag freagairt ar a son

# You are {age} old. Is this correct?
source: Yes, I am {age} old
ga: Tá mé {age} d'aois

# You are {age} old. Is this correct?
source: No, I need to correct my date of birth
ga: Níl, ní mór dom mo dháta breithe a cheartú

# <em>{person_name}</em> is {age} old. Is this correct?
source: Yes, {person_name} is {age} old
ga: Tá {person_name} {age} d'aois

# <em>{person_name}</em> is {age} old. Is this correct?
source: No, I need to correct their date of birth
ga: Níl, caithfidh mé a ndáta breithe a cheartú

# What was <em>{person_name_possessive}</em> age on their last birthday?
source: This age is an estimate
ga: Is meastachán é an aois seo

# What is your sex?
source: Female
ga: Baineann

# What is your sex?
source: Male
ga: Fireann

# What is <em>{person_name_possessive}</em> sex?
source: Female
ga: Baineann

# What is <em>{person_name_possessive}</em> sex?
source: Male
ga: Fireann

# What is your marital or civil partnership status?
source: Single, never married and never in a civil partnership
ga: Singil, neamhphósta nó i bpáirtnéireachtshibhialta ar bith riamh

# What is your marital or civil partnership status?
source: Married
ga: Pósta

# What is your marital or civil partnership status?
source: In a civil partnership
ga: I bpáirtnéireacht shibhialta

# What is your marital or civil partnership status?
source: Separated, but still legally married
ga: Scartha, ach pósta go dlíthiúil go fóill

# What is your marital or civil partnership status?
source: Separated, but still legally in a civil partnership
ga: Scartha, ach i bpáirtnéireacht shibhialta go dlíthiúil go fóill

# What is your marital or civil partnership status?
source: Divorced
ga: Colscartha

# What is your marital or civil partnership status?
source: Formerly in a civil partnership which is now legally dissolved
ga: I bpáirtnéireacht shibhialta tráth atá curtha arceal go dlíthiúil anois

# What is your marital or civil partnership status?
source: Widowed
ga: Baintreach

# What is your marital or civil partnership status?
source: Surviving partner from a civil partnership
ga: Páirtnéir atá beo go fóill ó pháirtnéireacht shibhialta

# What is <em>{person_name_possessive}</em> marital or civil partnership status?
source: Single, never married and never in a civil partnership
ga: Singil, neamhphósta nó i bpáirtnéireachtshibhialta ar bith riamh

# What is <em>{person_name_possessive}</em> marital or civil partnership status?
source: Married
ga: Pósta

# What is <em>{person_name_possessive}</em> marital or civil partnership status?
source: In a civil partnership
ga: I bpáirtnéireacht shibhialta

# What is <em>{person_name_possessive}</em> marital or civil partnership status?
source: Separated, but still legally married
ga: Scartha, ach pósta go dlíthiúil go fóill

# What is <em>{person_name_possessive}</em> marital or civil partnership status?
source: Separated, but still legally in a civil partnership
ga: Scartha, ach i bpáirtnéireacht shibhialta go dlíthiúil go fóill

# What is <em>{person_name_possessive}</em> marital or civil partnership status?
source: Divorced
ga: Colscartha

# What is <em>{person_name_possessive}</em> marital or civil partnership status?
source: Formerly in a civil partnership which is now legally dissolved
ga: I bpáirtnéireacht shibhialta tráth atá curtha arceal go dlíthiúil anois

# What is <em>{person_name_possessive}</em> marital or civil partnership status?
source: Widowed
ga: Baintreach

# What is <em>{person_name_possessive}</em> marital or civil partnership status?
source: Surviving partner from a civil partnership
ga: Páirtnéir atá beo go fóill ó pháirtnéireacht shibhialta

# Are you a student in full-time education?
source: Yes
ga: Is ea

# Are you a student in full-time education?
source: No
ga: Ní hea

# Is <em>{person_name}</em> a student in full-time education?
source: Yes
ga: Is ea

# Is <em>{person_name}</em> a student in full-time education?
source: No
ga: Níl

# Are you a schoolchild or student in full-time education?
source: Yes
ga: Is ea

# Are you a schoolchild or student in full-time education?
source: No
ga: Ní hea

# Is <em>{person_name}</em> a schoolchild or student in full-time education?
source: Yes
ga: Is ea

# Is <em>{person_name}</em> a schoolchild or student in full-time education?
source: No
ga: Ní hea

# During term time, where do you usually live?
source: At another address in the UK
ga: Ag seoladh eile sa RA

# During term time, where do you usually live?
source: At another address outside the UK
ga: Ag seoladh taobh amuigh den RA

# During term time, where does <em>{person_name}</em> usually live?
source: At another address in the UK
ga: Ag seoladh eile sa RA

# During term time, where does <em>{person_name}</em> usually live?
source: At another address outside the UK
ga: Ag seoladh taobh amuigh den RA

# What is your country of birth?
source: Northern Ireland
ga: Tuaisceart Éireann

# What is your country of birth?
source: England
ga: Sasana

# What is your country of birth?
source: Scotland
ga: Albain

# What is your country of birth?
source: Wales
ga: An Bhreatain Bheag

# What is your country of birth?
source: Republic of Ireland
ga: Poblacht na hÉireann

# What is your country of birth?
source: Elsewhere
ga: Áit eile

# What is <em>{person_name_possessive}</em> country of birth?
source: Northern Ireland
ga: Tuaisceart Éireann

# What is <em>{person_name_possessive}</em> country of birth?
source: England
ga: Sasana

# What is <em>{person_name_possessive}</em> country of birth?
source: Scotland
ga: Albain

# What is <em>{person_name_possessive}</em> country of birth?
source: Wales
ga: An Bhreatain Bheag

# What is <em>{person_name_possessive}</em> country of birth?
source: Republic of Ireland
ga: Poblacht na hÉireann

# What is <em>{person_name_possessive}</em> country of birth?
source: Elsewhere
ga: Áit eile

# One year ago, what was your usual address?
source: Student term-time or boarding school address in the UK
ga: Seoladh am téarma mac léinn nó scoil chónaithe sa RA

# One year ago, what was your usual address?
source: Another address in the UK
ga: Seoladh eile sa RA

# One year ago, what was your usual address?
source: An address outside the UK
ga: Seoladh taobh amuigh den RA

# One year ago, what was your usual address?
source: Same as {first_person_possessive} address one year ago
ga: Mar an gcéanna le {first_person_possessive} s(h)eoladh bliain ó shin

# One year ago, what was <em>{person_name_possessive}</em> usual address?
source: Student term-time or boarding school address in the UK
ga: Seoladh am téarma mac léinn nó scoil chónaithe sa RA

# One year ago, what was <em>{person_name_possessive}</em> usual address?
source: Another address in the UK
ga: Seoladh eile sa RA

# One year ago, what was <em>{person_name_possessive}</em> usual address?
source: An address outside the UK
ga: Seoladh taobh amuigh den UK

# One year ago, what was <em>{person_name_possessive}</em> usual address?
source: Same as {first_person_possessive} address one year ago
ga: Mar an gcéanna le seoladh {first_person_possessive} bliain ó shin

# What passports do you hold?
source: United Kingdom
ga: An Ríocht Aontaithe

# What passports do you hold?
source: Ireland
ga: Éire

# What passports do you hold?
source: Other
ga: Eile

# What passports do you hold?
source: None
ga: Ceann ar bith

# What passports does <em>{person_name}</em> hold?
source: United Kingdom
ga: An Ríocht Aontaithe

# What passports does <em>{person_name}</em> hold?
source: Ireland
ga: Éire

# What passports does <em>{person_name}</em> hold?
source: Other
ga: Eile

# What passports does <em>{person_name}</em> hold?
source: None
ga: Ceann ar bith

# How would you describe your national identity?
source: British
ga: Briotanach

# How would you describe your national identity?
source: Irish
ga: Éireannach

# How would you describe your national identity?
source: Northern Irish
ga: Éireannach Tuaisceartach

# How would you describe your national identity?
source: English
ga: Sasanach

# How would you describe your national identity?
source: Scottish
ga: Albanach

# How would you describe your national identity?
source: Welsh
ga: Breatnach

# How would you describe your national identity?
source: Other
ga: Eile

# How would <em>{person_name}</em> describe their national identity?
source: British
ga: Briotanach

# How would <em>{person_name}</em> describe their national identity?
source: Irish
ga: Éireannach

# How would <em>{person_name}</em> describe their national identity?
source: Northern Irish
ga: Éireannach Tuaisceartach

# How would <em>{person_name}</em> describe their national identity?
source: English
ga: Sasanach

# How would <em>{person_name}</em> describe their national identity?
source: Scottish
ga: Albanach

# How would <em>{person_name}</em> describe their national identity?
source: Welsh
ga: Breatnach

# How would <em>{person_name}</em> describe their national identity?
source: Other
ga: Eile

# What is your ethnic group?
source: White
ga: Duine geal

# What is your ethnic group?
source: Chinese
ga: Síneach

# What is your ethnic group?
source: Irish Traveller
ga: Taistealaí Éireannach

# What is your ethnic group?
source: Roma
ga: Romach

# What is your ethnic group?
source: Indian
ga: Indiach

# What is your ethnic group?
source: Filipino
ga: Filipíneach

# What is your ethnic group?
source: Black African
ga: Duine dubh Afracach

# What is your ethnic group?
source: Black other
ga: Duine dubh eile

# What is your ethnic group?
source: Mixed ethnic group
ga: Grúpa eitneach measctha

# What is your ethnic group?
source: Any other ethnic group
ga: Grúpa eitneach ar bith eile

# What is <em>{person_name_possessive}</em> ethnic group?
source: White
ga: Duine geal

# What is <em>{person_name_possessive}</em> ethnic group?
source: Chinese
ga: Síneach

# What is <em>{person_name_possessive}</em> ethnic group?
source: Irish Traveller
ga: Taistealaí Éireannach

# What is <em>{person_name_possessive}</em> ethnic group?
source: Roma
ga: Romach

# What is <em>{person_name_possessive}</em> ethnic group?
source: Indian
ga: Indiach

# What is <em>{person_name_possessive}</em> ethnic group?
source: Filipino
ga: Filipíneach

# What is <em>{person_name_possessive}</em> ethnic group?
source: Black African
ga: Duine dubh Afracach

# What is <em>{person_name_possessive}</em> ethnic group?
source: Black other
ga: Duine dubh eile

# What is <em>{person_name_possessive}</em> ethnic group?
source: Mixed ethnic group
ga: Grúpa eitneach measctha

# What is <em>{person_name_possessive}</em> ethnic group?
source: Any other ethnic group
ga: Grúpa eitneach ar bith eile

# What religion, religious denomination or body do you belong to?
source: Roman Catholic
ga: Caitliceach Rómhánach

# What religion, religious denomination or body do you belong to?
source: Presbyterian Church in Ireland
ga: Eaglais Phreispitéireach in Éirinn

# What religion, religious denomination or body do you belong to?
source: Church of Ireland
ga: Eaglais na hÉireann

# What religion, religious denomination or body do you belong to?
source: Methodist Church in Ireland
ga: Eaglais Mhodhach in Éirinn

# What religion, religious denomination or body do you belong to?
source: Other
ga: Eile

# What religion, religious denomination or body do you belong to?
source: None
ga: Ceann ar bith

source: Roman Catholic
ga: Caitliceach Rómhánach

source: Presbyterian Church in Ireland
ga: Eaglais Phreispitéireach in Éirinn

source: Church of Ireland
ga: Eaglais na hÉireann

source: Methodist Church in Ireland
ga: Eaglais Mhodhach in Éirinn

source: Other
ga: Eile

source: None
ga: Ceann ar bith

# What religion, religious denomination or body were you <em>brought up</em> in?
source: Roman Catholic
ga: Caitliceach Rómhánach

# What religion, religious denomination or body were you <em>brought up</em> in?
source: Presbyterian Church in Ireland
ga: Eaglais Phreispitéireach in Éirinn

# What religion, religious denomination or body were you <em>brought up</em> in?
source: Church of Ireland
ga: Eaglais na hÉireann

# What religion, religious denomination or body were you <em>brought up</em> in?
source: Methodist Church in Ireland
ga: Eaglais Mhodhach in Éirinn

# What religion, religious denomination or body were you <em>brought up</em> in?
source: Other
ga: Eile

# What religion, religious denomination or body were you <em>brought up</em> in?
source: None
ga: Ceann ar bith

source: Roman Catholic
ga: Caitliceach Rómhánach

source: Presbyterian Church in Ireland
ga: Eaglais Phreispitéireach in Éirinn

source: Church of Ireland
ga: Eaglais na hÉireann

source: Methodist Church in Ireland
ga: Eaglais Mhodhach in Éirinn

source: Other
ga: Eile

source: None
ga: Ceann ar bith

# What is your main language?
source: English
ga: Béarla

# What is your main language?
source: Other, including British or Irish Sign Language
ga: Eile, teanga Chomharthaíochta na Breataine nó nahÉireann san áireamh

# What is <em>{person_name_possessive}</em> main language?
source: English
ga: Béarla

# What is <em>{person_name_possessive}</em> main language?
source: Other, including British or Irish Sign Language
ga: Eile, teanga Chomharthaíochta na Breataine nó nahÉireann san áireamh

# How well can you speak English?
source: Very well
ga: Go hiontach maith

# How well can you speak English?
source: Well
ga: Go maith

# How well can you speak English?
source: Not well
ga: Ní go maith

# How well can you speak English?
source: Not at all
ga: Ní ar chor ar bith

# How well can <em>{person_name}</em> speak English?
source: Very well
ga: Go hiontach maith

# How well can <em>{person_name}</em> speak English?
source: Well
ga: Go maith

# How well can <em>{person_name}</em> speak English?
source: Not well
ga: Ní go maith

# How well can <em>{person_name}</em> speak English?
source: Not at all
ga: Ní ar chor ar bith

# Can you understand, speak, read or write Irish?
source: No ability
ga: Gan ábaltacht ar bith

# Can you understand, speak, read or write Irish?
source: Understand Irish
ga: Tuigim Gaeilge

# Can you understand, speak, read or write Irish?
source: Speak Irish
ga: Labhraím Gaeilge

# Can you understand, speak, read or write Irish?
source: Read Irish
ga: Léim i nGaeilge

# Can you understand, speak, read or write Irish?
source: Write Irish
ga: Scríobhaim i nGaeilge

# Can <em>{person_name}</em> understand, speak, read or write Irish?
source: No ability
ga: Gan ábaltacht ar bith

# Can <em>{person_name}</em> understand, speak, read or write Irish?
source: Understand Irish
ga: Tuigim Gaeilge

# Can <em>{person_name}</em> understand, speak, read or write Irish?
source: Speak Irish
ga: Labhraím Gaeilge

# Can <em>{person_name}</em> understand, speak, read or write Irish?
source: Read Irish
ga: Léim i nGaeilge

# Can <em>{person_name}</em> understand, speak, read or write Irish?
source: Write Irish
ga: Scríobhaim i nGaeilge

# How often do you speak Irish?
source: Daily
ga: Go laethúil

# How often do you speak Irish?
source: Weekly
ga: Go seachtainiúil

# How often do you speak Irish?
source: Less often
ga: Ní chomh minic

# How often do you speak Irish?
source: Never
ga: Ní riamh

# How often does <em>{person_name}</em> speak Irish?
source: Daily
ga: Go laethúil

# How often does <em>{person_name}</em> speak Irish?
source: Weekly
ga: Go seachtainiúil

# How often does <em>{person_name}</em> speak Irish?
source: Less often
ga: Ní chomh minic

# How often does <em>{person_name}</em> speak Irish?
source: Never
ga: Ní riamh

# Can you understand, speak, read or write Ulster-Scots?
source: No ability
ga: Gan ábaltacht ar bith

# Can you understand, speak, read or write Ulster-Scots?
source: Understand Ulster-Scots
ga: Tuigim Albanais Uladh

# Can you understand, speak, read or write Ulster-Scots?
source: Speak Ulster-Scots
ga: Labhraím Albanais Uladh

# Can you understand, speak, read or write Ulster-Scots?
source: Read Ulster-Scots
ga: Léim in Albanais Uladh

# Can you understand, speak, read or write Ulster-Scots?
source: Write Ulster-Scots
ga: Scríobhaim in Albanais Uladh

# Can <em>{person_name}</em> understand, speak, read or write Ulster-Scots?
source: No ability
ga: Gan ábaltacht ar bith

# Can <em>{person_name}</em> understand, speak, read or write Ulster-Scots?
source: Understand Ulster-Scots
ga: Tuigim Albanais Uladh

# Can <em>{person_name}</em> understand, speak, read or write Ulster-Scots?
source: Speak Ulster-Scots
ga: Labhraím Albanais Uladh

# Can <em>{person_name}</em> understand, speak, read or write Ulster-Scots?
source: Read Ulster-Scots
ga: Léim in Albanais Uladh

# Can <em>{person_name}</em> understand, speak, read or write Ulster-Scots?
source: Write Ulster-Scots
ga: Scríobhaim in Albanais Uladh

# How often do you speak Ulster-Scots?
source: Daily
ga: Go laethúil

# How often do you speak Ulster-Scots?
source: Weekly
ga: Go seachtainiúil

# How often do you speak Ulster-Scots?
source: Less often
ga: Ní chomh minic

# How often do you speak Ulster-Scots?
source: Never
ga: Ní riamh

# How often does <em>{person_name}</em> speak Ulster-Scots?
source: Daily
ga: Go laethúil

# How often does <em>{person_name}</em> speak Ulster-Scots?
source: Weekly
ga: Go seachtainiúil

# How often does <em>{person_name}</em> speak Ulster-Scots?
source: Less often
ga: Ní chomh minic

# How often does <em>{person_name}</em> speak Ulster-Scots?
source: Never
ga: Ní riamh

# How is your health in general?
source: Very good
ga: An-mhaith

# How is your health in general?
source: Good
ga: Go maith

# How is your health in general?
source: Fair
ga: Réasúnta

# How is your health in general?
source: Bad
ga: Go dona

# How is your health in general?
source: Very bad
ga: An-dona

# How is <em>{person_name_possessive}</em> health in general?
source: Very good
ga: An-mhaith

# How is <em>{person_name_possessive}</em> health in general?
source: Good
ga: Go maith

# How is <em>{person_name_possessive}</em> health in general?
source: Fair
ga: Réasúnta

# How is <em>{person_name_possessive}</em> health in general?
source: Bad
ga: Go dona

# How is <em>{person_name_possessive}</em> health in general?
source: Very bad
ga: An-dona

source: No
ga: Níl

source: Yes, limited a little
ga: Tá, tá siad beagán teoranta

source: Yes, limited a lot
ga: Tá, tá siad teoranta go mór

source: No
ga: Níl

source: Yes, limited a little
ga: Tá, tá siad beagán teoranta

source: Yes, limited a lot
ga: Tá, tá siad teoranta go mór

source: Deafness or partial hearing loss
ga: Bodhaire nó páirtchaillteanas éisteachta

source: Blindness or partial sight loss
ga: Daille nó páirtchaillteanas radhairc

source: A mobility or dexterity difficulty that requires the use of a wheelchair
ga: Deacracht soghluaiseachta nó deaslámhachta ara bhfuil úsáid cathaoir rothaí de dhíth

source: A mobility or dexterity difficulty that limits basic physical activities
ga: Deacracht soghluaiseachta nó deaslámhachtaa chuireann srian ar bhunghníomhaíochtaí fisiceacha

source: Shortness of breath or difficulty breathing
ga: Gearranáil nó deacracht ag análú

source: None of these conditions
ga: Ceann ar bith de na fadhbanna sláinte seo

source: Deafness or partial hearing loss
ga: Bodhaire nó páirtchaillteanas éisteachta

source: Blindness or partial sight loss
ga: Daille nó páirtchaillteanas radhairc

source: A mobility or dexterity difficulty that requires the use of a wheelchair
ga: Deacracht soghluaiseachta nó deaslámhachta ara bhfuil úsáid cathaoir rothaí de dhíth

source: A mobility or dexterity difficulty that limits basic physical activities
ga: Deacracht soghluaiseachta nó deaslámhachtaa chuireann srian ar bhunghníomhaíochtaí fisiceacha

source: Shortness of breath or difficulty breathing
ga: Gearranáil nó deacracht ag análú

source: None of these conditions
ga: Ceann ar bith de na fadhbanna sláinte seo

source: An intellectual or learning disability
ga: Míchumas intleachtúil nó foghlama

source: A learning difficulty
ga: Deacracht foghlama

source: Autism or Asperger syndrome
ga: Siondróm uathachais nó Asperger

source: An emotional, psychological or mental health condition
ga: Fadhb mhothúchánach, shíceolaíoch nó mheabhairshláinte

source: Frequent periods of confusion or memory loss
ga: Tréimhsí minice de mhearbhall nó de dhíchuimhne

source: Long-term pain or discomfort
ga: Pian nó míchompord fadtéarmach

source: Other condition
ga: Fadhb eile

source: None of these conditions
ga: Ceann ar bith de na fadhbanna sláinte seo

source: An intellectual or learning disability
ga: Míchumas intleachtúil nó foghlama

source: A learning difficulty
ga: Deacracht foghlama

source: Autism or Asperger syndrome
ga: Siondróm uathachais nó Asperger

source: An emotional, psychological or mental health condition
ga: Fadhb mhothúchánach, shíceolaíoch nó mheabhairshláinte

source: Frequent periods of confusion or memory loss
ga: Tréimhsí minice de mhearbhall nó de dhíchuimhne

source: Long-term pain or discomfort
ga: Pian nó míchompord fadtéarmach

source: Other condition
ga: Fadhb eile
