Repository: ONSdigital/eq-questionnaire-schemas
Catalog: translations/*/census_household_gb_nir_*.po
Languages: ga

# In the last four weeks, were you actively looking for any kind of paid work?
source: To get a true picture of the working population, we ask this question of everyone who is not currently working. We ask people who are retired because the number of people continuing to work after retirement is increasing. We ask people who are not working due to long-term illness or disability because some intend to go back to work.
ga: Le fíorléargas de dhaonra shaothar oibre na RA a fháil, cuireann muid an cheist seo ar gach duine nach bhfuil ag obair faoi láthair. Cuireann muid an cheist ar dhaoine atá ar scor mar tá líon na ndaoine atá ag obair go fóill thar an aois scoir ag méadú. Cuireann muid an cheist ar dhaoine atá tinn san fhadtéarma nó atá faoi mhíchumas mar tá sé ar intinn ag roinnt daoine dul ar ais ag obair.

source: To get a true picture of the working population, we ask this question of everyone who is not currently working. We ask people who are retired because the number of people continuing to work after retirement is increasing. We ask people who are not working due to long-term illness or disability because some intend to go back to work.
ga: Le fíorléargas de dhaonra shaothar oibre na RA a fháil, cuireann muid an cheist seo ar gach duine nach bhfuil ag obair faoi láthair. Cuireann muid an cheist ar dhaoine atá ar scor mar tá líon na ndaoine atá ag obair go fóill thar an aois scoir ag méadú. Cuireann muid an cheist ar dhaoine atá tinn san fhadtéarma nó atá faoi mhíchumas mar tá sé ar intinn ag roinnt daoine dul ar ais ag obair.

# In the last seven days, were you waiting to start a job already accepted?
source: To get a true picture of the working population, we ask this question of everyone who is not currently working. We ask people who are retired because the number of people continuing to work after retirement is increasing. We ask people who are not working due to long-term illness or disability because some intend to go back to work.
ga: Le fíorléargas de dhaonra shaothar oibre na RA a fháil, cuireann muid an cheist seo ar gach duine nach bhfuil ag obair faoi láthair. Cuireann muid an cheist ar dhaoine atá ar scor mar tá líon na ndaoine atá ag obair go fóill thar an aois scoir ag méadú. Cuireann muid an cheist ar dhaoine atá tinn san fhadtéarma nó atá faoi mhíchumas mar tá sé ar intinn ag roinnt daoine dul ar ais ag obair.

source: To get a true picture of the working population, we ask this question of everyone who is not currently working. We ask people who are retired because the number of people continuing to work after retirement is increasing. We ask people who are not working due to long-term illness or disability because some intend to go back to work.
ga: Le fíorléargas de dhaonra shaothar oibre na RA a fháil, cuireann muid an cheist seo ar gach duine nach bhfuil ag obair faoi láthair. Cuireann muid an cheist ar dhaoine atá ar scor mar tá líon na ndaoine atá ag obair go fóill thar an aois scoir ag méadú. Cuireann muid an cheist ar dhaoine atá tinn san fhadtéarma nó atá faoi mhíchumas mar tá sé ar intinn ag roinnt daoine dul ar ais ag obair.

# What is <em>{person_name_possessive}</em> date of birth?
source: Your answer helps to ensure that everyone is counted in the census. Add visitor details, even if you think they have been included on a census questionnaire at another address.
ga: Is cuidiú é do fhreagra lena chínntiú go n-áirítear gach duine sa daonáireamh. Cuir isteach mionsonraí cuairteoirí fiú má áirítear iad ar cheistneoir daonáirimh ag seoladh eile.

# What is <em>{person_name_possessive}</em> sex?
source: Your answer helps to ensure that everyone is counted in the census. Add visitor details, even if you think they have been included on a census questionnaire at another address.
ga: Is cuidiú é do fhreagra lena chínntiú go n-áirítear gach duine sa daonáireamh. Cuir isteach mionsonraí cuairteoirí, fiú má áirítear iad ar cheistneoir daonáirimh ag seoladh eile.

# What is <em>{person_name_possessive}</em> usual address?
source: Your answer helps to ensure that everyone is counted in the census. Add visitor details, even if you think they have been included on a census questionnaire at another address.
ga: Is cuidiú é do fhreagra lena chínntiú go n-áirítear gach duine sa daonáireamh. Cuir isteach mionsonraí cuairteoirí, fiú má áirítear iad ar cheistneoir daonáirimh ag seoladh eile.
