Repository: ONSdigital/eq-questionnaire-schemas
Catalog: translations/*/census_communal_establishment_gb_wls_*.po
Languages: cy

source: 2021 Census
cy: cyfrifiad 2021

source: Voluntary
cy: Wirfoddol

source: Submit census
cy: Cyflwyno'r cyfrifiad

source: By submitting this census you are confirming that, to the best of your knowledge and belief, the details provided are correct.
cy: Drwy gyflwyno'r cyfrifiad hwn rydych chi'n cadarnhau bod y manylion rydych chi wedi'u rhoi yn gywir, hyd eithaf eich gwybodaeth a'ch cred.

source: You must submit this census to complete it
cy: Mae'n rhaid i chi gyflwyno'r cyfrifiad hwn er mwyn ei gwblhau

source: Communal Establishment
cy: Sefydliad cymunedol

source: Submit answers
cy: Cyflwyno eich atebion

source: Type of establishment
cy: Math o sefydliad

source: Type of medical or care establishment
cy: Math o sefydliad meddygol neu ofal

source: Type of education establishment
cy: Math o sefydliad addysg

source: Type of detention establishment
cy: Math o sefydliad cadw

source: Type of travel or temporary accommodation establishment
cy: Math o sefydliad llety dros dro neu wrth deithio

source: Manager of this establishment
cy: Rheolwr y sefydliad hwn

source: People who live in this establishment
cy: Pobl sy'n byw yn y sefydliad hwn

source: Number of people who live in this establishment
cy: Nifer y bobl sy'n byw yn y sefydliad hwn

source: Visitors staying in this establishment
cy: Ymwelwyr sy'n aros yn y sefydliad hwn

source: Number of visitors staying in this establishment
cy: Nifer yr ymwelwyr sy'n aros yn y sefydliad hwn

source: What is the nature of this establishment?
cy: Pa fath o sefydliad yw hwn?

source: What type of medical or care establishment is <em>{household_address}</em>?
cy: Pa fath o sefydliad meddygol neu ofal yw <em>{household_address}</em>?

source: What type of education establishment is <em>{household_address}</em>?
cy: Pa fath o sefydliad addysg yw <em>{household_address}</em>?

source: What type of detention establishment is <em>{household_address}</em>?
cy: Pa fath o sefydliad cadw yw <em>{household_address}</em>?

source: What type of travel or temporary accommodation establishment is <em>{household_address}</em>?
cy: Pa fath o sefydliad llety dros dro neu wrth deithio yw <em>{household_address}</em>?

source: Who is responsible for the management of this establishment?
cy: Pwy sy’n gyfrifol am reoli’r sefydliad hwn?

source: Do any of the following currently live in this establishment?
cy: Oes unrhyw un o'r canlynol yn byw yn y sefydliad hwn ar hyn o bryd?

source: How many people are currently living in this establishment?
cy: Faint o bobl sy’n byw yn y sefydliad hwn ar hyn o bryd?

source: Are any of the following visitors staying overnight in this establishment on {census_date}?
cy: Oes unrhyw un o’r ymwelwyr canlynol yn aros dros nos yn y sefydliad hwn ar {census_date}?

source: How many visitors are staying overnight in this establishment on {census_date}?
cy: Faint o ymwelwyr sy'n aros dros nos yn y sefydliad hwn ar {census_date}?

# How many people are currently living in this establishment?
source: <em>Include</em> everyone from the groups you selected for the previous question
cy: <em>Dylech gynnwys</em> pawb o’r grwpiau y gwnaethoch eu dewis ar gyfer y cwestiwn blaenorol

# How many people are currently living in this establishment?
source: <em>Do not include</em> visitors who have another UK address, or usually live outside the UK and intend to stay in the UK for 3 months or less
cy: <em>Peidiwch â chynnwys </em>ymwelwyr sydd â chyfeiriad arall yn y Deyrnas Unedig, neu sy’n byw y tu allan i’r Deyrnas Unedig fel arfer ac sy’n bwriadu aros yn y Deyrnas Unedig am 3 mis neu lai

source: <em>Include</em> shift workers, for example, care workers, hotel porters, who are staying overnight on {census_date} as visitors
cy: <em>Dylech gynnwys</em> gweithwyr shifft, er enghraifft, gweithwyr gofal neu borthorion gwesty, sy’n aros dros nos ar {census_date} fel ymwelwyr

# How many visitors are staying overnight in this establishment on {census_date}?
source: <em>Include</em> everyone from the groups you selected for the previous question
cy: <em>Dylech gynnwys</em> pawb o’r grwpiau y gwnaethoch eu dewis ar gyfer y cwestiwn blaenorol

# How many people are currently living in this establishment?
source: Number of residents
cy: Nifer y preswylwyr

# How many visitors are staying overnight in this establishment on {census_date}?
source: Number of visitors
cy: Nifer yr ymwelwyr

# What is the nature of this establishment?
source: Medical or care
cy: Meddygol neu ofal

# What is the nature of this establishment?
source: Education
cy: Addysg

# What is the nature of this establishment?
source: Armed forces
cy: Lluoedd arfog

# What is the nature of this establishment?
source: Detention
cy: Sefydliad cadw

# What is the nature of this establishment?
source: Travel or temporary accommodation
cy: Llety dros dro neu wrth deithio

# What is the nature of this establishment?
source: Religious establishment
cy: Sefydliad crefyddol

# What is the nature of this establishment?
source: Staff or worker accommodation only
cy: Llety i staff neu weithwyr yn unig

# What is the nature of this establishment?
source: Other establishment
cy: Sefydliad arall

# What type of medical or care establishment is <em>{household_address}</em>?
source: Care home without nursing
cy: Cartref gofal heb nyrsio

# What type of medical or care establishment is <em>{household_address}</em>?
source: Care home with nursing
cy: Cartref gofal â nyrsio

# What type of medical or care establishment is <em>{household_address}</em>?
source: Children’s home
cy: Cartref plant

# What type of medical or care establishment is <em>{household_address}</em>?
source: General hospital
cy: Ysbyty cyffredinol

# What type of medical or care establishment is <em>{household_address}</em>?
source: Mental health hospital or unit
cy: Ysbyty neu uned iechyd meddwl

# What type of medical or care establishment is <em>{household_address}</em>?
source: Other hospital
cy: Ysbyty arall

# What type of medical or care establishment is <em>{household_address}</em>?
source: Other medical or care establishment
cy: Math arall o sefydliad meddygol neu ofal

# What type of education establishment is <em>{household_address}</em>?
source: School
cy: Ysgol

# What type of education establishment is <em>{household_address}</em>?
source: University
cy: Prifysgol

# What type of education establishment is <em>{household_address}</em>?
source: Other education establishment
cy: Math arall o sefydliad addysg

# What type of detention establishment is <em>{household_address}</em>?
source: Prison service establishment
cy: Sefydliad gwasanaeth carchardai

# What type of detention establishment is <em>{household_address}</em>?
source: Approved premises
cy: Safle a gymeradwywyd

# What type of detention establishment is <em>{household_address}</em>?
source: Detention centre
cy: Canolfan gadw

# What type of detention establishment is <em>{household_address}</em>?
source: Other detention establishment
cy: Math arall o sefydliad cadw

source: Hotel, guest house, B&B, youth hostel
cy: Gwesty, tŷ llety, gwely a brecwast, hostel ieuenctid

source: Holiday accommodation
cy: Llety gwyliau

source: Hostel or temporary shelter for homeless people
cy: Hostel neu loches dros dro i bobl ddigartref

source: Other travel or temporary accommodation
cy: Math arall o lety dros dro neu wrth deithio

# Who is responsible for the management of this establishment?
source: NHS
cy: Y Gwasanaeth Iechyd Gwladol

# Who is responsible for the management of this establishment?
source: Local authority
cy: Awdurdod lleol

# Who is responsible for the management of this establishment?
source: Government department or agency
cy: Un o adrannau neu asiantaethau’r llywodraeth

# Who is responsible for the management of this establishment?
source: Registered social landlord or housing association
cy: Landlord cymdeithasol cofrestredig neu gymdeithas dai

# Who is responsible for the management of this establishment?
source: Charity or voluntary organisation
cy: Elusen neu gorff gwirfoddol

# Who is responsible for the management of this establishment?
source: Private owner or company
cy: Cwmni neu berchennog preifat

# Who is responsible for the management of this establishment?
source: Higher or further education institution
cy: Sefydliad addysg uwch neu addysg bellach

# Who is responsible for the management of this establishment?
source: Other
cy: Arall

# Do any of the following currently live in this establishment?
source: Anyone who has already spent, or is expected to spend, 6 months or more in this establishment, even if they are away on {census_date}
cy: Unrhyw un sydd eisoes wedi treulio, neu sy'n disgwyl treulio, 6 mis neu fwy yn y sefydliad hwn, hyd yn oed os bydd i ffwrdd ar {census_date}

# Do any of the following currently live in this establishment?
source: UK residents who are staying in this establishment on {census_date} and have no other usual UK address
cy: Preswylwyr y Deyrnas Unedig sy'n aros yn y sefydliad hwn ar {census_date} ac sydd heb gyfeiriad arferol arall yn y Deyrnas Unedig

# Do any of the following currently live in this establishment?
source: People who usually live outside the UK who have stayed, or intend to stay, in the UK for 3 months or more who do not have another UK address
cy: Pobl sy’n byw y tu allan i’r Deyrnas Unedig fel arfer, sydd wedi aros, neu sy’n bwriadu aros, yn y Deyrnas Unedig am 3 mis neu fwy ac sydd heb gyfeiriad arall yn y Deyrnas Unedig

# Do any of the following currently live in this establishment?
source: Students or schoolchildren who stay in this establishment during term time
cy: Myfyrwyr neu blant ysgol sy'n aros yn y sefydliad hwn yn ystod y tymor

# Do any of the following currently live in this establishment?
source: Yourself, your family, staff, and any others who live in this establishment
cy: Chi'ch hun, eich teulu, staff ac unrhyw un arall sy'n byw yn y sefydliad hwn

# Do any of the following currently live in this establishment?
source: None of these apply
cy: Dim un o’r rhain

# How many people are currently living in this establishment?
source: No one is living in this establishment
cy: Nid oes neb yn byw yn y sefydliad hwn

source: Anyone with another usual address in the UK who has spent, or expects to spend, less than 6 months in this establishment
cy: Unrhyw un â chyfeiriad arferol arall yn y Deyrnas Unedig sydd wedi treulio, neu sy’n disgwyl treulio, llai na 6 mis yn y sefydliad hwn

source: Anyone from outside the UK who intends to stay in the UK for less than 3 months
cy: Unrhyw un o'r tu allan i’r Deyrnas Unedig sy’n bwriadu aros yn y Deyrnas Unedig am lai na 3 mis

source: None of these apply
cy: Dim un o'r rhain

# How many visitors are staying overnight in this establishment on {census_date}?
source: No visitors are staying overnight
cy: Nid oes unrhyw ymwelwyr yn aros dros nos

# What is the nature of this establishment?
source: For example, care homes, children’s homes or hospitals
cy: Er enghraifft, cartref gofal, cartref plant neu ysbyty

# What is the nature of this establishment?
source: Including halls of residence
cy: Gan gynnwys neuaddau preswyl

# What is the nature of this establishment?
source: Defence establishments, including ships
cy: Sefydliadau amddiffyn, gan gynnwys llongau

# What is the nature of this establishment?
source: For example, prisons or approved premises
cy: Er enghraifft, carchar neu safle a gymeradwywyd

# What is the nature of this establishment?
source: Includes shelters for homeless people
cy: Gan gynnwys llochesau i bobl ddigartref

# What type of medical or care establishment is <em>{household_address}</em>?
source: Including secure units
cy: Gan gynnwys unedau diogel

# What type of education establishment is <em>{household_address}</em>?
source: For example, hall of residence
cy: Er enghraifft, neuadd breswyl

# What type of detention establishment is <em>{household_address}</em>?
source: Including young offender institutions
cy: Gan gynnwys sefydliadau troseddwyr ifanc

# What type of detention establishment is <em>{household_address}</em>?
source: Probation or bail hostel
cy: Hostel prawf neu fechnïaeth

source: Including inns and pubs
cy: Gan gynnwys tafarndai

source: For example, holiday park
cy: Er enghraifft, parc gwyliau
