Repository: ONSdigital/eq-questionnaire-schemas
Catalog: translations/*/census_household_gb_nir_*.po
Languages: ga

source: Census 2021
ga: Daonáireamh 2021

source: Voluntary
ga: Deonach

source: Submit census
ga: Cuir isteach daonáireamh

source: By submitting this census return you are confirming that, to the best of your knowledge and belief, the details provided are correct.
ga: Tríd an fhoirm dhaonáirimh seo a chur isteach, tá tú ag dearbhú go bhfuil na mionsonraí, ar feadh d'eolais, go cruinn.

source: You must submit this census to complete it
ga: Caithfidh tú an daonáireamh seo a chur isteach le hé a chomhlánú

source: People who live here
ga: Daoine a chónaíonn anseo

source: Relationships
ga: Caidreamh

source: Household and accommodation
ga: Cóiríocht líon tí

source: Individual Section
ga: Mír don Duine Aonair

source: Visitors
ga: Cuairteoirí

source: Circumstances due to coronavirus
ga: Cúinsí mar gheall ar choróinvíreas

source: Introduction to people who live here
ga: Intreoir ar dhaoine a chónaíonn anseo

source: Where you usually live
ga: Áit a gcónaíonn tú de ghnáth

source: Name of Person {list_item_position}
ga: Ainm {list_item_position} Duine

source: Who else lives here
ga: Cé eile a chónaíonn anseo

source: People living here
ga: Daoine a chónaíonn anseo

source: Change details for Person {list_item_position}
ga: Athraigh na sonraí do {list_item_position} Duine

source: Remove Person {list_item_position}
ga: Bain {list_item_position} Duine

source: Any more people living here
ga: Daoine ar bith eile a chónaíonn anseo

source: Add name of Person {list_item_position}
ga: Cuir isteach ainm Duine {list_item_position}

source: Visitors staying here
ga: Cuairteoirí ag stopadh anseo

source: Any more visitors
ga: Cuairteoirí ar bith eile

source: Name of Visitor {list_item_position}
ga: Ainm {list_item_position} Cuairteoir

source: Change details for Visitor {list_item_position}
ga: Athraigh na sonraí do {list_item_position} cuairteoir

source: Remove Visitor {list_item_position}
ga: Bain {list_item_position} Cuairteoir

source: People who live here and overnight visitors summary
ga: Achoimre ar dhaoine a chónaíonn anseo agus cuairteoirí ag fanacht thar oíche

source: Introduction to household relationships
ga: Intreoir do ghaoil teaghlaigh

source: How Person {list_item_position} is related to Person {to_list_item_position}
ga: Mar atá Duine {list_item_position} muinteartha do Dhuine {to_list_item_position}

source: How person {list_item_position} is related to anyone else
ga: Mar atá Duine {list_item_position} muinteartha do dhuine ar bith eile

source: Introduction to household and accommodation
ga: Intreoir do theaghlach agus cóiríocht

source: Accommodation type
ga: Cineál cóiríochta

source: Type of house
ga: Cineál tí

source: Type of flat
ga: Cineál árasán

source: Adapted accommodation
ga: Cóiríocht curtha in oiriúint

source: Central heating
ga: Teas lárnach

source: Renewable energy systems
ga: Córais fuinnimh in-athnuaite

source: Owned or rented accommodation
ga: Cóiríocht faoi úinéireacht nó ar cíos

source: Landlord
ga: Tiarna talún

source: Number of vehicles
ga: Líon feithiclí

source: Household and accommodation summary
ga: Achoimre ar theaghlach agus cóiríocht

source: Introduction to individual questions
ga: Intreoir do cheisteanna ar dhaoine aonair

source: Who is answering
ga: Cé atá ag freagairt

source: Date of birth
ga: Dáta breithe

source: Confirm age
ga: Dearbhaigh aois

source: Age last birthday
ga: Aois ar an lá breithe deireanach

source: Sex
ga: Gnéas

source: Marital or civil partnership status
ga: Stádas pósta nó páirtnéireachta sibhialta

source: Student in full-time education
ga: Mac léinn in oideachas lánaimseartha

source: Term-time location
ga: Suíomh téarma-téarma

source: Term-time address UK
ga: Seoladh am téarma sa RA

source: Term-time address outside UK
ga: Seoladh am téarma taobh amuigh den RA

source: Country of birth
ga: Tír inar rugadh

source: Country of birth outside UK
ga: Tír inar rugadh taobh amuigh den UK

source: Arrived to live in Northern Ireland
ga: Tháinig a chónaí i dTuaisceart Éireann

source: Location one year ago
ga: Áit chónaithe bliain ó shin

source: Address one year ago outside UK
ga: Seoladh taobh amuigh den RA bliain ó shin

source: Address one year ago
ga: Seoladh bliain ó shin

source: Passports
ga: Pasanna

source: Other passports
ga: Pasanna eile

source: Other passports multiple
ga: Pasanna iomadúla eile

source: National identity
ga: Féiniúlacht náisiúnta

source: Other national identity
ga: Féiniúlacht náisiúnta eile

source: Other national identities
ga: Féiniúlachtaí náisiúnta eile

source: Ethnic group
ga: Grúpa eitneach

source: Other ethnic group describe
ga: Déanann grúpa eitneach eile cur síos

source: Religion
ga: Reiligiún

source: Other religion
ga: Reiligiún eile

source: Childhood religion
ga: Reiligiún na hóige

source: Other childhood religion
ga: Reiligiún eile le linn na hóige

source: Main language
ga: Príomhtheanga

source: Other language
ga: Teanga eile

source: Level of spoken English
ga: Leibhéal Béarla labhartha

source: Irish language skills
ga: Scileanna Gaeilge

source: Ulster-Scots language skills
ga: Scileanna Albanais Uladh

source: General health
ga: Sláinte ghinearálta

source: Health conditions or illnesses that reduce activity
ga: Riochtaí sláinte nó tinnis a laghdaíonn gníomhaíocht

source: Physical health conditions
ga: Deacrachtaí fisiceacha

source: Other health conditions
ga: Coinníollacha sláinte eile

source: Look after or support others
ga: Tugann aire nó tacaíocht do dhaoine eile

source: Sexual orientation
ga: Claonadh gnéis

source: Introduction to qualifications questions
ga: Intreoir do cheisteanna faoi cháilíochtaí

source: Degree-level or higher qualification
ga: Leibhéal céime nó cáilíocht níos airde

source: GCSE or equivalent qualification
ga: Cáilíocht GCSE nó achomhionann

source: AS, A level or equivalent qualification
ga: Cáilíocht AS nó Ardleibhéal nó achomhionann

source: NVQ or equivalent qualification
ga: Cáilíocht NVQ nó achomhionann

source: Any other qualifications
ga: Aon cháilíocht eile

source: Apprenticeship
ga: Phrintíseacht

source: Employment status in the last seven days
ga: Stádas fostaíochta le seacht lá anuas

source: Not employed status in the last seven days
ga: Stádas dífhostaithe le seacht lá anuas

source: Looking for paid work
ga: Ag cuardach oibre a bhfuil íocaíocht léi

source: Available to start work in the next two weeks
ga: Ar fáil le tosú ag obair sa dá sheachtain atá le teacht

source: Waiting to start a job already accepted
ga: Ag fanacht le tosú ar phost ar glacadh leis cheana

source: Ever done any paid work
ga: Obair a raibh íocaíochr léi déanta riamh

source: Introduction to main job questions
ga: Intreoir do phríomhcheisteanna faoi phoist

source: Main job employment status
ga: Stádas fostaíochta príomhphoist

source: Business name
ga: Ainm gnó

source: Job title
ga: Teideal poist

source: Job description
ga: Cur síos poist

source: Business type
ga: Cineál gnó

source: Supervise other employees
ga: Fostaithe eile a mhaoirsiú

source: Hours worked
ga: Uaireanta oibrithe

source: Type of workplace
ga: Cineál ionad oibre

source: Main place of work in the UK
ga: Phríomháit oibre sa UK

source: Main place of work outside the UK
ga: Príomháit oibre lasmuigh den UK

source: Main place of work town and county
ga: Baile mór agus contae príomháit oibre

source: Workplace address
ga: Seoladh san ionad oibre

source: Travel to work
ga: Taisteal chun oibre

source: Type of study location
ga: Cineál suíomh staidéir

source: Study location
ga: Suíomh staidéir

source: Country of study
ga: Tír staidéir

source: Study address
ga: Seoladh staidéir

source: Travel to study location
ga: Taistal chuig suíomh staidéir

source: Person {list_item_position}
ga: {list_item_position} Duine

source: Individual summary
ga: Achoimre duine aonair

source: Introduction to visitor questions
ga: Intreoir do cheisteanna faoi chuairteoirí

source: Usual address
ga: An gnáthsheoladh

source: Usual address details
ga: Sonraí gnáthsheolta

source: Usual address country
ga: Tír ghnáthsheolta

source: Visitor {list_item_position}
ga: {list_item_position} Cuairteoir

source: Visitor summary
ga: Achoimre cuairteora

source: {person_name} (Visitor)
ga: {person_name} (Cuairteoir)

source: You said <em>{cardinality}</em> person is living here on Sunday {census_date}
ga: Dúirt tú go bhfuil <em>{cardinality}</em> ina gcónaí anseo Dé Domhnaigh {census_date}

source: You said <em>{cardinality}</em> visitor is staying overnight here on Sunday {census_date}
ga: Dúirt tú go bhfuil <em>{cardinality}</em> cuairteoir ag stopadh thar oíche anseo Dé Domhnaigh {census_date}

source: Add someone to this household
ga: Cuir duine éigin leis an líon tí seo

source: Add a visitor
ga: Cuir cuairteoir leis

source: Who lives here
ga: Cé a chónaíonn anseo

source: Personal details
ga: Sonraí pearsanta

source: Identity and health
ga: Féiniúlacht agus sláinte

source: Qualifications
ga: Cáilíochtaí

source: Employment
ga: Fostaíocht

source: School
ga: Scoil

source: Household relationships
ga: Gaolta líon tí

source: People who live at {household_address} and overnight visitors
ga: Daoine a chónaíonn ag {household_address} agus cuairteoirí thar oíche

source: Household members
ga: Baill den Líon Tí

source: Visitors staying overnight on {census_date}
ga: Cuairteoir a bheidh ag fanacht thar oíche ar {census_date}

source: Coronavirus (COVID-19) and Census 2021
ga: Coróinvíreas (COVID-19) agus Daonáireamh 2021

source: People who live at {household_address}
ga: Daoine a chónaíonn ag {household_address}

source: Household accommodation
ga: Cóiríocht líon tí

source: Main job
ga: Príomhphost

source: Last main job
ga: An chéad phríomhphost roimhe

# People who live at {household_address}
source: You will need to know
ga: Caithfear eolas bheith agat ar

# Household accommodation
source: You will need to know
ga: Caithfear eolas bheith agat ar

# {person_name}
source: You will need to know personal details such as
ga: Beidh ort mionsonraí pearsanta a bheith ar eolas agat amhail

# Main job
source: Coronavirus (COVID-19)
ga: Coróinvíreas (COVID-19)

# {person_name}
source: You will need to know
ga: Caithfear eolas bheith agat ar

# Coronavirus (COVID-19) and Census 2021
source: Circumstances may have changed during the coronavirus pandemic. Answer all questions based on the situation as it is now.
ga: D'fhéadfadh sé gur tháinig athrú ar thosca le linn na paindéime Coróinvíris. Freagair gach ceist bunaithe ar an dóigh atá ar chúrsaí faoi láthair.

# People who live at {household_address}
source: In this section, we are counting the people at {household_address} on <strong>Sunday {census_date}</strong>.
ga: Sa chuid seo, táimid ag cuntas na ndaoine ag {household_address} <strong>Dé Domhnaigh {census_date}</strong>.

# People who live at {household_address}
source: The Householder is responsible for ensuring that this questionnaire is completed and submitted.
ga: Tá an sealbhóir tí freagrach as a chinntiú go gcomhlánófar agus go gcuirfear isteach an ceistneoir seo.

# Household relationships
source: In this section, we’ll ask you how the people who usually live in this household are related to each other.
ga: Sa chuid seo, cuirfidh muid ceist ort faoi na daoine a chónaíonn sa líon tí seo de ghnáth atá gaolta lena chéile.

# Household relationships
source: For the displayed household members, select the appropriate relationship from the options shown. The selected relationship will display at the bottom of the page for you to check.
ga: Do na baill den líon tí atá á léiriú, roghnaigh an gaol cuí ó na roghnanna atá á dtaispeáint. Léireofar an gaol roghnaithe ag bun an leathanaigh sa dóigh is gur féidir leat seiceáil a dhéanamh.

# Household accommodation
source: In this section, we’re going to ask you about the accommodation at {household_address}.
ga: Sa chuid seo, beimid ag cur ceisteanna ort faoin chóiríocht ag {household_address}.

# {person_name}
source: In this section, we’re going to ask you questions about <strong>{person_name}</strong>.
ga: Sa cuid seo, beidh muid ag dul ceist a chur ort faoi <strong>{person_name}</strong>.

# {person_name}
source: Circumstances for <strong>{person_name}</strong> may have changed during the coronavirus pandemic. Answer all questions based on the situation as it is now.
ga: D'fhéadfadh sé gur tháinig athrú ar chúrsaí do <strong>{person_name}</strong> le linn phaindéim an choróinvíris. Freagair gach ceist bunaithe ar an dóigh a bhfuil cúrsaí i láthair na huaire.

# Qualifications
source: The next set of questions is about the qualifications you have achieved in Northern Ireland or worldwide, even if you are not using them now.
ga: Tá na chéad cheisteanna eile faoi na cáilíochtaí a bhain tú amach i dTuaisceart Éireann nó ar fud an domhain, fiú nuair nach bhfuil tú á n-úsáid anois.

# Qualifications
source: The next set of questions is about the qualifications <em>{person_name}</em> has achieved in Northern Ireland or worldwide, even if they are not using them now.
ga: Tá na chéad cheisteanna eile faoi na cáilíochtaí a bhain <em>{person_name}</em> amach i dTuaisceart Éireann nó ar fud an domhain, fiú nuair nach bhfuil siad á n-úsáid anois.

# Main job
source: The next set of questions is about your main job. Your main job is the job in which you work the most hours.
ga: Tá an chéad tacar eile de cheisteanna faoi do phríomhphost. Is é do phríomhphost an post ina n-oibríonn tú an méid is mó uaireanta de ghnáth.

# Main job
source: Your circumstances may have changed during the coronavirus pandemic. Answer all questions based on your situation as it is now.
ga: D'fhéadfadh sé gur tháinig athrú ar do thosca le linn na paindéime Coróinvíris. Freagair gach ceist bunaithe ar an dóigh atá ar chúrsaí faoi láthair.

# Main job
source: The next set of questions is about <em>{person_name_possessive}</em> main job. Their main job is the job in which they work the most hours.
ga: Tá an chéad tacar eile de cheisteanna faoi phríomhphost <em>{person_name_possessive}</em>. Is é a bpríomhphost an post ina n-oibríonn siad an méid is mó uaireanta de ghnáth.

# Main job
source: Their circumstances may have changed during the coronavirus pandemic. Answer all questions based on their situation as it is now.
ga: D'fhéadfadh sé gur tháinig athrú ar a dtosca le linn na paindéime Coróinvíris. Freagair gach ceist bunaithe ar an dóigh atá ar chúrsaí faoi láthair.

# Last main job
source: The next set of questions is about your last main job. This is the most recent job you had.
ga: Tá an chéad tacar eile de cheisteanna faoin phríomhphost dheireanach a bhí agat. Is é seo an post is déanaí a bhí agat.

# Last main job
source: If you had more than one job at the same time, answer for the job in which you usually worked the most hours.
ga: Má bhí níos mó ná post amháin agat ag an am céanna, freagair faoin phost inar oibrigh tú an méid is mó uaireanta de ghnáth.

# Last main job
source: The next set of questions is about <em>{person_name_possessive}</em> last main job. This is the most recent job they had.
ga: Tá an chéad tacar eile de cheisteanna faoi phríomhphost <em>{person_name_possessive}</em>. Is é seo a post is déanaí a bhí acu.

# Last main job
source: If they had more than one job at the same time, answer for the job in which they usually worked the most hours.
ga: Má bhí níos mó ná post amháin acu ag an am céanna, freagair faoin phost inar oibrigh siad an méid is mó uaireanta de ghnáth.

# {person_name}
source: In this section, we’re going to ask you about your visitor, <strong>{person_name}</strong>.
ga: Sa chuid seo, táimid ag dul a chur ceisteanna ort faoi <strong>{person_name}</strong>.

# People who live at {household_address}
source: names of people living at this address, including anyone currently away
ga: ainmneacha daoine a chónaíonn ag an seoladh seo, lena n-áirítear duine ar bith atá ar shiúl faoi láthair

# People who live at {household_address}
source: names of visitors staying overnight in this household on {census_date}
ga: ainmneacha cuairteoirí ag stopadh thar oíche leis an teaghlach seo ar {census_date}

# Household accommodation
source: type of property, for example, detached, semi-detached or flat
ga: cineál áitribh, mar shampla, scoite, leathscoite nó árasán

# Household accommodation
source: household adaptations
ga: oiriúnuithe teaghlaigh

# Household accommodation
source: type of central heating
ga: cineál teasa lárnaigh

# Household accommodation
source: renewable energy systems
ga: córais fuinnimh in-athnuaite

# {person_name}
source: date of birth or age
ga: dáta breithe nó aois

# {person_name}
source: student status
ga: stádas mac léinn

# {person_name}
source: employment details
ga: sonraí fostaíochta

# {person_name}
source: date of birth
ga: dáta breithe

# {person_name}
source: sex
ga: gnéas

# {person_name}
source: usual address
ga: gnáthsheoladh

source: Do you usually live at {household_address}?
ga: An gcónaíonn tú ag {household_address} de ghnáth?

source: What is your name?
ga: Cad é an t-ainm atá ort?

source: Do any of the following people also live at {household_address} on Sunday {census_date}?
ga: An gcónaíonn duine ar bith acu seo a leanas ag {household_address} Dé Domhnaigh {census_date}?

source: Do any of the following people live at {household_address} on Sunday {census_date}?
ga: An gcónaíonn duine ar bith acu seo a leanas ag {household_address} Dé Domhnaigh {census_date}?

source: Who else lives at {household_address}?
ga: Cé eile a chónaíonn ag {household_address}?

source: Who lives at {household_address}?
ga: Cé a chónaíonn ag {household_address}?

source: Change details for <em>{person_name}</em> (You)
ga: Athraigh na sonraí do <em>{person_name}</em> (Tusa)

source: Change details for <em>{person_name}</em>
ga: Athraigh na sonraí do <em>{person_name}</em>

source: Does anyone live at {household_address}?
ga: An gcónaíonn duine ar bith ag {household_address}?

source: Does anyone else live at {household_address}?
ga: An gcónaíonn duine ar bith eile ag {household_address}?

source: Are you sure you want to remove <em>{person_name}</em>?
ga: An bhfuil tú cinnte gur mhaith leat <em>{person_name}</em> a bhaint?

source: You said {cardinality} person lives at {household_address}. Do you need to add anyone?
ga: Dúirt tú go gcónaíonn duine {cardinality} ag {household_address}. An gá duit duine ar bith eile a chur leis?

source: Who do you need to add to {household_address}?
ga: Cé is gá duit a chur leis an {household_address}?

source: Apart from everyone already included, who else is staying overnight on Sunday {census_date} at {household_address}?
ga: Taobh amuigh de gach duine atá san áireamh cheana féin, cé eile atá ag stopadh thar oíche Dé Domhnaigh {census_date} ag {household_address}?

source: Are there any other visitors staying overnight on {census_date} at {household_address}?
ga: An mbeidh cuairteoir ar bith eile ag fanacht thar oíche anseo ar {census_date} ag {household_address}?

source: What is the name of the visitor staying overnight on {census_date} at {household_address}?
ga: Cad é an t-ainm atá ar an chuairteoir a bheidh ag fanacht thar oíche ar {census_date} ag {household_address}?

source: {second_person_name} is your <em>…</em>
ga: {second_person_name} is ea do <em>…</em>

source: Thinking about {first_person_name}, {second_person_name} is their <em>…</em>
ga: Ag smaoineamh ar {first_person_name}, {second_person_name} an é/í seo a <em>…</em>

source: Are any of these people related to you?
ga: An bhfuil duine ar bith acu seo muinteartha duit?

source: Are any of these people related to <em>{person_name}</em>?
ga: An bhfuil duine ar bith acu seo muinteartha do <em>{person_name}</em>?

source: What type of accommodation is <em>{household_address}</em>?
ga: Cén sórt cóiríochta é <em>{household_address}</em>?

source: Which of the following is your house or bungalow?
ga: Cé acu de na rudaí seo a leanas arb é do thach nó do bhungaló é?

source: Where is your flat, maisonette or apartment?
ga: Cá bhfuil d'árasán, do mhaisonette nó d'árasán?

source: Has <em>{household_address}</em> been designed or adapted for any of the following?
ga: Ar dearadh nó ar oiriúnaíodh <em>{household_address}</em> do cheann ar bith de na rudaí seo a leanas?

source: What type of central heating does <em>{household_address}</em> have?
ga: Cén sórt teasa lárnaigh atá ag <em>{household_address}</em>?

source: What type of renewable energy systems does <em>{household_address}</em> have?
ga: Cén sórt córas fuinnimh in-athnuaite atá ag <em>{household_address}</em>?

source: Does your household own or rent <em>{household_address}</em>?
ga: An le do líon tí <em>{household_address}</em> nó an dtógann sé ar cios é?

source: Who do you rent from?
ga: Cé óna bhfaigheann tú an réadmhaoin ar cíos?

source: In total, how many cars or vans are owned, or available for use, by members of this household?
ga: San iomlán, cá mhéad gluaisteán nó veain ar le baill den líon tí seo iad nó atá ar fáil le húsáid acu?

source: Are you <em>{person_name}?</em>
ga: An tusa <em>{person_name}?</em>

source: What is your date of birth?
ga: Cad é do dháta breithe?

source: What is <em>{person_name_possessive}</em> date of birth?
ga: Cad é dáta breithe <em>{person_name_possessive}</em>?

source: You are {age} old. Is this correct?
ga: Tá tú {age} d'aois. An bhfuil sé seo ceart?

source: <em>{person_name}</em> is {age} old. Is this correct?
ga: Tá <em>{person_name}</em> {age} d'aois. An bhfuil sé seo ceart?

source: What was <em>{person_name_possessive}</em> age on their last birthday?
ga: Cad é an aois a bhí <em>{person_name_possessive}</em> ar a lá breithe deireanach?

source: What is your sex?
ga: Cad í d'inscne?

source: What is <em>{person_name_possessive}</em> sex?
ga: Cad í inscne <em>{person_name_possessive}</em>?

source: What is your marital or civil partnership status?
ga: Cad é do stádas pósta nó páirnéireachta sibhialta?

source: What is <em>{person_name_possessive}</em> marital or civil partnership status?
ga: Cad é an stádas pósta nó an stádas páirtnéireachta sibhialta atá ag <em>{person_name_possessive}</em>?

source: Are you a student in full-time education?
ga: An mac léinn thú atá in oideachas lánaimseartha?

source: Is <em>{person_name}</em> a student in full-time education?
ga: An mac léinn <em>{person_name}</em> atá in oideachas lánaimseartha?

source: Are you a schoolchild or student in full-time education?
ga: An páiste scoile nó mac léinn thú atá in oideachas lánaimseartha?

source: Is <em>{person_name}</em> a schoolchild or student in full-time education?
ga: An páiste scoile nó mac léinn <em>{person_name}</em> atá in oideachas lánaimseartha?

source: During term time, where do you usually live?
ga: I rith am an téarma, cá bhfuil tú i do chónaí de ghnáth?

source: During term time, where does <em>{person_name}</em> usually live?
ga: I rith am an téarma, cá gcónaíonn <em>{person_name}</em>?

source: Enter details of your term time address.
ga: Cuir isteach sonraí do sheoladh am téarma.

source: Enter details of their term time address.
ga: Cuir isteach sonraí a seoladh am téarma.

source: During term time, in which country outside the UK do you usually live?
ga: I rith an téarma, cén tír lasmuigh den RA ina gcónaíonn tú de ghnáth?

source: During term time, in which country outside the UK does <em>{person_name}</em> usually live?
ga: Cé acu tír taobh amuigh den RA ina gcónaíonn <em>{person_name}</em> de ghnáth?

source: What is your country of birth?
ga: Cad í an tír inar rugadh thú?

source: What is <em>{person_name_possessive}</em> country of birth?
ga: Cad í tír bhreithe <em>{person_name_possessive}</em>?

source: You selected “Elsewhere”. What is your country of birth?
ga: Roghnaigh tú “Áit eile”. Cén tír inar rugadh thú?
