Repository: ONSdigital/eq-questionnaire-schemas
Catalog: translations/*/census_household_gb_nir_*.po
Languages: ga

source: You selected “Elsewhere”. What is <em>{person_name_possessive}</em> country of birth?
ga: Roghnaigh tú “Áit eile”. Cén tír inar rugadh <em>{person_name_possessive}</em>?

source: What year did you come to live in Northern Ireland?
ga: Cén bhliain a tháinig tú le bheith i do chónaí i dTuaisceart Éireann?

source: What year did <em>{person_name}</em> come to live in Northern Ireland?
ga: Cén bhliain a tháinig <em>{person_name}</em> le cónaí i dTuaisceart Éireann?

source: One year ago, what was your usual address?
ga: Bliain amháin ó shin, cad é do ghnáthsheoladh?

source: One year ago, what was <em>{person_name_possessive}</em> usual address?
ga: Bliain amháin ó shin, cad é an gnáthsheoladh a bhí ag <em>{person_name_possessive}</em>?

source: In which country outside the UK was your usual address one year ago?
ga: Cén tír lasmuigh den UK a bhí marghnáthsheoladh agat bliain ó shin?

source: In which country outside the UK was <em>{person_name_possessive}</em> usual address one year ago?
ga: Cén tír taobh amuigh den RA ina raibh gnáthsheoladh <em>{person_name_possessive}</em> bliain ó shin?

source: Enter details of your address one year ago.
ga: Cuir isteach sonraí do sheolta bliain amháin ó shin.

source: Enter details of <em>{person_name_possessive}</em> address one year ago.
ga: Cuir isteach sonraí de sheoladh <em>{person_name_possessive}</em> bliain amháin ó shin.

source: What passports do you hold?
ga: Cad iad na pasanna atá agat?

source: What passports does <em>{person_name}</em> hold?
ga: Cad iad na pasanna atá ag <em>{person_name}</em>?

source: You selected “Other”. What passports do you hold?
ga: Roghnaigh tú “Eile”. Cé na pasanna atá i do sheilbh?

source: You selected “Other”. What passports does <em>{person_name}</em> hold?
ga: Roghnaigh tú “Eile”. Cé na pasanna atá i seilbh <em>{person_name}</em>?

source: You selected “Other”. What other passports do you hold?
ga: Roghnaigh tú “Eile”. Cé na pasanna eile atá i do sheilbh?

source: You selected “Other”. What other passports does <em>{person_name}</em> hold?
ga: Roghnaigh tú “Eile”. Cé na pasanna eile atá i seilbh <em>{person_name}</em>?

source: How would you describe your national identity?
ga: Cad é mar a dhéanfá cur síos ar d'fhéiniúlacht náisiúnta?

source: How would <em>{person_name}</em> describe their national identity?
ga: Cad é mar a dhéanfadh <em>{person_name}</em> cur síos ar a bhféiniúlacht náisiúnta?

source: You selected “Other”. How would you describe your national identity?
ga: Roghnaigh tú “Eile”. Cad é an cur síos a bheadh agat ar d'fhéiniúlacht náisiúnta?

source: You selected “Other”. How would <em>{person_name}</em> describe their national identity?
ga: Roghnaigh tú “Eile”. Cad é an cur síos a bheadh ag <em>{person_name}</em> ar a bhféiniúlacht náisiúnta?

source: You selected “Other”. How would you describe your other national identity?
ga: Roghnaigh tú “Eile”. Cad é an cur síos a bheadh agat ar d'fhéiniúlacht náisiúnta eile?

source: You selected “Other”. How would <em>{person_name}</em> describe their other national identity?
ga: Roghnaigh tú “Eile”. Cad é an cur síos a bheadh ag <em>{person_name}</em> ar a bhféiniúlacht náisiúnta eile?

source: What is your ethnic group?
ga: Cad é do ghrúpa eitneach?

source: What is <em>{person_name_possessive}</em> ethnic group?
ga: Cad é grúpa eitneach <em>{person_name_possessive}</em>?

source: You selected “Any other ethnic group”. How would you describe your ethnic group?
ga: Roghnaigh tú “Grúpa eitneach ar bith eile”. Cad é an cur síos a bheadh agat ar do ghrúpa eitneach?

source: You selected “Any other ethnic group”. How would <em>{person_name}</em> describe their ethnic group?
ga: Roghnaigh tú “Grúpa eitneach ar bith eile”. Cad é an cur síos a bheadh ag <em>{person_name}</em> ar a ngrúpa eitneach?

source: What religion, religious denomination or body do you belong to?
ga: Cad é do reiligiún, do chreideamh reiligiúnach nó cén eagraíocht reiligiúnach dá bhfuil tú i do bhall?

source: What religion, religious denomination or body does <em>{person_name}</em> belong to?
ga: Cén reiligiún, creideamh reiligiúnach nó cén eagraíocht reiligiúnach dá bhfuil <em>{person_name}</em> ina b(h)all?

source: You selected “Other”. What religion, religious denomination or body do you belong to?
ga: Roghnaigh tú “Eile”. Cén reiligiún, creideamh nó eagraíocht reiligiúnach a bhfuil tú i do bhall de?

source: You selected “Other”. What religion, religious denomination or body does <em>{person_name}</em> belong to?
ga: Roghnaigh tú “Eile”. Cén reiligiún, creideamh nó eagraíocht reiligiúnach a bhfuil <em>{person_name}</em> ina mbaill de?

source: What religion, religious denomination or body were you <em>brought up</em> in?
ga: Cad é do reiligiún, do chreideamh reiligiúnach nó cén eagraíocht reiligiúnach <em>inar tógadh</em> thú?

source: What religion, religious denomination or body was {person_name} <em>brought up</em> in?
ga: Cén reiligiún, creideamh reiligiúnach nó cén eagraíocht reiligiúnach inar tógadh {person_name} <em>inar tógadh</em>?

source: You selected “Other”. What religion, religious denomination or body were you brought up in?
ga: Roghnaigh tú “Eile”. Cén reiligiún, creideamh nó eagraíocht reiligiúnach inar tógadh thú?

source: You selected “Other”. What religion, religious denomination or body was <em>{person_name}</em> brought up in?
ga: Roghnaigh tú “Eile”. Cén reiligiún, creideamh reiligiúnach nó eagraíocht reiligiúnach inar tógadh <em>{person_name}</em>?

source: What is your main language?
ga: Cad í do phríomhtheanga?

source: What is <em>{person_name_possessive}</em> main language?
ga: Cad í príomhtheanga <em>{person_name_possessive}</em>?

source: You selected “Other, including British or Irish Sign Language”. What is your main language?
ga: Roghnaigh tú “Eile, lena n-áirítear Teanga Chomharthaíochta na Breataine nó na hÉireann”. Cén phríomhtheanga atá agat?

source: You selected “Other, including British or Irish Sign Language”. What is <em>{person_name_possessive}</em> main language?
ga: Roghnaigh tú “Eile, lena n-áirítear Teanga Chomharthaíochta na Breataine nó na hÉireann”. Cén phríomhtheanga atá ag <em>{person_name_possessive}</em>?

source: How well can you speak English?
ga: Cé chomh maith agus a labhraíonn tú Béarla?

source: How well can <em>{person_name}</em> speak English?
ga: Cé chomh maith agus is féidir le <em>{person_name}</em> Béarla a labhairt?

source: Can you understand, speak, read or write Irish?
ga: An féidir leat Gaeilge a thuiscint, a labhairt a léamh nó a scríobh?

source: Can <em>{person_name}</em> understand, speak, read or write Irish?
ga: An féidir le <em>{person_name}</em> Gaeilge a thuiscint, a labhairt, a léamh nó a scríobh?

source: How often do you speak Irish?
ga: Cé chomh minic agus a labhraíonn tú Gaeilge?

source: How often does <em>{person_name}</em> speak Irish?
ga: Cé chomh minic a labhraíonn <em>{person_name}</em> Gaeilge?

source: Can you understand, speak, read or write Ulster-Scots?
ga: An féidir leat Albanais Uladh a thuiscint, a labhairt, a léamh nó a scríobh?

source: Can <em>{person_name}</em> understand, speak, read or write Ulster-Scots?
ga: An féidir le <em>{person_name}</em> Albanais Uladh a thuiscint, a labhairt, a léamh nó a scríobh?

source: How often do you speak Ulster-Scots?
ga: Cé chomh minic agus a labhraíonn tú Albanais Uladh?

source: How often does <em>{person_name}</em> speak Ulster-Scots?
ga: Cé chomh minic a labhraíonn <em>{person_name}</em> Albanais Uladh?

source: How is your health in general?
ga: Cad é mar atá do shláinte go ginearálta?

source: How is <em>{person_name_possessive}</em> health in general?
ga: Cad é mar atá sláinte <em>{person_name_possessive}</em> go ginearálta?

source: Are your day-to-day activities limited because of a health problem or disability which has lasted, or is expected to last, at least 12 months?
ga: An bhfuil do ghníomhaíochtaí laethúla teoranta de dheasca faidhbe sláinte, nó míchumais atá ann go fóill, nó a bhfuiltear ag súil leis go mbeidh sé agat ar feadh 12 mhí ar a laghad?

source: Are <em>{person_name_possessive}</em> day-to-day activities limited because of a health problem or disability which has lasted, or is expected to last, at least 12 months?
ga: An bhfuil gníomhaíochtaí laethúla <em>{person_name_possessive}</em> teoranta de dheasca faidhbe sláinte, nó míchumais atá ann go fóill, nó a bhfuiltear ag súil leis go mbeidh sé ann ar feadh 12 mhí ar a laghad?

source: Do you have any of the following <em>physical health conditions</em> which have lasted, or are expected to last, at least 12 months?
ga: An bhfuil ceann ar bith de na <em>fadhbanna sláinte fisicí</em> seo a leanas agat go fóill nó a bhfuiltear ag súil leis go mbeidh sé agat ar feadh 12 mhí ar a laghad?

source: Does {person_name} have any of the following <em>physical health conditions</em> which have lasted, or are expected to last, at least 12 months?
ga: An bhfuil ceann ar bith de na <em>fadhbanna sláinte fisicí</em> seo a leanas ag {person_name} go fóill nó a bhfuiltear ag súil leis go mbeidh sé acu ar feadh 12 mhí ar a laghad?

source: Do you have any of the following <em>other health conditions</em> which have lasted, or are expected to last, at least 12 months?
ga: An bhfuil ceann ar bith de na <em>fadhbanna sláinte eile</em> seo a leanas agat go fóill nó a bhfuiltear ag súil leis go mbeidh sé agat ar feadh 12 mhí ar a laghad?

source: Does {person_name} have any of the following <em>other health conditions</em> which have lasted, or are expected to last, at least 12 months?
ga: An bhfuil ceann ar bith de na <em>fadhbanna sláinte eile</em> seo a leanas ag {person_name} go fóill nó a bhfuiltear ag súil leis go mbeidh sé acu ar feadh 12 mhí ar a laghad?

source: Do you look after, or give any help or support to, anyone because they have long-term physical or mental health conditions or illnesses, or problems related to old age?
ga: An dtugann tú aire do, nó an dtugann tú tacaíocht do dhuine ar bith mar go bhfuil fadhb sláinte fisicí nó meabhrach fadtéarmaí acu nó tinnis orthu, nó fadhbanna acu mar gheall ar sheanaois?

source: Does <em>{person_name}</em> look after, or give any help or support to, anyone because they have long-term physical or mental health conditions or illnesses, or problems related to old age?
ga: An dtugann <em>{person_name}</em> aire do, nó an dtugann siad tacaíocht do dhuine ar bith mar go bhfuil fadhb sláinte fisicí nó meabhrach fadtéarmaí acu nó tinnis orthu, nó fadhbanna acu mar gheall ar sheanaois?

source: Which of the following best describes your sexual orientation?
ga: Cé acu de na rudaí seo a leanas a dhéanann an cur síos is fearr ar do chlaonadh gnéis?

source: Which of the following best describes <em>{person_name_possessive}</em> sexual orientation?
ga: Cé acu de na rudaí seo a leanas a dhéanann cur síos níos fearr ar chlaonadh gnéis <em>{person_name_possessive}</em>?

source: Have you achieved a qualification at degree level or above?
ga: Ar bhain tú cáilíocht ar leibhéal céime nó níos airde ná sin amach?

source: Has <em>{person_name}</em> achieved a qualification at degree level or above?
ga: Ar bhain <em>{person_name}</em> cáilíocht ar leibhéal céime nó níos airde ná sin amach?

source: Have you achieved a GCSE or equivalent qualification?
ga: Ar bhain tú cáilíocht GCSE nó a chomhionann amach?

source: Has <em>{person_name}</em> achieved a GCSE or equivalent qualification?
ga: Ar bhain <em>{person_name}</em> GCSE nó chomhionann amach?

source: Have you achieved an A level, AS level or equivalent qualifications?
ga: Ar bhain tú cáilíocht Ardleibhéil, leibhéal AS nó a gcomhionann amach?

source: Has <em>{person_name}</em> achieved an A level, AS level or equivalent qualifications?
ga: Ar bhain <em>{person_name}</em> cáilíocht Ardleibhéil, leibhéal AS nó a gcomhionann amach?

source: Have you achieved an NVQ or equivalent qualification?
ga: Ar bhain tú cáilíocht NVQ nó a chomhionann amach?

source: Has <em>{person_name}</em> achieved an NVQ or equivalent qualification?
ga: Ar bhain <em>{person_name}</em> NVQ nó cáilíocht chomhionann amach?

source: Have you achieved any other qualifications?
ga: Ar bhain tú cáilíocht ar bith amach?

source: Has <em>{person_name}</em> achieved any other qualifications?
ga: Ar bhain <em>{person_name}</em> cáilíocht ar bith amach?

source: Have you completed an apprenticeship?
ga: Ar chríochnaigh tú do phrintíseacht?

source: Has <em>{person_name}</em> completed an apprenticeship?
ga: Ar chríochnaigh <em>{person_name}</em> printíseacht?

source: In the last seven days, were you doing any of the following?
ga: Sna seacht lá seo a chuaigh thart, an raibh tú ag déanamh ceann ar bith de na rudaí seo a leanas?

source: In the last seven days, was <em>{person_name}</em> doing any of the following?
ga: Sna seacht lá seo a chuaigh thart, an raibh <em>{person_name}</em> ag déanamh ceann ar bith de na rudaí seo a leanas?

source: Which of the following describes what you were doing in the last seven days?
ga: Cé acu de na rudaí seo a leanas a dhéanann cur síos ar na rudaí a bhí tú ag déanamh sna seacht lá seo a chuaigh thart?

source: Which of the following describes what <em>{person_name}</em> was doing in the last seven days?
ga: Cé acu de na rudaí seo a leanas a dhéanann cur síos ar na rudaí a bhí <em>{person_name}</em> ag déanamh sna seacht lá seo a chuaigh thart?

source: In the last four weeks, were you actively looking for any kind of paid work?
ga: Sna ceithre seachtaine seo a chuaigh thart, an raibh tú ag iarraidh obair íoctha de chineál ar bith go gníomhach?

source: In the last four weeks, was <em>{person_name}</em> actively looking for any kind of paid work?
ga: Sna ceithre seachtaine seo a chuaigh thart, an raibh <em>{person_name}</em> ag iarraidh obair íoctha de chineál ar bith a dhéanamh go gníomhach?

source: If a job became available now, could you start it within two weeks?
ga: Dá mbeadh post ar fáil anois, an bhféadfá toiseacht ann taobh istigh de dhá sheachtain?

source: If a job became available now, could <em>{person_name}</em> start it within two weeks?
ga: Dá mbeadh post ar fáil anois, an bhféadfadh <em>{person_name}</em> toiseacht ann taobh istigh de dhá sheachtain?

source: In the last seven days, were you waiting to start a job already accepted?
ga: Sna seacht lá seo a chuaigh thart, an raibh tú ag fanacht le hobair a thoiseacht i bpost ar ghlac tú leis cheana féin?

source: In the last seven days, was <em>{person_name}</em> waiting to start a job already accepted?
ga: Sna seacht lá seo a chuaigh thart, an raibh <em>{person_name}</em> ag fanacht le hobair a thoiseacht i bpost ar ghlacadh leis cheana féin?

source: Have you ever done any paid work?
ga: An ndearna tú obair íoctha ar bith riamh roimhe?

source: Has <em>{person_name}</em> ever done any paid work?
ga: An ndearna <em>{person_name}</em> obair íoctha ar bith riamh?

source: In your main job, what is your employment status?
ga: I do phríomhphost, cad é atá do stádas fostaíochta?

source: In their main job, what is <em>{person_name_possessive}</em> employment status?
ga: Ina bpríomhphost, cad é an stádas fostaíochta atá ag <em>{person_name_possessive}</em>?

source: In your main job, what was your employment status?
ga: I do phríomhphost, cad é a bhí do stádas fostaíochta?

source: In their main job, what was <em>{person_name_possessive}</em> employment status?
ga: Ina bpríomhphost, cad é an stádas fostaíochta a bhí ag <em>{person_name_possessive}</em>?

source: What is the name of the organisation or business you work for?
ga: Cad é an t-ainm atá ar an eagraíocht nó ar an ghnó dá n-oibríonn tú?

source: What is the name of the organisation or business <em>{person_name}</em> works for?
ga: Cad é an t-ainm atá ar an eagraíocht nó ar an ghnó dá n-oibríonn <em>{person_name}</em>?

source: What was the name of the organisation or business you worked for?
ga: Cad é an t-ainm a bhí ar an eagraíocht nó ar an ghnó dár oibrigh tú?

source: What was the name of the organisation or business <em>{person_name}</em> worked for?
ga: Cad é an t-ainm a bhí ar an eagraíocht nó ar an ghnó dár oibrigh <em>{person_name}</em>?

source: What is your full job title?
ga: Cad é an teideal iomlán atá ar do phost?

source: What is <em>{person_name_possessive}</em> full job title?
ga: Cad é an teideal iomlán atá ar phost <em>{person_name_possessive}</em>?

source: What was your full job title?
ga: Cad é an teideal iomlán a bhí ar do phost?

source: What was <em>{person_name_possessive}</em> full job title?
ga: Cad é an teideal iomlán a bhí ar phost <em>{person_name_possessive}</em>?

source: Briefly describe what you do in your main job.
ga: Déan cur síos go hachomair ar na rudaí a dhéanann tú i do phríomhphost.

source: Briefly describe what <em>{person_name}</em> does in their main job.
ga: Déan cur síos go hachomair ar a dhéanann <em>{person_name}</em> ina bpríomhphost.

source: Briefly describe what you did in your main job.
ga: Déan cur síos go hachomair ar na rudaí a rinne tú i do phríomhphost.

source: Briefly describe what <em>{person_name}</em> did in their main job.
ga: Déan cur síos go hachomair ar a rinne <em>{person_name}</em> ina bpríomhphost.

source: What is the main activity of your organisation, business or freelance work?
ga: Cad í príomhghníomhaíocht d'eagraíochta, do ghnó nó d'fhéinfhostaíochta?

source: What is the main activity of <em>{person_name_possessive}</em> organisation, business or freelance work?
ga: Cad í príomhghníomhaíocht <em>{person_name_possessive}</em> san eagraíocht, sa ghnó, nó sa tsaorobair?

source: What was the main activity of your organisation, business or freelance work?
ga: Cad í an phríomhghníomhaíocht a bhí i d'eagraíocht, do ghnó nó d'fhéinfhostaíochta?

source: What was the main activity of <em>{person_name_possessive}</em> organisation, business or freelance work?
ga: Cad í príomhghníomhaíocht a bhí ag <em>{person_name_possessive}</em> san eagraíocht. sa ghnó, nó sa tsaorobair?

source: Do you supervise or oversee the work of other employees on a day-to-day basis?
ga: An ndéanann tú maoirseacht ar obair fhostaithe eile ó lá go lá?

source: Does <em>{person_name}</em> supervise or oversee the work of other employees on a day-to-day basis?
ga: An ndéanann <em>{person_name}</em> maoirseacht ar obair fhostaithe eile ó lá go lá?

source: Did you supervise or oversee the work of other employees on a day-to-day basis?
ga: An ndearna tú maoirseacht ar obair fhostaithe eile ó lá go lá?

source: Did <em>{person_name}</em> supervise or oversee the work of other employees on a day-to-day basis?
ga: An ndearna <em>{person_name}</em> maoirseacht ar obair fhostaithe eile ó lá go lá?

source: In your main job, how many hours a week do you usually work?
ga: I do phríomhphost, cá mhéad uair sa tseachtain a oibríonn tú de ghnáth?

source: In <em>{person_name_possessive}</em> main job, how many hours a week do they usually work?
ga: I bpríomhphost <em>{person_name_possessive}</em>, cá mhéad uair sa tseachtain a oibríonn siad de ghnáth?

source: In your main job, how many hours a week did you usually work?
ga: I do phríomhphost, cá mhéad uair sa tseachtain a d'oibrigh tú de ghnáth?

source: In <em>{person_name_possessive}</em> main job, how many hours a week did they usually work?
ga: I bpríomhphost <em>{person_name_possessive}</em>, cá mhéad uair sa tseachtain a d'oibrigh siad de ghnáth?

source: Where is your main place of <em>work</em>?
ga: Cá bhfuil do phríomháit <em>oibre</em>?

source: Where is <em>{person_name_possessive}</em> main place of <em>work</em>?
ga: Cá bhfuil príomháit <em>oibre</em> <em>{person_name_possessive}</em>?

source: Where did you mainly <em>work</em>?
ga: Cár <em>oibrigh</em> tú go príomha?

source: Where did <em>{person_name}</em> mainly <em>work</em>?
ga: Cár <em>oibrigh</em> <em>{person_name}</em> go príomha?

source: Is your main place of <em>work</em> in the UK?
ga: An bhfuil do phríomháit <em>oibre</em> sa UK?

source: Is <em>{person_name_possessive}</em> main place of <em>work</em> in the UK?
ga: An bhfuil príomháit <em>oibre</em> <em>{person_name_possessive}</em> sa RA?

source: Was your main place of <em>work</em> in the UK?
ga: An raibh do phríomháit <em>oibre</em> sa RA?

source: Was <em>{person_name_possessive}</em> main place of <em>work</em> in the UK?
ga: An raibh príomháit <em>oibre</em> <em>{person_name_possessive}</em> sa RA?

source: In which country is your main place of <em>work</em>?
ga: Cén tír ina bhfuil do phríomháit <em>oibre</em>?

source: In which country is <em>{person_name_possessive}</em> main place of <em>work</em>?
ga: Cén tír ina bhfuil príomháit <em>oibre</em> <em>{person_name_possessive}</em>?

source: In which country was your main place of <em>work</em>?
ga: Cén tír ina raibh do phríomháit <em>oibre</em>?

source: In which country was <em>{person_name_possessive}</em> main place of <em>work</em>?
ga: Cén tír ina raibh príomháit <em>oibre</em> <em>{person_name_possessive}</em>?

source: In which town and county is your main place of <em>work</em>?
ga: Cén baile mór agus contae ina bhfuil do phríomháit <em>oibre</em>?

source: In which town and county is <em>{person_name_possessive}</em> main place of <em>work</em>?
ga: Cén baile mór agus contae ina bhfuil príomháit <em>oibre</em> <em>{person_name_possessive}</em>?

source: In which town and county was your main place of <em>work</em>?
ga: Cén baile mór agus contae ina raibh do phríomháit <em>oibre</em>?

source: In which town and county was <em>{person_name_possessive}</em> main place of <em>work</em>?
ga: Cén baile mór agus contae ina raibh príomháit <em>oibre</em> <em>{person_name_possessive}</em>?

source: What is the address of your main place of <em>work</em>?
ga: Cad é an seoladh atá ag do phríomháit <em>oibre</em>?

source: What is the address of <em>{person_name_possessive}</em> main place of <em>work</em>?
ga: Cad é an seoladh atá ag príomháit <em>oibre</em> <em>{person_name_possessive}</em>?

source: What was the address of your main place of <em>work</em>?
ga: Cad é an seoladh a bhí ag do phríomháit <em>oibre</em>?

source: What was the address of <em>{person_name_possessive}</em> main place of <em>work</em>?
ga: Cad é an seoladh a bhí ag príomháit <em>oibre</em> <em>{person_name_possessive}</em>?

source: How do you usually travel to your main place of <em>work</em>?
ga: Cad é mar a thaistealaíonn tú go dtí do phríomháit <em>oibre</em> de ghnáth?

source: How does <em>{person_name}</em> usually travel to their main place of <em>work</em>?
ga: Cad é mar a thaistealaíonn <em>{person_name}</em> go dtí n-áit <em>oibre</em> de ghnáth?

source: How did you usually travel to your main place of <em>work</em>?
ga: Cad é mar a thaistil tú go dtí do phríomháit <em>oibre</em> de ghnáth?

source: How did <em>{person_name}</em> usually travel to their main place of <em>work</em>?
ga: Cad é mar a thaistil <em>{person_name}</em> go dtí n-áit <em>oibre</em> de ghnáth?

source: Where is your main place of <em>study</em>?
ga: Cá bhfuil do phríomháit <em>staidéir</em>?

source: Where is <em>{person_name_possessive}</em> main place of <em>study</em>?
ga: Cá bhfuil príomháit <em>staidéir</em> <em>{person_name_possessive}</em>?

source: Is your place of <em>study</em> in Northern Ireland?
ga: An bhfuil do phríomháit <em>staidéir</em> i dTuaisceart Éireann?

source: Is <em>{person_name_possessive}</em> place of <em>study</em> in Northern Ireland?
ga: An bhfuil <em>{person_name_possessive}</em> áit <em>staidéir</em> i dTuaisceart Éireann?

source: In which country is your course of <em>study</em>, including school?
ga: Cén tír ina bhfuil do chúrsa <em>staidéir</em>, an scoil san áireamh?
