Repository: ONSdigital/eq-questionnaire-schemas
Catalog: translations/*/census_household_gb_wls_*.po
Languages: cy

# In the last four weeks, were you actively looking for any kind of paid work?
source: We ask people who are not working due to long-term illness or disability because some intend to go back to work.
cy: Rydym ni’n gofyn i bobl sydd wedi bod yn sâl neu'n anabl am gyfnod hir am fod rhai ohonyn nhw’n bwriadu mynd yn ôl i'r gwaith.

source: To get a true picture of the working population, we ask this question of everyone who is not currently working.
cy: I gael darlun cywir o'r boblogaeth o oedran gweithio, rydym ni’n gofyn y cwestiwn hwn i bawb sydd ddim yn gweithio ar hyn o bryd.

source: We ask people who are retired because the number of people continuing to work after retirement is increasing.
cy: Rydym ni’n gofyn i bobl sydd wedi ymddeol am fod mwy a mwy o bobl yn parhau i weithio ar ôl oedran ymddeol.

source: We ask people who are not working due to long-term illness or disability because some intend to go back to work.
cy: Rydym ni’n gofyn i bobl sydd wedi bod yn sâl neu'n anabl am gyfnod hir am fod rhai ohonyn nhw’n bwriadu mynd yn ôl i'r gwaith.

# In the last seven days, were you waiting to start a job already accepted?
source: To get a true picture of the working population, we ask this question of everyone who is not currently working.
cy: I gael darlun cywir o'r boblogaeth o oedran gweithio, rydym ni’n gofyn y cwestiwn hwn i bawb sydd ddim yn gweithio ar hyn o bryd.

# In the last seven days, were you waiting to start a job already accepted?
source: We ask people who are retired because the number of people continuing to work after retirement is increasing.
cy: Rydym ni’n gofyn i bobl sydd wedi ymddeol am fod mwy a mwy o bobl yn parhau i weithio ar ôl oedran ymddeol.

# In the last seven days, were you waiting to start a job already accepted?
source: We ask people who are not working due to long-term illness or disability because some intend to go back to work.
cy: Rydym ni’n gofyn i bobl sydd wedi bod yn sâl neu'n anabl am gyfnod hir am fod rhai ohonyn nhw’n bwriadu mynd yn ôl i'r gwaith.

source: To get a true picture of the working population, we ask this question of everyone who is not currently working.
cy: I gael darlun cywir o'r boblogaeth o oedran gweithio, rydym ni’n gofyn y cwestiwn hwn i bawb sydd ddim yn gweithio ar hyn o bryd.

source: We ask people who are retired because the number of people continuing to work after retirement is increasing.
cy: Rydym ni’n gofyn i bobl sydd wedi ymddeol am fod mwy a mwy o bobl yn parhau i weithio ar ôl oedran ymddeol.

source: We ask people who are not working due to long-term illness or disability because some intend to go back to work.
cy: Rydym ni’n gofyn i bobl sydd wedi bod yn sâl neu'n anabl am gyfnod hir am fod rhai ohonyn nhw’n bwriadu mynd yn ôl i'r gwaith.

# Where do you mainly work?
source: Your answer will help your community by allowing the government and councils to understand commuting patterns.
cy: Bydd eich ateb yn helpu eich cymuned drwy alluogi’r llywodraeth a chynghorau i ddeall patrymau teithio i’r gwaith.

# Where do you mainly work?
source: Information about your workplace and how you travel to work are used together to work out local public transport needs, develop transport policies and plan services.
cy: Caiff gwybodaeth am eich gweithle a sut rydych yn teithio i’r gwaith ei defnyddio i nodi anghenion trafnidiaeth gyhoeddus lleol, datblygu polisïau trafnidiaeth a chynllunio gwasanaethau.

# Where does <em>{person_name}</em> mainly work?
source: Their answer will help their community by allowing the government and councils to understand commuting patterns.
cy: Bydd ateb yr unigolyn yn helpu ei gymuned drwy alluogi’r llywodraeth a chynghorau i ddeall patrymau teithio i’r gwaith.

# Where does <em>{person_name}</em> mainly work?
source: Information about their workplace and how they travel to work are used together to work out local public transport needs, develop transport policies and plan services.
cy: Caiff gwybodaeth am weithle’r unigolyn a sut mae’n teithio i’r gwaith ei defnyddio i nodi anghenion trafnidiaeth gyhoeddus lleol, datblygu polisïau trafnidiaeth a chynllunio gwasanaethau.

# What is the address of your workplace?
source: Your answer will help your community by allowing the government and councils to understand commuting patterns.
cy: Bydd eich ateb yn helpu eich cymuned drwy alluogi’r llywodraeth a chynghorau i ddeall patrymau cymudo.

# What is the address of your workplace?
source: Information about your workplace address and how you travel to work are used together to work out local public transport needs, develop transport policies and plan services.
cy: Caiff gwybodaeth am gyfeiriad eich gweithle a sut rydych chi’n teithio i’r gwaith ei defnyddio i nodi anghenion trafnidiaeth gyhoeddus lleol, datblygu polisïau trafnidiaeth a chynllunio gwasanaethau.

# What is the address of <em>{person_name_possessive}</em> workplace?
source: Their answer will help their community by allowing the government and councils to understand commuting patterns.
cy: Bydd ateb yr unigolyn yn helpu ei gymuned drwy alluogi’r llywodraeth a chynghorau i ddeall patrymau cymudo.

# What is the address of <em>{person_name_possessive}</em> workplace?
source: Information about their workplace address and how they travel to work are used together to work out local public transport needs, develop transport policies and plan services.
cy: Caiff gwybodaeth am gyfeiriad gweithle’r unigolyn a sut mae’n teithio i’r gwaith ei defnyddio i nodi anghenion trafnidiaeth gyhoeddus lleol, datblygu polisïau trafnidiaeth a chynllunio gwasanaethau.

# What is the address of your depot?
source: Your answer will help your community by allowing the government and councils to understand commuting patterns.
cy: Bydd eich ateb yn helpu eich cymuned drwy alluogi’r llywodraeth a chynghorau i ddeall patrymau cymudo.

# What is the address of your depot?
source: Information about your workplace address and how you travel to work are used together to work out local public transport needs, develop transport policies and plan services.
cy: Caiff gwybodaeth am gyfeiriad eich gweithle a sut rydych chi’n teithio i’r gwaith ei defnyddio i nodi anghenion trafnidiaeth gyhoeddus lleol, datblygu polisïau trafnidiaeth a chynllunio gwasanaethau.

# What is the address of <em>{person_name_possessive}</em> depot?
source: Their answer will help their community by allowing the government and councils to understand commuting patterns.
cy: Bydd ateb yr unigolyn yn helpu ei gymuned drwy alluogi’r llywodraeth a chynghorau i ddeall patrymau cymudo.

# What is the address of <em>{person_name_possessive}</em> depot?
source: Information about their workplace address and how they travel to work are used together to work out local public transport needs, develop transport policies and plan services.
cy: Caiff gwybodaeth am gyfeiriad gweithle’r unigolyn a sut mae’n teithio i’r gwaith ei defnyddio i nodi anghenion trafnidiaeth gyhoeddus lleol, datblygu polisïau trafnidiaeth a chynllunio gwasanaethau.

# What is <em>{person_name_possessive}</em> date of birth?
source: Your answer helps to ensure that everyone is counted in the census. Add visitor details, even if you think they have been included on a census questionnaire at another address.
cy: Mae eich ateb yn helpu i sicrhau bod pawb yn cael eu cyfrif yn y cyfrifiad. Ychwanegwch fanylion ymwelwyr, hyd yn oed os ydych chi’n credu eu bod wedi cael eu cynnwys ar holiadur y cyfrifiad mewn cyfeiriad arall.

# What is <em>{person_name_possessive}</em> sex?
source: Your answer helps to ensure that everyone is counted in the census. Add visitor details, even if you think they have been included on a census questionnaire at another address.
cy: Mae eich ateb yn helpu i sicrhau bod pawb yn cael eu cyfrif yn y cyfrifiad. Ychwanegwch fanylion ymwelwyr, hyd yn oed os ydych chi’n credu eu bod wedi cael eu cynnwys ar holiadur y cyfrifiad mewn cyfeiriad arall.

# What is <em>{person_name_possessive}</em> usual address?
source: Your answer helps to ensure that everyone is counted in the census. Add visitor details, even if you think they have been included on a census questionnaire at another address.
cy: Mae eich ateb yn helpu i sicrhau bod pawb yn cael eu cyfrif yn y cyfrifiad. Ychwanegwch fanylion ymwelwyr, hyd yn oed os ydych chi’n credu eu bod wedi cael eu cynnwys ar holiadur y cyfrifiad mewn cyfeiriad arall.

# What is your ethnic group?
source: provide services and share funding fairly
cy: darparu gwasanaethau a rhannu cyllid yn deg

# What is your ethnic group?
source: understand and represent everyone’s interests
cy: deall a chynrychioli buddiannau pawb

# What is <em>{person_name_possessive}</em> ethnic group?
source: provide services and share funding fairly
cy: darparu gwasanaethau a rhannu cyllid yn deg

# What is <em>{person_name_possessive}</em> ethnic group?
source: understand and represent everyone’s interests
cy: deall a chynrychioli buddiannau pawb

# Which one best describes your White ethnic group or background?
source: provide services and share funding fairly
cy: darparu gwasanaethau a rhannu cyllid yn deg

# Which one best describes your White ethnic group or background?
source: understand and represent everyone’s interests
cy: deall a chynrychioli buddiannau pawb

source: provide services and share funding fairly
cy: darparu gwasanaethau a rhannu cyllid yn deg

source: understand and represent everyone’s interests
cy: deall a chynrychioli buddiannau pawb

# Which one best describes your Mixed or Multiple ethnic group or background?
source: provide services and share funding fairly
cy: darparu gwasanaethau a rhannu cyllid yn deg

# Which one best describes your Mixed or Multiple ethnic group or background?
source: understand and represent everyone’s interests
cy: deall a chynrychioli buddiannau pawb

source: provide services and share funding fairly
cy: darparu gwasanaethau a rhannu cyllid yn deg

source: understand and represent everyone’s interests
cy: deall a chynrychioli buddiannau pawb

source: provide services and share funding fairly
cy: darparu gwasanaethau a rhannu cyllid yn deg

source: understand and represent everyone’s interests
cy: deall a chynrychioli buddiannau pawb

source: provide services and share funding fairly
cy: darparu gwasanaethau a rhannu cyllid yn deg

source: understand and represent everyone’s interests
cy: deall a chynrychioli buddiannau pawb

source: provide services and share funding fairly
cy: darparu gwasanaethau a rhannu cyllid yn deg

source: understand and represent everyone’s interests
cy: deall a chynrychioli buddiannau pawb

source: provide services and share funding fairly
cy: darparu gwasanaethau a rhannu cyllid yn deg

source: understand and represent everyone’s interests
cy: deall a chynrychioli buddiannau pawb

# Which one best describes your other ethnic group or background?
source: provide services and share funding fairly
cy: darparu gwasanaethau a rhannu cyllid yn deg

# Which one best describes your other ethnic group or background?
source: understand and represent everyone’s interests
cy: deall a chynrychioli buddiannau pawb

source: provide services and share funding fairly
cy: darparu gwasanaethau a rhannu cyllid yn deg

source: understand and represent everyone’s interests
cy: deall a chynrychioli buddiannau pawb

# Which of the following best describes your sexual orientation?
source: monitor equality to ensure that everyone is treated fairly
cy: fonitro cydraddoldeb er mwyn sicrhau bod pawb yn cael eu trin yn deg

# Which of the following best describes your sexual orientation?
source: provide services and share funding
cy: darparu gwasanaethau a rhannu cyllid

source: monitor equality to ensure that everyone is treated fairly
cy: fonitro cydraddoldeb er mwyn sicrhau bod pawb yn cael eu trin yn deg

source: provide services and share funding
cy: darparu gwasanaethau a rhannu cyllid
