Repository: ONSdigital/eq-questionnaire-schemas
Catalog: translations/*/census_household_gb_wls_*.po
Languages: cy

# What is <em>{person_name_possessive}</em> ethnic group?
source: Mixed or Multiple ethnic groups
cy: Grwpiau Cymysg neu Amlethnig

# What is <em>{person_name_possessive}</em> ethnic group?
source: Asian, Asian Welsh or Asian British
cy: Asiaidd, Asiaidd Cymreig neu Asiaidd Prydeinig

# What is <em>{person_name_possessive}</em> ethnic group?
source: Black, Black Welsh, Black British, Caribbean or African
cy: Du, Du Cymreig, Du Prydeinig, Caribïaidd neu Affricanaidd

# What is <em>{person_name_possessive}</em> ethnic group?
source: Other ethnic group
cy: Grŵp ethnig arall

# Which one best describes your White ethnic group or background?
source: Welsh, English, Scottish, Northern Irish or British
cy: Cymreig, Seisnig, Albanaidd, Gwyddelig Gogledd Iwerddon neu Brydeinig

# Which one best describes your White ethnic group or background?
source: Irish
cy: Gwyddelig

# Which one best describes your White ethnic group or background?
source: Gypsy or Irish Traveller
cy: Sipsi neu Deithiwr Gwyddelig

# Which one best describes your White ethnic group or background?
source: Any other White background
cy: Unrhyw gefndir Gwyn arall

source: Welsh, English, Scottish, Northern Irish or British
cy: Cymreig, Seisnig, Albanaidd, Gwyddelig Gogledd Iwerddon neu Brydeinig

source: Irish
cy: Gwyddelig

source: Gypsy or Irish Traveller
cy: Sipsi neu Deithiwr Gwyddelig

source: Any other White background
cy: Unrhyw gefndir Gwyn arall

# Which one best describes your Mixed or Multiple ethnic group or background?
source: White and Black Caribbean
cy: Gwyn a Du Caribïaidd

# Which one best describes your Mixed or Multiple ethnic group or background?
source: White and Black African
cy: Gwyn a Du Affricanaidd

# Which one best describes your Mixed or Multiple ethnic group or background?
source: White and Asian
cy: Gwyn ac Asiaidd

# Which one best describes your Mixed or Multiple ethnic group or background?
source: Any other Mixed or Multiple background
cy: Unrhyw gefndir Cymysg neu Amlethnig arall

source: White and Black Caribbean
cy: Gwyn a Du Caribïaidd

source: White and Black African
cy: Gwyn a Du Affricanaidd

source: White and Asian
cy: Gwyn ac Asiaidd

source: Any other Mixed or Multiple background
cy: Unrhyw gefndir Cymysg neu Amlethnig arall

source: Indian
cy: Indiaidd

source: Pakistani
cy: Pacistanaidd

source: Bangladeshi
cy: Bangladeshaidd

source: Chinese
cy: Tsieineaidd

source: Any other Asian background
cy: Unrhyw gefndir Asiaidd arall

source: Indian
cy: Indiaidd

source: Pakistani
cy: Pacistanaidd

source: Bangladeshi
cy: Bangladeshaidd

source: Chinese
cy: Tsieineaidd

source: Any other Asian background
cy: Unrhyw gefndir Asiaidd arall

source: Caribbean
cy: Caribïaidd

source: African
cy: Affricanaidd

source: Any other Black, Black British or Caribbean background
cy: Unrhyw gefndir Du, Du Prydeinig neu Garibïaidd arall

source: Caribbean
cy: Caribïaidd

source: African
cy: Affricanaidd

source: Any other Black, Black British or Caribbean background
cy: Unrhyw gefndir Du, Du Prydeinig neu Garibïaidd arall

# Which one best describes your other ethnic group or background?
source: Arab
cy: Arabaidd

# Which one best describes your other ethnic group or background?
source: Any other ethnic group
cy: Unrhyw grŵp ethnig arall

source: Arab
cy: Arabaidd

source: Any other ethnic group
cy: Unrhyw grŵp ethnig arall

# What is your religion?
source: No religion
cy: Dim crefydd

# What is your religion?
source: Christian
cy: Cristnogaeth

# What is your religion?
source: Buddhist
cy: Bwdhaeth

# What is your religion?
source: Hindu
cy: Hindŵaeth

# What is your religion?
source: Jewish
cy: Iddewiaeth

# What is your religion?
source: Muslim
cy: Islam

# What is your religion?
source: Sikh
cy: Siciaeth

# What is your religion?
source: Any other religion
cy: Unrhyw grefydd arall

# What is <em>{person_name_possessive}</em> religion?
source: No religion
cy: Dim crefydd

# What is <em>{person_name_possessive}</em> religion?
source: Christian
cy: Cristnogaeth

# What is <em>{person_name_possessive}</em> religion?
source: Buddhist
cy: Bwdhaeth

# What is <em>{person_name_possessive}</em> religion?
source: Hindu
cy: Hindŵaeth

# What is <em>{person_name_possessive}</em> religion?
source: Jewish
cy: Iddewiaeth

# What is <em>{person_name_possessive}</em> religion?
source: Muslim
cy: Islam

# What is <em>{person_name_possessive}</em> religion?
source: Sikh
cy: Siciaeth

# What is <em>{person_name_possessive}</em> religion?
source: Any other religion
cy: Unrhyw grefydd arall

# Can you understand, speak, read or write Welsh?
source: Understand spoken Welsh
cy: Deall Cymraeg llafar

# Can you understand, speak, read or write Welsh?
source: Speak Welsh
cy: Siarad Cymraeg

# Can you understand, speak, read or write Welsh?
source: Read Welsh
cy: Darllen Cymraeg

# Can you understand, speak, read or write Welsh?
source: Write Welsh
cy: Ysgrifennu Cymraeg

# Can you understand, speak, read or write Welsh?
source: None of these apply
cy: Dim un o'r rhain

# Can <em>{person_name}</em> understand, speak, read or write Welsh?
source: Understand spoken Welsh
cy: Deall Cymraeg llafar

# Can <em>{person_name}</em> understand, speak, read or write Welsh?
source: Speak Welsh
cy: Siarad Cymraeg

# Can <em>{person_name}</em> understand, speak, read or write Welsh?
source: Read Welsh
cy: Darllen Cymraeg

# Can <em>{person_name}</em> understand, speak, read or write Welsh?
source: Write Welsh
cy: Ysgrifennu Cymraeg

# Can <em>{person_name}</em> understand, speak, read or write Welsh?
source: None of these apply
cy: Dim un o'r rhain

# What is your main language?
source: English or Welsh
cy: Cymraeg neu Saesneg

# What is your main language?
source: Other, including British Sign Language
cy: Arall, gan gynnwys laith Arwyddion Prydain

# What is <em>{person_name_possessive}</em> main language?
source: English or Welsh
cy: Cymraeg neu Saesneg

# What is <em>{person_name_possessive}</em> main language?
source: Other, including British Sign Language
cy: Arall, gan gynnwys Iaith Arwyddion Prydain

# How well can you speak English?
source: Very well
cy: Da iawn

# How well can you speak English?
source: Well
cy: Da

# How well can you speak English?
source: Not well
cy: Ddim yn dda

# How well can you speak English?
source: Not at all
cy: Ddim o gwbl

# How well can <em>{person_name}</em> speak English?
source: Very well
cy: Da iawn

# How well can <em>{person_name}</em> speak English?
source: Well
cy: Da

# How well can <em>{person_name}</em> speak English?
source: Not well
cy: Ddim yn dda

# How well can <em>{person_name}</em> speak English?
source: Not at all
cy: Ddim o gwbl

# What passports do you hold?
source: United Kingdom
cy: Y Deyrnas Unedig

# What passports do you hold?
source: Ireland
cy: Iwerddon

# What passports do you hold?
source: Other
cy: Arall

# What passports do you hold?
source: None
cy: Dim un

# What passports does <em>{person_name}</em> hold?
source: United Kingdom
cy: Y Deyrnas Unedig

# What passports does <em>{person_name}</em> hold?
source: Ireland
cy: Iwerddon

# What passports does <em>{person_name}</em> hold?
source: Other
cy: Arall

# What passports does <em>{person_name}</em> hold?
source: None
cy: Dim un

# How is your health in general?
source: Very good
cy: Da iawn

# How is your health in general?
source: Good
cy: Da

# How is your health in general?
source: Fair
cy: Gweddol

# How is your health in general?
source: Bad
cy: Gwael

# How is your health in general?
source: Very bad
cy: Gwael iawn

# How is <em>{person_name_possessive}</em> health in general?
source: Very good
cy: Da iawn

# How is <em>{person_name_possessive}</em> health in general?
source: Good
cy: Da

# How is <em>{person_name_possessive}</em> health in general?
source: Fair
cy: Gweddol

# How is <em>{person_name_possessive}</em> health in general?
source: Bad
cy: Gwael

# How is <em>{person_name_possessive}</em> health in general?
source: Very bad
cy: Gwael iawn

source: Yes
cy: Oes

source: No
cy: Nac oes

source: Yes
cy: Oes

source: No
cy: Nac oes

source: Yes, a lot
cy: Ydy, yn fawr

source: Yes, a little
cy: Ydy, ychydig

source: Not at all
cy: Ddim o gwbl

source: Yes, a lot
cy: Ydy, yn fawr

source: Yes, a little
cy: Ydy, ychydig

source: Not at all
cy: Ddim o gwbl

source: No
cy: Nac ydw

source: Yes, 9 hours a week or less
cy: Ydw, 9 awr neu lai yr wythnos

source: Yes, 10 to 19 hours a week
cy: Ydw, 10 i 19 awr yr wythnos

source: Yes, 20 to 34 hours a week
cy: Ydw, 20 i 34 awr yr wythnos

source: Yes, 35 to 49 hours a week
cy: Ydw, 35 i 49 awr yr wythnos

source: Yes, 50 or more hours a week
cy: Ydw, 50 awr neu fwy yr wythnos

source: No
cy: Nac ydy

source: Yes, 9 hours a week or less
cy: Ydy, 9 awr neu lai yr wythnos

source: Yes, 10 to 19 hours a week
cy: Ydy, 10 i 19 awr yr wythnos

source: Yes, 20 to 34 hours a week
cy: Ydy, 20 i 34 awr yr wythnos

source: Yes, 35 to 49 hours a week
cy: Ydy, 35 i 49 awr yr wythnos

source: Yes, 50 or more hours a week
cy: Ydy, 50 awr neu fwy yr wythnos

# Which of the following best describes your sexual orientation?
source: Straight or Heterosexual
cy: Heterorywiol/Strêt

# Which of the following best describes your sexual orientation?
source: Gay or Lesbian
cy: Hoyw neu Lesbiaidd

# Which of the following best describes your sexual orientation?
source: Bisexual
cy: Deurywiol/Bi

# Which of the following best describes your sexual orientation?
source: Other sexual orientation
cy: Cyfeiriadedd rhywiol arall

source: Straight or Heterosexual
cy: Heterorywiol/Strêt

source: Gay or Lesbian
cy: Hoyw neu Lesbiaidd

source: Bisexual
cy: Deurywiol/Bi

source: Other sexual orientation
cy: Cyfeiriadedd rhywiol arall

# Is the gender you identify with the same as your sex registered at birth?
source: Yes
cy: Ydy

# Is the gender you identify with the same as your sex registered at birth?
source: No
cy: Nac ydy

source: Yes
cy: Ydy

source: No
cy: Nac ydy

# Have you completed an apprenticeship?
source: Yes
cy: Ydw

# Have you completed an apprenticeship?
source: No
cy: Nac ydw

# Has <em>{person_name}</em> completed an apprenticeship?
source: Yes
cy: Ydy

# Has <em>{person_name}</em> completed an apprenticeship?
source: No
cy: Nac ydy

# Have you achieved a qualification at degree level or above?
source: Yes
cy: Oes

# Have you achieved a qualification at degree level or above?
source: No
cy: Nac oes

# Has <em>{person_name}</em> achieved a qualification at degree level or above?
source: Yes
cy: Oes

# Has <em>{person_name}</em> achieved a qualification at degree level or above?
source: No
cy: Nac oes

# Have you achieved an NVQ or equivalent qualification?
source: NVQ level 3 or equivalent
cy: NVQ lefel 3 neu gymhwyster cyfatebol

# Have you achieved an NVQ or equivalent qualification?
source: NVQ level 2 or equivalent
cy: NVQ lefel 2 neu gymhwyster cyfatebol

# Have you achieved an NVQ or equivalent qualification?
source: NVQ level 1 or equivalent
cy: NVQ lefel 1 neu gymhwyster cyfatebol

# Have you achieved an NVQ or equivalent qualification?
source: None of these apply
cy: Dim un o’r rhain

# Has <em>{person_name}</em> achieved an NVQ or equivalent qualification?
source: NVQ level 3 or equivalent
cy: NVQ lefel 3 neu gymhwyster cyfatebol

# Has <em>{person_name}</em> achieved an NVQ or equivalent qualification?
source: NVQ level 2 or equivalent
cy: NVQ lefel 2 neu gymhwyster cyfatebol

# Has <em>{person_name}</em> achieved an NVQ or equivalent qualification?
source: NVQ level 1 or equivalent
cy: NVQ lefel 1 neu gymhwyster cyfatebol

# Has <em>{person_name}</em> achieved an NVQ or equivalent qualification?
source: None of these apply
cy: Dim un o’r rhain

# Have you achieved an AS, A level or equivalent qualification?
source: 2 or more A levels
cy: 2 neu fwy o gymwysterau Lefel A (Safon Uwch)

# Have you achieved an AS, A level or equivalent qualification?
source: 1 A level
cy: 1 Lefel A (Safon Uwch)

# Have you achieved an AS, A level or equivalent qualification?
source: 1 AS level
cy: 1 Lefel AS (Safon UG)

# Have you achieved an AS, A level or equivalent qualification?
source: Advanced Welsh Baccalaureate
cy: Bagloriaeth Cymru – Uwch

# Have you achieved an AS, A level or equivalent qualification?
source: None of these apply
cy: Dim un o'r rhain

# Has <em>{person_name}</em> achieved an AS, A level or equivalent qualification?
source: 2 or more A levels
cy: 2 neu fwy o gymwysterau Lefel A (Safon Uwch)

# Has <em>{person_name}</em> achieved an AS, A level or equivalent qualification?
source: 1 A level
cy: 1 Lefel A (Safon Uwch)

# Has <em>{person_name}</em> achieved an AS, A level or equivalent qualification?
source: 1 AS level
cy: 1 Lefel AS (Safon UG)

# Has <em>{person_name}</em> achieved an AS, A level or equivalent qualification?
source: Advanced Welsh Baccalaureate
cy: Bagloriaeth Cymru – Uwch

# Has <em>{person_name}</em> achieved an AS, A level or equivalent qualification?
source: None of these apply
cy: Dim un o’r rhain

# Have you achieved a GCSE or equivalent qualification?
source: 5 or more GCSEs grade A* to C or 9 to 4
cy: 5 neu fwy o gymwysterau TGAU (A* i C neu 9 i 4)

# Have you achieved a GCSE or equivalent qualification?
source: Any other GCSEs
cy: Unrhyw gymwysterau TGAU eraill

# Have you achieved a GCSE or equivalent qualification?
source: Basic Skills course
cy: Cwrs Sgiliau Sylfaenol

# Have you achieved a GCSE or equivalent qualification?
source: Intermediate or National Welsh Baccalaureate
cy: Bagloriaeth Cymru – Canolradd neu Genedlaethol

# Have you achieved a GCSE or equivalent qualification?
source: Foundation Welsh Baccalaureate
cy: Bagloriaeth Cymru – Sylfaen

# Have you achieved a GCSE or equivalent qualification?
source: None of these apply
cy: Dim un o'r rhain

# Has <em>{person_name}</em> achieved a GCSE or equivalent qualification?
source: 5 or more GCSEs grade A* to C or 9 to 4
cy: 5 neu fwy o gymwysterau TGAU (A* i C neu 9 i 4)

# Has <em>{person_name}</em> achieved a GCSE or equivalent qualification?
source: Any other GCSEs
cy: Unrhyw gymwysterau TGAU eraill

# Has <em>{person_name}</em> achieved a GCSE or equivalent qualification?
source: Basic Skills course
cy: Cwrs Sgiliau Sylfaenol

# Has <em>{person_name}</em> achieved a GCSE or equivalent qualification?
source: Intermediate or National Welsh Baccalaureate
cy: Bagloriaeth Cymru – Canolradd neu Genedlaethol

# Has <em>{person_name}</em> achieved a GCSE or equivalent qualification?
source: Foundation Welsh Baccalaureate
cy: Bagloriaeth Cymru – Sylfaen

# Has <em>{person_name}</em> achieved a GCSE or equivalent qualification?
source: None of these apply
cy: Dim un o’r rhain

# Have you achieved any other qualifications?
source: Yes, in Wales or England
cy: Oes, o Gymru neu o Loegr

# Have you achieved any other qualifications?
source: Yes, anywhere outside of Wales and England
cy: Oes, o unrhyw le y tu allan i Gymru a Lloegr

# Have you achieved any other qualifications?
source: No qualifications
cy: Dim cymwysterau

# Has <em>{person_name}</em> achieved any other qualifications?
source: Yes, in Wales or England
cy: Oes, o Gymru neu o Loegr

# Has <em>{person_name}</em> achieved any other qualifications?
source: Yes, anywhere outside of Wales and England
cy: Oes, o unrhyw le y tu allan i Gymru a Lloegr

# Has <em>{person_name}</em> achieved any other qualifications?
source: No qualifications
cy: Dim cymwysterau

# Have you previously served in the UK Armed Forces?
source: Yes, previously served in Regular Armed Forces
cy: Ydw, wedi gwasanaethu yn y Lluoedd Arfog Rheolaidd yn y gorffennol

# Have you previously served in the UK Armed Forces?
source: Yes, previously served in Reserve Armed Forces
cy: Ydw, wedi gwasanaethu yn y Lluoedd Arfog Wrth Gefn yn y gorffennol

# Have you previously served in the UK Armed Forces?
source: No
cy: Nac ydw

# Has <em>{person_name}</em> previously served in the UK Armed Forces?
source: Yes, previously served in Regular Armed Forces
cy: Ydy, wedi gwasanaethu yn y Lluoedd Arfog Rheolaidd yn y gorffennol

# Has <em>{person_name}</em> previously served in the UK Armed Forces?
source: Yes, previously served in Reserve Armed Forces
cy: Ydy, wedi gwasanaethu yn y Lluoedd Arfog Wrth Gefn yn y gorffennol

# Has <em>{person_name}</em> previously served in the UK Armed Forces?
source: No
cy: Nac ydy

# In the last seven days, were you doing any of the following?
source: Working as an employee
cy: Gwaith cyflogedig

# In the last seven days, were you doing any of the following?
source: Self-employed or freelance
cy: Gwaith hunangyflogedig neu ar eich liwt eich hun

# In the last seven days, were you doing any of the following?
source: Temporarily away from work ill, on holiday or temporarily laid off
cy: I ffwrdd o’ch gwaith dros dro yn sâl, ar wyliau, neu wedi’ch cadw dros dro o’ch gwaith am na all eich cyflogwr gynnig gwaith ar hyn o bryd

# In the last seven days, were you doing any of the following?
source: On maternity or paternity leave
cy: Ar gyfnod mamolaeth neu dadolaeth

# In the last seven days, were you doing any of the following?
source: Doing any other kind of paid work
cy: Unrhyw fath arall o waith am dâl

# In the last seven days, were you doing any of the following?
source: None of these apply
cy: Dim un o'r rhain

# In the last seven days, was <em>{person_name}</em> doing any of the following?
source: Working as an employee
cy: Gwaith cyflogedig

# In the last seven days, was <em>{person_name}</em> doing any of the following?
source: Self-employed or freelance
cy: Gwaith hunangyflogedig neu ar ei liwt ei hun

# In the last seven days, was <em>{person_name}</em> doing any of the following?
source: Temporarily away from work ill, on holiday or temporarily laid off
cy: I ffwrdd o'r gwaith dros dro yn sâl, ar wyliau, neu mae'r unigolyn wedi'i gadw o'r gwaith dros dro am na all y cyflogwr gynnig gwaith ar hyn o bryd

# In the last seven days, was <em>{person_name}</em> doing any of the following?
source: On maternity or paternity leave
cy: Ar gyfnod mamolaeth neu dadolaeth

# In the last seven days, was <em>{person_name}</em> doing any of the following?
source: Doing any other kind of paid work
cy: Unrhyw fath arall o waith am dâl

# In the last seven days, was <em>{person_name}</em> doing any of the following?
source: None of these apply
cy: Dim un o’r rhain

# Which of the following describes what you were doing in the last seven days?
source: Retired
cy: Wedi ymddeol

# Which of the following describes what you were doing in the last seven days?
source: Studying
cy: Astudio

# Which of the following describes what you were doing in the last seven days?
source: Looking after home or family
cy: Gofalu am y cartref neu am y teulu

# Which of the following describes what you were doing in the last seven days?
source: Long-term sick or disabled
cy: Anabl neu yn sâl am gyfnod hir

# Which of the following describes what you were doing in the last seven days?
source: Other
cy: Arall

source: Retired
cy: Wedi ymddeol

source: Studying
cy: Astudio

source: Looking after home or family
cy: Gofalu am y cartref neu am y teulu

source: Long-term sick or disabled
cy: Anabl neu yn sâl am gyfnod hir

source: Other
cy: Arall

# In the last four weeks, were you actively looking for any kind of paid work?
source: Yes
cy: Oeddwn

# In the last four weeks, were you actively looking for any kind of paid work?
source: No
cy: Nac oeddwn

source: Yes
cy: Oedd

source: No
cy: Nac oedd

# Are you available to start work in the next two weeks?
source: Yes
cy: Ydw

# Are you available to start work in the next two weeks?
source: No
cy: Nac ydw

# Is <em>{person_name}</em> available to start work in the next two weeks?
source: Yes
cy: Ydy

# Is <em>{person_name}</em> available to start work in the next two weeks?
source: No
cy: Nac ydy

# In the last seven days, were you waiting to start a job already accepted?
source: Yes
cy: Oeddwn

# In the last seven days, were you waiting to start a job already accepted?
source: No
cy: Nac oeddwn

source: Yes
cy: Oedd

source: No
cy: Nac oedd

# Have you ever done any paid work?
source: Yes, in the last 12 months
cy: Ydw, yn ystod y 12 mis diwethaf

# Have you ever done any paid work?
source: Yes, but not in the last 12 months
cy: Ydw, ond nid yn ystod y 12 mis diwethaf

# Have you ever done any paid work?
source: No, have never worked
cy: Nac ydw, erioed wedi gweithio

# Has <em>{person_name}</em> ever done any paid work?
source: Yes, in the last 12 months
cy: Ydy, yn ystod y 12 mis diwethaf

# Has <em>{person_name}</em> ever done any paid work?
source: Yes, but not in the last 12 months
cy: Ydy, ond nid yn ystod y 12 mis diwethaf

# Has <em>{person_name}</em> ever done any paid work?
source: No, has never worked
cy: Nac ydy, erioed wedi gweithio

# In your main job, what is your employment status?
source: Employee
cy: Gweithiwr cyflogedig

# In your main job, what is your employment status?
source: Self-employed or freelance without employees
cy: Hunangyflogedig neu’n gweithio ar eich liwt eich hun heb gyflogi gweithwyr eraill

# In your main job, what is your employment status?
source: Self-employed with employees
cy: Hunangyflogedig ac yn cyflogi gweithwyr eraill

# In their main job, what is <em>{person_name_possessive}</em> employment status?
source: Employee
cy: Gweithiwr cyflogedig

# In their main job, what is <em>{person_name_possessive}</em> employment status?
source: Self-employed or freelance without employees
cy: Hunangyflogedig neu’n gweithio ar ei liwt ei hun heb gyflogi gweithwyr eraill

# In their main job, what is <em>{person_name_possessive}</em> employment status?
source: Self-employed with employees
cy: Hunangyflogedig ac yn cyflogi gweithwyr eraill

# In your main job, what was your employment status?
source: Employee
cy: Gweithiwr cyflogedig

# In your main job, what was your employment status?
source: Self-employed or freelance without employees
cy: Hunangyflogedig neu’n gweithio ar eich liwt eich hun heb gyflogi gweithwyr eraill

# In your main job, what was your employment status?
source: Self-employed with employees
cy: Hunangyflogedig ac yn cyflogi gweithwyr eraill

# In their main job, what was <em>{person_name_possessive}</em> employment status?
source: Employee
cy: Gweithiwr cyflogedig

# In their main job, what was <em>{person_name_possessive}</em> employment status?
source: Self-employed or freelance without employees
cy: Hunangyflogedig neu’n gweithio ar ei liwt ei hun heb gyflogi gweithwyr eraill

# In their main job, what was <em>{person_name_possessive}</em> employment status?
source: Self-employed with employees
cy: Hunangyflogedig ac yn cyflogi gweithwyr eraill

# What is the name of the organisation or business you work for?
source: No organisation or work for a private individual
cy: Dim sefydliad neu’n gweithio i unigolyn preifat

source: No organisation or works for a private individual
cy: Dim sefydliad neu’n gweithio i unigolyn preifat

# What was the name of the organisation or business you worked for?
source: No organisation or worked for a private individual
cy: Dim sefydliad neu’n gweithio i unigolyn preifat

source: No organisation or worked for a private individual
cy: Dim sefydliad neu’n gweithio i unigolyn preifat

# Do you supervise or oversee the work of other employees on a day-to-day basis?
source: Yes
cy: Ydw

# Do you supervise or oversee the work of other employees on a day-to-day basis?
source: No
cy: Nac ydw

source: Yes
cy: Ydy

source: No
cy: Nac ydy

# Did you supervise or oversee the work of other employees on a day-to-day basis?
source: Yes
cy: Oeddwn

# Did you supervise or oversee the work of other employees on a day-to-day basis?
source: No
cy: Nac oeddwn

source: Yes
cy: Oedd

source: No
cy: Nac oedd

# In your main job, how many hours a week do you usually work?
source: 0 to 15 hours
cy: 0 i 15 awr
