Repository: ONSdigital/eq-questionnaire-schemas
Catalog: translations/*/census_household_gb_wls_*.po
Languages: cy

source: Housemates, tenants or lodgers
cy: Tenantiaid, lojers neu bobl sy’n rhannu cartref

source: People who usually live outside the UK who are staying in the UK for 3 months or more
cy: Pobl sy'n byw y tu allan i'r Deyrnas Unedig fel arfer, ond sy'n aros yn y Deyrnas Unedig am 3 mis neu fwy

source: People temporarily away
cy: Pobl sydd i ffwrdd o’r cartref dros dro

source: People staying temporarily who usually live in the UK but do not have another UK address
cy: Pobl sy'n aros dros dro, sy'n byw yn y Deyrnas Unedig fel arfer, ond sydd heb gyfeiriad arall yn y Deyrnas Unedig

source: None of these apply, no-one usually lives here
cy: Dim un o’r rhain yn berthnasol, nid oes neb yn byw yma fel arfer

# Does anyone else live at {household_address}?
source: Yes, I need to add {ordinality} person
cy: Oes, mae angen i mi ychwanegu {ordinality} unigolyn

# Does anyone else live at {household_address}?
source: No, I do not need to add anyone
cy: Nac oes, nid oes angen i mi ychwanegu unrhyw un

# Are you sure you want to remove <em>{person_name}</em>?
source: Yes, I want to remove this person
cy: Ydw, rwyf am ddileu’r person hwn

# Are you sure you want to remove <em>{person_name}</em>?
source: No, I don‘t want to remove this person
cy: Nac ydw, nid wyf am ddileu’r person hwn

source: Yes, I need to add someone
cy: Oes, mae angen i mi ychwanegu rhywun arall

source: No, there is {cardinality} person living here
cy: Nac oes, {cardinality} unigolyn sy’n byw yma

source: People who usually live somewhere else in the UK, for example, boyfriends, girlfriends, friends or relatives
cy: Pobl sydd fel arfer yn byw yn rhywle arall yn y Deyrnas Unedig, er enghraifft, cariadon, ffrindiau, perthnasau

source: People staying here because it is their second address, for example, for work. Their permanent or family home is elsewhere
cy: Pobl sy’n aros yma gan mai dyma eu hail gyfeiriad, er enghraifft, oherwydd gwaith. Mae eu cyfeiriad parhaol neu gyfeiriad y teulu yn rhywle arall

source: People who usually live outside the UK who are staying in the UK for less than 3 months
cy: Pobl sy’n byw y tu allan i’r Deyrnas Unedig fel arfer, ac sy’n aros yn y Deyrnas Unedig am lai na 3 mis

source: People here on holiday
cy: Pobl sydd ar wyliau yma

source: There are no visitors staying overnight here on Sunday {census_date}
cy: Nid oes unrhyw ymwelwyr yn aros yma dros nos ddydd Sul {census_date}

source: Yes, I need to add {ordinality} visitor
cy: Oes, mae angen i mi ychwanegu {ordinality} ymwelydd

source: No, I do not need to add anyone
cy: Nac oes, nid oes angen i mi ychwanegu unrhyw un

# {second_person_name} is your <em>…</em>
source: Husband or wife
cy: Gŵr neu wraig

# {second_person_name} is your <em>…</em>
source: Legally registered civil partner
cy: Partner sifil cofrestredig cyfreithiol

# {second_person_name} is your <em>…</em>
source: Son or daughter
cy: Mab neu ferch

# {second_person_name} is your <em>…</em>
source: Stepchild
cy: Llysblentyn

# {second_person_name} is your <em>…</em>
source: Brother or sister
cy: Brawd neu chwaer

# {second_person_name} is your <em>…</em>
source: Stepbrother or stepsister
cy: Llysfrawd neu lyschwaer

# {second_person_name} is your <em>…</em>
source: Mother or father
cy: Mam neu dad

# {second_person_name} is your <em>…</em>
source: Stepmother or stepfather
cy: Llysfam neu lystad

# {second_person_name} is your <em>…</em>
source: Grandchild
cy: Ŵyr neu wyres

# {second_person_name} is your <em>…</em>
source: Grandparent
cy: Taid/tad-cu neu nain/mam-gu

# {second_person_name} is your <em>…</em>
source: Other relation
cy: Perthynas arall

# {second_person_name} is your <em>…</em>
source: Unrelated
cy: Ddim yn perthyn

# Thinking about {first_person_name}, {second_person_name} is their <em>…</em>
source: Husband or wife
cy: Gŵr neu wraig

# Thinking about {first_person_name}, {second_person_name} is their <em>…</em>
source: Legally registered civil partner
cy: Partner sifil cofrestredig cyfreithiol

# Thinking about {first_person_name}, {second_person_name} is their <em>…</em>
source: Son or daughter
cy: Mab neu ferch

# Thinking about {first_person_name}, {second_person_name} is their <em>…</em>
source: Stepchild
cy: Llysblentyn

# Thinking about {first_person_name}, {second_person_name} is their <em>…</em>
source: Brother or sister
cy: Brawd neu chwaer

# Thinking about {first_person_name}, {second_person_name} is their <em>…</em>
source: Stepbrother or stepsister
cy: Llysfrawd neu lyschwaer

# Thinking about {first_person_name}, {second_person_name} is their <em>…</em>
source: Mother or father
cy: Mam neu dad

# Thinking about {first_person_name}, {second_person_name} is their <em>…</em>
source: Stepmother or stepfather
cy: Llysfam neu lystad

# Thinking about {first_person_name}, {second_person_name} is their <em>…</em>
source: Grandchild
cy: Ŵyr neu wyres

# Thinking about {first_person_name}, {second_person_name} is their <em>…</em>
source: Grandparent
cy: Taid/tad-cu neu nain/mam-gu

# Thinking about {first_person_name}, {second_person_name} is their <em>…</em>
source: Other relation
cy: Perthynas arall

# Thinking about {first_person_name}, {second_person_name} is their <em>…</em>
source: Unrelated
cy: Ddim yn perthyn

# Are any of these people related to you?
source: Yes
cy: Oes

# Are any of these people related to you?
source: No, none of these people are related to me
cy: Nac oes, nid oes unrhyw un o’r bobl hyn yn perthyn i mi

# Are any of these people related to <em>{person_name}</em>?
source: Yes
cy: Oes

# Are any of these people related to <em>{person_name}</em>?
source: No, none of these people are related to {person_name}
cy: Nac oes, nid oes unrhyw un o’r bobl hyn yn perthyn i {person_name}

# What type of accommodation is <em>{household_address}</em>?
source: Whole house or bungalow
cy: Tŷ neu fyngalo cyfan

# What type of accommodation is <em>{household_address}</em>?
source: Flat, maisonette or apartment
cy: Fflat neu maisonette

# What type of accommodation is <em>{household_address}</em>?
source: Caravan or other mobile or temporary structure
cy: Carafán neu fath arall o gartref symudol neu dros dro

# Which of the following is your house or bungalow?
source: Detached
cy: Adeilad ar wahân

# Which of the following is your house or bungalow?
source: Semi-detached
cy: Tŷ neu fyngalo semi

# Which of the following is your house or bungalow?
source: Terraced
cy: Tŷ neu fyngalo mewn teras

# Where is your flat, maisonette or apartment?
source: In a purpose-built block of flats or tenement
cy: Mewn bloc o fflatiau neu denement a adeiladwyd yn bwrpasol

# Where is your flat, maisonette or apartment?
source: Part of a converted or shared house
cy: Yn rhan o dŷ wedi’i addasu neu dŷ sy’n cael ei rannu

# Where is your flat, maisonette or apartment?
source: Part of another converted building
cy: Rhan o adeilad arall wedi’i addasu

# Where is your flat, maisonette or apartment?
source: In a commercial building
cy: Mewn adeilad masnachol

source: Yes
cy: Ydy

source: No, one or more rooms are shared with another household
cy: Nac ydy, mae o leiaf un o'r ystafelloedd yn cael ei rhannu ag aelodau o gartref arall

# What type of central heating does <em>{household_address}</em> have?
source: No central heating
cy: Dim gwres canolog

# What type of central heating does <em>{household_address}</em> have?
source: Mains gas
cy: Prif gyflenwad nwy

# What type of central heating does <em>{household_address}</em> have?
source: Tank or bottled gas
cy: Nwy tanc neu botel

# What type of central heating does <em>{household_address}</em> have?
source: Electric
cy: Trydan

# What type of central heating does <em>{household_address}</em> have?
source: Oil
cy: Olew

# What type of central heating does <em>{household_address}</em> have?
source: Wood
cy: Coed

# What type of central heating does <em>{household_address}</em> have?
source: Solid fuel
cy: Tanwydd solet

# What type of central heating does <em>{household_address}</em> have?
source: Renewable energy
cy: Ynni adnewyddadwy

# What type of central heating does <em>{household_address}</em> have?
source: District or communal heat network
cy: Rhwydweithiau gwres rhanbarthol neu gymunedol

# What type of central heating does <em>{household_address}</em> have?
source: Other
cy: Arall

# Does your household own or rent <em>{household_address}</em>?
source: Owns outright
cy: Yn berchen arno’n gyfan gwbl

# Does your household own or rent <em>{household_address}</em>?
source: Owns with a mortgage or loan
cy: Yn berchen arno gyda morgais neu fenthyciad

# Does your household own or rent <em>{household_address}</em>?
source: Part-owns and part-rents
cy: Yn berchen arno’n rhannol ac yn ei rentu’n rhannol

# Does your household own or rent <em>{household_address}</em>?
source: Rents
cy: Yn ei rentu

# Does your household own or rent <em>{household_address}</em>?
source: Lives here rent-free
cy: Yn byw yma heb dalu rhent

# Who is your landlord?
source: Housing association, housing co-operative, charitable trust, registered social landlord
cy: Cymdeithas dai, cwmni tai cydweithredol, ymddiriedolaeth elusennol, landlord cymdeithasol cofrestredig

# Who is your landlord?
source: Council or local authority
cy: Y cyngor neu'r awdurdod lleol

# Who is your landlord?
source: Private landlord or letting agency
cy: Landlord preifat neu asiantaeth gosod tai

# Who is your landlord?
source: Employer of a household member
cy: Cyflogwr aelod o’r cartref

# Who is your landlord?
source: Relative or friend of a household member
cy: Perthynas neu ffrind i aelod o’r cartref

# Who is your landlord?
source: Other
cy: Arall

source: None
cy: Dim un

source: 5 or more
cy: 5 neu fwy

# Are you <em>{person_name}?</em>
source: Yes, I am
cy: Ie

# Are you <em>{person_name}?</em>
source: No, I am answering on their behalf
cy: Na, rwy’n ateb ar ran yr unigolyn hwn

# You are {age} old. Is this correct?
source: Yes, I am {age} old
cy: Ydy, rwy’n {age}

# You are {age} old. Is this correct?
source: No, I need to correct my date of birth
cy: Nac ydy, mae angen i mi gywiro fy nyddiad geni

# <em>{person_name}</em> is {age} old. Is this correct?
source: Yes, {person_name} is {age} old
cy: Ydy, mae {person_name} yn {age}

# <em>{person_name}</em> is {age} old. Is this correct?
source: No, I need to correct their date of birth
cy: Nac ydy, mae angen i mi gywiro dyddiad geni’r unigolyn hwn

# What is your sex?
source: Female
cy: Benyw

# What is your sex?
source: Male
cy: Gwryw

# What is <em>{person_name_possessive}</em> sex?
source: Female
cy: Benyw

# What is <em>{person_name_possessive}</em> sex?
source: Male
cy: Gwryw

source: Never married and never registered a civil partnership
cy: Erioed wedi priodi na chofrestru partneriaeth sifil

source: Married
cy: Priod

source: In a registered civil partnership
cy: Mewn partneriaeth sifil gofrestredig

source: Separated, but still legally married
cy: Wedi gwahanu, ond yn gyfreithiol yn dal i fod yn briod

source: Separated, but still legally in a civil partnership
cy: Wedi gwahanu, ond yn gyfreithiol yn dal i fod mewn partneriaeth sifil

source: Divorced
cy: Wedi ysgaru

source: Formerly in a civil partnership which is now legally dissolved
cy: Wedi bod mewn partneriaeth sifil sydd bellach wedi’i diddymu’n gyfreithiol

source: Widowed
cy: Person gweddw

source: Surviving partner from a registered civil partnership
cy: Wedi colli partner sifil cofrestredig drwy farwolaeth

source: Never married and never registered a civil partnership
cy: Erioed wedi priodi na chofrestru partneriaeth sifil

source: Married
cy: Priod

source: In a registered civil partnership
cy: Mewn partneriaeth sifil gofrestredig

source: Separated, but still legally married
cy: Wedi gwahanu, ond yn gyfreithiol yn dal i fod yn briod

source: Separated, but still legally in a civil partnership
cy: Wedi gwahanu, ond yn gyfreithiol yn dal i fod mewn partneriaeth sifil

source: Divorced
cy: Wedi ysgaru

source: Formerly in a civil partnership which is now legally dissolved
cy: Wedi bod mewn partneriaeth sifil sydd bellach wedi’i diddymu’n gyfreithiol

source: Widowed
cy: Person gweddw

source: Surviving partner from a registered civil partnership
cy: Wedi colli partner sifil cofrestredig drwy farwolaeth

# Who is your legal marriage to?
source: Someone of the opposite sex
cy: Person o’r rhyw arall

# Who is your legal marriage to?
source: Someone of the same sex
cy: Person o’r un rhyw

# Who is <em>{person_name_possessive}</em> legal marriage to?
source: Someone of the opposite sex
cy: Person o’r rhyw arall

# Who is <em>{person_name_possessive}</em> legal marriage to?
source: Someone of the same sex
cy: Person o’r un rhyw

# Who was your legal marriage to?
source: Someone of the opposite sex
cy: Person o’r rhyw arall

# Who was your legal marriage to?
source: Someone of the same sex
cy: Person o’r un rhyw

# Who was <em>{person_name_possessive}</em> legal marriage to?
source: Someone of the opposite sex
cy: Person o’r rhyw arall

# Who was <em>{person_name_possessive}</em> legal marriage to?
source: Someone of the same sex
cy: Person o’r un rhyw

# Who is your registered civil partnership to?
source: Someone of the opposite sex
cy: Person o’r rhyw arall

# Who is your registered civil partnership to?
source: Someone of the same sex
cy: Person o’r un rhyw

# Who is <em>{person_name_possessive}</em> registered civil partnership to?
source: Someone of the opposite sex
cy: Person o’r rhyw arall

# Who is <em>{person_name_possessive}</em> registered civil partnership to?
source: Someone of the same sex
cy: Person o’r un rhyw

# Who was your registered civil partnership to?
source: Someone of the opposite sex
cy: Person o’r rhyw arall

# Who was your registered civil partnership to?
source: Someone of the same sex
cy: Person o’r un rhyw

# Who was <em>{person_name_possessive}</em> registered civil partnership to?
source: Someone of the opposite sex
cy: Person o’r rhyw arall

# Who was <em>{person_name_possessive}</em> registered civil partnership to?
source: Someone of the same sex
cy: Person o’r un rhyw

# Do you stay at another address for more than 30 days a year?
source: No
cy: Nac ydw

# Do you stay at another address for more than 30 days a year?
source: Yes, an address within the UK
cy: Ydw, mewn cyfeiriad yn y Deyrnas Unedig

# Do you stay at another address for more than 30 days a year?
source: Yes, an address outside the UK
cy: Ydw, mewn cyfeiriad y tu allan i’r Deyrnas Unedig

source: No
cy: Nac ydy

source: Yes, an address within the UK
cy: Ydy, mewn cyfeiriad yn y Deyrnas Unedig

source: Yes, an address outside the UK
cy: Ydy, mewn cyfeiriad y tu allan i’r Deyrnas Unedig

# What type of address is <em>{household_address}</em>?
source: Armed forces base address
cy: Cyfeiriad un o ganolfannau’r lluoedd arfog

# What type of address is <em>{household_address}</em>?
source: Another address when working away from home
cy: Cyfeiriad arall wrth weithio i ffwrdd o’r cartref

# What type of address is <em>{household_address}</em>?
source: Student’s home address
cy: Cyfeiriad cartref myfyriwr

# What type of address is <em>{household_address}</em>?
source: Student’s term-time address
cy: Cyfeiriad myfyriwr yn ystod y tymor

# What type of address is <em>{household_address}</em>?
source: Another parent or guardian’s address
cy: Cyfeiriad rhiant neu warcheidwad arall

# What type of address is <em>{household_address}</em>?
source: Partner’s address
cy: Cyfeiriad partner

# What type of address is <em>{household_address}</em>?
source: Holiday home
cy: Cyfeiriad tŷ gwyliau

# What type of address is <em>{household_address}</em>?
source: Other
cy: Arall

# What type of address is your address in <em>{country}</em>?
source: Armed forces base address
cy: Cyfeiriad un o ganolfannau’r lluoedd arfog

# What type of address is your address in <em>{country}</em>?
source: Another address when working away from home
cy: Cyfeiriad arall wrth weithio i ffwrdd o’r cartref

# What type of address is your address in <em>{country}</em>?
source: Student’s home address
cy: Cyfeiriad cartref myfyriwr

# What type of address is your address in <em>{country}</em>?
source: Student’s term-time address
cy: Cyfeiriad myfyriwr yn ystod y tymor

# What type of address is your address in <em>{country}</em>?
source: Another parent or guardian’s address
cy: Cyfeiriad rhiant neu warcheidwad arall

# What type of address is your address in <em>{country}</em>?
source: Partner’s address
cy: Cyfeiriad partner

# What type of address is your address in <em>{country}</em>?
source: Holiday home
cy: Cyfeiriad tŷ gwyliau

# What type of address is your address in <em>{country}</em>?
source: Other
cy: Arall

# What type of address is <em>{person_name_possessive}</em> address in {country}?
source: Armed forces base address
cy: Cyfeiriad un o ganolfannau’r lluoedd arfog

# What type of address is <em>{person_name_possessive}</em> address in {country}?
source: Another address when working away from home
cy: Cyfeiriad arall wrth weithio i ffwrdd o’r cartref

# What type of address is <em>{person_name_possessive}</em> address in {country}?
source: Student’s home address
cy: Cyfeiriad cartref myfyriwr

# What type of address is <em>{person_name_possessive}</em> address in {country}?
source: Student’s term-time address
cy: Cyfeiriad myfyriwr yn ystod y tymor

# What type of address is <em>{person_name_possessive}</em> address in {country}?
source: Another parent or guardian’s address
cy: Cyfeiriad rhiant neu warcheidwad arall

# What type of address is <em>{person_name_possessive}</em> address in {country}?
source: Partner’s address
cy: Cyfeiriad partner

# What type of address is <em>{person_name_possessive}</em> address in {country}?
source: Holiday home
cy: Cyfeiriad tŷ gwyliau

# What type of address is <em>{person_name_possessive}</em> address in {country}?
source: Other
cy: Arall

# Are you a student in full-time education?
source: Yes
cy: Ydw

# Are you a student in full-time education?
source: No
cy: Nac ydw

# Is <em>{person_name}</em> a student in full-time education?
source: Yes
cy: Ydy

# Is <em>{person_name}</em> a student in full-time education?
source: No
cy: Nac ydy

# Are you a schoolchild or student in full-time education?
source: Yes
cy: Ydw

# Are you a schoolchild or student in full-time education?
source: No
cy: Nac ydw

# Is <em>{person_name}</em> a schoolchild or student in full-time education?
source: Yes
cy: Ydy

# Is <em>{person_name}</em> a schoolchild or student in full-time education?
source: No
cy: Nac ydy

# During term time, where do you usually live?
source: The address in {thirty_day_address_country}
cy: Y cyfeiriad yn {thirty_day_address_country}

# During term time, where do you usually live?
source: Another address
cy: Cyfeiriad arall

# During term time, where does <em>{person_name}</em> usually live?
source: The address in {thirty_day_address_country}
cy: Y cyfeiriad yn {thirty_day_address_country}

# During term time, where does <em>{person_name}</em> usually live?
source: Another address
cy: Cyfeiriad arall

# Is this address in the UK?
source: Yes
cy: Ydy

# Is this address in the UK?
source: No
cy: Nac ydy

# What is your country of birth?
source: Wales
cy: Cymru

# What is your country of birth?
source: England
cy: Lloegr

# What is your country of birth?
source: Scotland
cy: Yr Alban

# What is your country of birth?
source: Northern Ireland
cy: Gogledd Iwerddon

# What is your country of birth?
source: Republic of Ireland
cy: Gweriniaeth Iwerddon

# What is your country of birth?
source: Elsewhere
cy: Rhywle arall

# What is <em>{person_name_possessive}</em> country of birth?
source: Wales
cy: Cymru

# What is <em>{person_name_possessive}</em> country of birth?
source: England
cy: Lloegr

# What is <em>{person_name_possessive}</em> country of birth?
source: Scotland
cy: Yr Alban

# What is <em>{person_name_possessive}</em> country of birth?
source: Northern Ireland
cy: Gogledd Iwerddon

# What is <em>{person_name_possessive}</em> country of birth?
source: Republic of Ireland
cy: Gweriniaeth Iwerddon

# What is <em>{person_name_possessive}</em> country of birth?
source: Elsewhere
cy: Rhywle arall

# Did you arrive in the UK on or after {year_before_census_date}?
source: Yes
cy: Do

# Did you arrive in the UK on or after {year_before_census_date}?
source: No
cy: Naddo

source: Yes
cy: Do

source: No
cy: Naddo

source: Less than 12 months
cy: Llai na 12 mis

source: 12 months or more
cy: 12 mis neu fwy

source: Less than 12 months
cy: Llai na 12 mis

source: 12 months or more
cy: 12 mis neu fwy

# One year ago, what was your usual address?
source: Student term-time or boarding school address in the UK
cy: Cyfeiriad myfyriwr yn ystod y tymor neu gyfeiriad ysgol breswyl yn y Deyrnas Unedig

# One year ago, what was your usual address?
source: Another address in the UK
cy: Cyfeiriad arall yn y Deyrnas Unedig

# One year ago, what was your usual address?
source: Another address outside the UK
cy: Cyfeiriad y tu allan i’r Deyrnas Unedig

# One year ago, what was your usual address?
source: Same as {first_person_possessive} address one year ago
cy: Yr un peth â chyfeiriad {first_person_possessive} flwyddyn yn ôl

# One year ago, what was <em>{person_name_possessive}</em> usual address?
source: Student term-time or boarding school address in the UK
cy: Cyfeiriad myfyriwr yn ystod y tymor neu gyfeiriad ysgol breswyl yn y Deyrnas Unedig

# One year ago, what was <em>{person_name_possessive}</em> usual address?
source: Another address in the UK
cy: Cyfeiriad arall yn y Deyrnas Unedig

# One year ago, what was <em>{person_name_possessive}</em> usual address?
source: Another address outside the UK
cy: Cyfeiriad y tu allan i’r Deyrnas Unedig

# One year ago, what was <em>{person_name_possessive}</em> usual address?
source: Same as {first_person_possessive} address one year ago
cy: Yr un peth â chyfeiriad {first_person_possessive} flwyddyn yn ôl

# How would you describe your national identity?
source: Welsh
cy: Cymro/Cymraes

# How would you describe your national identity?
source: English
cy: Sais/Saesnes

# How would you describe your national identity?
source: Scottish
cy: Albanwr/Albanes

# How would you describe your national identity?
source: Northern Irish
cy: Gwyddel/Gwyddeles o Ogledd Iwerddon

# How would you describe your national identity?
source: British
cy: Prydeiniwr/Prydeinwraig

# How would you describe your national identity?
source: Other
cy: Arall

# How would <em>{person_name}</em> describe their national identity?
source: Welsh
cy: Cymro/Cymraes

# How would <em>{person_name}</em> describe their national identity?
source: English
cy: Sais/Saesnes

# How would <em>{person_name}</em> describe their national identity?
source: Scottish
cy: Albanwr/Albanes

# How would <em>{person_name}</em> describe their national identity?
source: Northern Irish
cy: Gwyddel/Gwyddeles o Ogledd Iwerddon

# How would <em>{person_name}</em> describe their national identity?
source: British
cy: Prydeiniwr/Prydeinwraig

# How would <em>{person_name}</em> describe their national identity?
source: Other
cy: Arall

# What is your ethnic group?
source: White
cy: Gwyn

# What is your ethnic group?
source: Mixed or Multiple ethnic groups
cy: Grwpiau Cymysg neu Amlethnig

# What is your ethnic group?
source: Asian, Asian Welsh or Asian British
cy: Asiaidd, Asiaidd Cymreig neu Asiaidd Prydeinig

# What is your ethnic group?
source: Black, Black Welsh, Black British, Caribbean or African
cy: Du, Du Cymreig, Du Prydeinig, Caribïaidd neu Affricanaidd

# What is your ethnic group?
source: Other ethnic group
cy: Grŵp ethnig arall

# What is <em>{person_name_possessive}</em> ethnic group?
source: White
cy: Gwyn
