Repository: ONSdigital/eq-questionnaire-schemas
Catalog: translations/*/census_household_gb_nir_*.po
Languages: ga

# What type of accommodation is <em>{household_address}</em>?
source: Including purpose-built flats and flats within converted and shared houses
ga: Árasáin shaintógtha agus árasáin taobh istigh de thithe athchóirithe agus comhroinnte san áireamh

# Which of the following is your house or bungalow?
source: Including end-terrace
ga: Teach sraithe deiridh san áireamh

# Where is your flat, maisonette or apartment?
source: Including bedsits
ga: Mionárasáin san áireamh

# Where is your flat, maisonette or apartment?
source: For example, in an office building, hotel, or over a shop
ga: Mar shampla, i bhfoirgneamh oifige, in óstán, nó thar siopa

source: For example a downstairs bathroom
ga: Mar shampla, seomra folctha thíos staighre

source: For example a ramp
ga: Mar shampla, rampa

# What type of central heating does <em>{household_address}</em> have?
source: For example storage heaters
ga: Mar shampla, taiscthéitheoirí

# What type of central heating does <em>{household_address}</em> have?
source: For example logs or waste wood
ga: Mar shampla, lomáin nó dramhadhmad

# What type of central heating does <em>{household_address}</em> have?
source: For example coal
ga: Mar shampla, gual

# Does your household own or rent <em>{household_address}</em>?
source: Shared ownership
ga: Comhúinéireacht

# Does your household own or rent <em>{household_address}</em>?
source: With or without housing benefit
ga: Le nó gan liúntas tithíochta

# What is your country of birth?
source: You can enter your country of birth on the next question
ga: Is féidir an tír inar rugadh thú a iontráil sa chéad cheist eile

# What is <em>{person_name_possessive}</em> country of birth?
source: You can enter their country of birth on the next question
ga: Is féidir an tír inar rugadh iad a iontráil sa chéad cheist eile

# What passports do you hold?
source: You can enter your passports on the next question
ga: Is féidir do phasanna a iontráil sa chéad cheist eile

# What passports does <em>{person_name}</em> hold?
source: You can enter their passports on the next question
ga: Is féidir a bpasanna a iontráil sa chéad cheist eile

# How would you describe your national identity?
source: You can enter your national identity on the next question
ga: Is féidir d'fhéiniúlacht náisiúnta a iontráil sa chéad cheist eile

# How would <em>{person_name}</em> describe their national identity?
source: You can enter their national identity on the next question
ga: Is féidir a bhféiniúlacht náisiúnta a iontráil sa chéad cheist eile

# What is your ethnic group?
source: You can enter your ethnic group on the next question
ga: Is féidir do ghrúpa eitneach a iontráil sa chéad cheist eile

# What is <em>{person_name_possessive}</em> ethnic group?
source: You can enter their ethnic group on the next question
ga: Is féidir a ngrúpa eitneach a iontráil sa chéad cheist eile

# What religion, religious denomination or body do you belong to?
source: You can enter your religion on the next question
ga: Is féidir do reiligiún a iontráil sa chéad cheist eile

source: You can enter their religion on the next question
ga: Is féidir a reiligiún a iontráil sa chéad cheist eile

# What religion, religious denomination or body were you <em>brought up</em> in?
source: You can enter the religion on the next question
ga: Is féidir an reiligiún a iontráil sa chéad cheist eile

source: You can enter the religion on the next question
ga: Is féidir an reiligiún a iontráil sa chéad cheist eile

# What is your main language?
source: You can enter your main language on the next question
ga: Is féidir do phríomhtheanga a iontráil sa chéad cheist eile

# What is <em>{person_name_possessive}</em> main language?
source: You can enter your main language on the next question
ga: Is féidir do phríomhtheanga a iontráil sa chéad cheist eile

source: For example walking or dressing
ga: Mar shampla ag siúl nó ag gléasadh

source: For example Asthma
ga: Mar shampla Asma

source: For example walking or dressing
ga: Mar shampla ag siúl nó ag gléasadh

source: For example Asthma
ga: Mar shampla Asma

source: For example Down syndrome
ga: Mar shampla, siondróm Down

source: For example dyslexia
ga: Mar shampla disléicse

source: For example depression or schizophrenia
ga: Mar shampla, dúlagar nó scitsifréine

source: For example dementia
ga: Mar shampla néaltrú

source: For example cancer, diabetes or heart disease
ga: Mar shampla, ailse, diaibéiteas nó galar croí

source: For example Down syndrome
ga: Mar shampla, siondróm Down

source: For example dyslexia
ga: Mar shampla disléicse

source: For example depression or schizophrenia
ga: Mar shampla, dúlagar nó scitsifréine

source: For example dementia
ga: Mar shampla néaltrú

source: For example cancer, diabetes or heart disease
ga: Mar shampla, ailse, diaibéiteas nó galar croí

# Have you achieved a qualification at degree level or above?
source: For example degree, foundation degree, HND or HNC, NVQ level 4 and above, teaching or nursing
ga: Mar shampla céim, bonnchéim, HND, nó HNC, NVQ leibhéal 4 nó níos airde, céim mhúinteoireachta nó bhanaltrachta

# Have you achieved a qualification at degree level or above?
source: Questions on GCSEs, A levels, other NVQs and equivalents will follow
ga: Leanfaidh ceisteanna ar GCSEanna, Ardleibhéil, NVQanna eile agus a gcomhionann

# Has <em>{person_name}</em> achieved a qualification at degree level or above?
source: For example degree, foundation degree, HND or HNC, NVQ level 4 and above, teaching or nursing
ga: Mar shampla céim, bonnchéim, HND, nó HNC, NVQ leibhéal 4 nó níos airde, céim mhúinteoireachta nó bhanaltrachta

# Has <em>{person_name}</em> achieved a qualification at degree level or above?
source: Questions on GCSEs, A levels, other NVQs and equivalents will follow
ga: Leanfaidh ceisteanna ar GCSEanna, Ardleibhéil, NVQanna eile agus a gcomhionann

# Have you achieved a GCSE or equivalent qualification?
source: Include 5 or more O level passes or CSEs grade 1
ga: Cuir isteach 5 nó níos mó pasanna O leibhéil nó CSEanna gráid 1

# Have you achieved a GCSE or equivalent qualification?
source: Include any other O levels or CSEs at any grades
ga: Cuir isteach O leibhéil ar bith eile no CSEanna ag grád ar bith

# Have you achieved a GCSE or equivalent qualification?
source: Questions on A levels, NVQs and equivalents will follow
ga: Leanfaidh ceisteanna ar Ardleibhéil, NVQanna eile agus a gcomhionann

# Has <em>{person_name}</em> achieved a GCSE or equivalent qualification?
source: Include 5 or more O level passes or CSEs grade 1
ga: Cuir isteach 5 nó níos mó pasanna O leibhéil nó CSEanna gráid 1

# Has <em>{person_name}</em> achieved a GCSE or equivalent qualification?
source: Include any other O levels or CSEs at any grades
ga: Cuir isteach O leibhéil ar bith eile no CSEanna ag grád ar bith

# Has <em>{person_name}</em> achieved a GCSE or equivalent qualification?
source: Questions on A levels, NVQs and equivalents will follow
ga: Leanfaidh ceisteanna ar Ardleibhéil, NVQanna eile agus a gcomhionann

# Have you achieved an A level, AS level or equivalent qualifications?
source: Include 4 or more AS levels
ga: Cuir isteach 4 nó níos mó leibhéil AS

# Have you achieved an A level, AS level or equivalent qualifications?
source: Include 2 or 3 AS levels
ga: Cuir isteach 2 go 3 leibhéil AS

# Have you achieved an A level, AS level or equivalent qualifications?
source: Questions on NVQs and equivalents will follow
ga: Leanfaidh ceisteanna ar NVQanna eile agus a gcomhionann

source: Include 4 or more AS levels
ga: Cuir isteach 4 nó níos mó leibhéil AS

source: Include 2 or 3 AS levels
ga: Cuir isteach 2 go 3 leibhéil AS

source: Questions on NVQs and equivalents will follow
ga: Leanfaidh ceisteanna ar NVQanna eile agus a gcomhionann

# Have you achieved an NVQ or equivalent qualification?
source: For example BTEC National, OND or ONC, City and Guilds Advanced Craft
ga: Mar shampla BTEC Náisiúnta, OND nó ONC, Ardcheardaíocht City and Guilds

# Have you achieved an NVQ or equivalent qualification?
source: For example BTEC General, City and Guilds Craft
ga: Mar shampla BTEC Ginearálta agus Ceardaíocht City and Guilds

# Has <em>{person_name}</em> achieved an NVQ or equivalent qualification?
source: For example BTEC National, OND or ONC, City and Guilds Advanced Craft
ga: Mar shampla BTEC Náisiúnta, OND nó ONC, Ardcheardaíocht City and Guilds

# Has <em>{person_name}</em> achieved an NVQ or equivalent qualification?
source: For example BTEC General, City and Guilds Craft
ga: Mar shampla BTEC Ginearálta agus Ceardaíocht City and Guilds

# Have you completed an apprenticeship?
source: For example, trade, advanced, foundation or modern apprenticeships
ga: Mar shampla, trádáil, ardphrintíseachtaí, bunphrintíseachtaí, nó printíseachtaí nua-aimseartha

# Has <em>{person_name}</em> completed an apprenticeship?
source: For example, trade, advanced, foundation or modern apprenticeships
ga: Mar shampla, trádáil, ardphrintíseachtaí, bunphrintíseachtaí, nó printíseachtaí nua-aimseartha

# Which of the following describes what you were doing in the last seven days?
source: Whether receiving a pension or not
ga: Cé acu atá tú nó nach bhfuil tú ag fáil pinsin

source: Whether receiving a pension or not
ga: Cé acu atá tú nó nach bhfuil tú ag fáil pinsin

# How do you usually travel to your main place of <em>work</em>?
source: This could be public or private
ga: D’fhéadfadh sé seo a bheith poiblí nó príobháideach

source: This could be public or private
ga: D’fhéadfadh sé seo a bheith poiblí nó príobháideach

# How did you usually travel to your main place of <em>work</em>?
source: This could be public or private
ga: D’fhéadfadh sé seo a bheith poiblí nó príobháideach

source: This could be public or private
ga: D’fhéadfadh sé seo a bheith poiblí nó príobháideach

source: This could be public or private
ga: D’fhéadfadh sé seo a bheith poiblí nó príobháideach

source: This could be public or private
ga: D’fhéadfadh sé seo a bheith poiblí nó príobháideach

# What is <em>{person_name_possessive}</em> usual address?
source: You can enter their country on the next question
ga: Is féidir a dtír a iontráil sa chéad cheist eile

source: Enter adaptation
ga: Cuir isteach an t-oiriúnú

# What type of renewable energy systems does <em>{household_address}</em> have?
source: Enter renewable energy system
ga: Cuir isteach an córas fuinnimh in-athnuaite

source: Enter the number of cars or vans
ga: Cuir isteach an líon gluaisteán nó veaineanna

# What is your ethnic group?
source: Enter mixed ethnic group
ga: Iontráil grúpa eitneach measctha

# What is <em>{person_name_possessive}</em> ethnic group?
source: Enter mixed ethnic group
ga: Iontráil grúpa eitneach measctha

# Which of the following best describes your sexual orientation?
source: Enter sexual orientation
ga: Iontráil claonadh gnéis

source: Enter sexual orientation
ga: Iontráil claonadh gnéis

# {second_person_name} is your <em>…</em>
source: {second_person_name} is your <em>husband or wife</em>
ga: Is é/í {second_person_name} d' <em>fhear céile nó do bhean chéile</em> é/í

# {second_person_name} is your <em>…</em>
source: {second_person_name} is your <em>civil partner</em>
ga: Is é/í {second_person_name} do <em>pháirtnéir sibhialta</em> é/í

# {second_person_name} is your <em>…</em>
source: {second_person_name} is your <em>partner</em>
ga: Is é/í {second_person_name} do <em>pháirtnéir</em> é/í

# {second_person_name} is your <em>…</em>
source: {second_person_name} is your <em>son or daughter</em>
ga: Is é/í {second_person_name} do <em>mhac nó d'iníon</em> é/í

# {second_person_name} is your <em>…</em>
source: {second_person_name} is your <em>step-child</em>
ga: Is é/í {second_person_name} do <em>leaspháiste</em> é/í

# {second_person_name} is your <em>…</em>
source: {second_person_name} is your <em>brother or sister</em>
ga: Is é/í {second_person_name} do <em>dheartháir nó do dheirfiúr</em> é/í

# {second_person_name} is your <em>…</em>
source: {second_person_name} is your <em>step-brother or step-sister</em>
ga: Is é/í {second_person_name} do <em>leasdheartháir nó do leasdheirfiúr</em> é/í

# {second_person_name} is your <em>…</em>
source: {second_person_name} is your <em>mother or father</em>
ga: Is é/í {second_person_name} do <em>mháthair nó d'athair</em> é/í

# {second_person_name} is your <em>…</em>
source: {second_person_name} is your <em>step-mother or step-father</em>
ga: Is é/í {second_person_name} do <em>leasmháthair nó do leasathair</em> é/í

# {second_person_name} is your <em>…</em>
source: {second_person_name} is your <em>grandchild</em>
ga: Is é/í {second_person_name} do <em>gharpháiste</em> é/í

# {second_person_name} is your <em>…</em>
source: {second_person_name} is your <em>grandparent</em>
ga: Is é/í {second_person_name} do <em>sheantuismitheoir</em> é/í

# {second_person_name} is your <em>…</em>
source: {second_person_name} is your <em>other relation</em>
ga: Is é/í {second_person_name} do <em>ghaol eile</em> é/í

# {second_person_name} is your <em>…</em>
source: {second_person_name} is <em>unrelated</em> to you
ga: Tá {second_person_name} <em>neamhghaolta</em> leat

# Thinking about {first_person_name}, {second_person_name} is their <em>…</em>
source: Thinking about {first_person_name}, {second_person_name} is their <em>husband or wife</em>
ga: Ag smaoineamh ar {first_person_name}, is é/í {second_person_name} a <em>bhfear céile nó a mbean chéile</em> é/í

# Thinking about {first_person_name}, {second_person_name} is their <em>…</em>
source: Thinking about {first_person_name}, {second_person_name} is their <em>civil partner</em>
ga: Ag smaoineamh ar {first_person_name}, is é/í {second_person_name} a <em>bpáirtnéir sibhialta</em> é/í

# Thinking about {first_person_name}, {second_person_name} is their <em>…</em>
source: Thinking about {first_person_name}, {second_person_name} is their <em>partner</em>
ga: Ag smaoineamh ar {first_person_name}, is é/í {second_person_name} <em>a bpáirtnéir</em> é/í

# Thinking about {first_person_name}, {second_person_name} is their <em>…</em>
source: Thinking about {first_person_name}, {second_person_name} is their <em>son or daughter</em>
ga: Ag smaoineamh ar {first_person_name}, is é/í {second_person_name}, a <em>mac nó a n-iníon</em> é/í

# Thinking about {first_person_name}, {second_person_name} is their <em>…</em>
source: Thinking about {first_person_name}, {second_person_name} is their <em>step-child</em>
ga: Ag smaoineamh ar {first_person_name}, is é/í {second_person_name}, a <em>leaspháiste</em> é/í

# Thinking about {first_person_name}, {second_person_name} is their <em>…</em>
source: Thinking about {first_person_name}, {second_person_name} is their <em>brother or sister</em>
ga: Ag smaoineamh ar {first_person_name}, is é/í {second_person_name}, a <em>ndeartháir nó a ndeirfiúr</em> é/í

# Thinking about {first_person_name}, {second_person_name} is their <em>…</em>
source: Thinking about {first_person_name}, {second_person_name} is their <em>step-brother or step-sister</em>
ga: Ag smaoineamh ar {first_person_name}, is é/í {second_person_name}, a <em>leasdheartháir nó a leasdheirfiúr</em> é/í

# Thinking about {first_person_name}, {second_person_name} is their <em>…</em>
source: Thinking about {first_person_name}, {second_person_name} is their <em>mother or father</em>
ga: Ag smaoineamh ar {first_person_name}, is é/í {second_person_name}, a <em>máthair nó a n-athair</em> é/í

# Thinking about {first_person_name}, {second_person_name} is their <em>…</em>
source: Thinking about {first_person_name}, {second_person_name} is their <em>step-mother or step-father</em>
ga: Ag smaoineamh ar {first_person_name}, is é/í {second_person_name}, a <em>leasdheartháir nó a leasdheirfiúr</em> é/í

# Thinking about {first_person_name}, {second_person_name} is their <em>…</em>
source: Thinking about {first_person_name}, {second_person_name} is their <em>grandchild</em>
ga: Ag smaoineamh ar {first_person_name}, is é/í {second_person_name}, a <em>ngarpháiste</em> é/í

# Thinking about {first_person_name}, {second_person_name} is their <em>…</em>
source: Thinking about {first_person_name}, {second_person_name} is their <em>grandparent</em>
ga: Ag smaoineamh ar {first_person_name}, is é/í {second_person_name}, a <em>seantuismitheoir</em> é/í

# Thinking about {first_person_name}, {second_person_name} is their <em>…</em>
source: Thinking about {first_person_name}, {second_person_name} is their <em>other relation</em>
ga: Ag smaoineamh ar {first_person_name}, is é/í {second_person_name}, a <em>ngaol eile</em> é/í

# Thinking about {first_person_name}, {second_person_name} is their <em>…</em>
source: Thinking about {first_person_name}, {second_person_name} is <em>unrelated</em> to {first_person_name}
ga: Ag smaoineamh ar {first_person_name}, tá {second_person_name} <em>neamhghaolta</em> le {first_person_name}

# Thinking about {first_person_name}, {second_person_name} is their <em>…</em>
source: {second_person_name} is {first_person_name_possessive} <em>husband or wife</em>
ga: Is é/í {second_person_name} fear céile nó bean chéile {first_person_name_possessive} <em>é/í</em>

# Thinking about {first_person_name}, {second_person_name} is their <em>…</em>
source: {second_person_name} is {first_person_name_possessive} <em>civil partner</em>
ga: Is é/í {second_person_name} <em>páirtnéir sibhialta</em> {first_person_name_possessive} é/í

# Thinking about {first_person_name}, {second_person_name} is their <em>…</em>
source: {second_person_name} is {first_person_name_possessive} <em>partner</em>
ga: Is é/í {second_person_name} <em>páirtnéir</em> {first_person_name_possessive} é/í

# Thinking about {first_person_name}, {second_person_name} is their <em>…</em>
source: {second_person_name} is {first_person_name_possessive} <em>son or daughter</em>
ga: Ag smaoineamh ar {second_person_name}, is é/í {first_person_name_possessive} <em>mac nó iníon</em> é/í

# Thinking about {first_person_name}, {second_person_name} is their <em>…</em>
source: {second_person_name} is {first_person_name_possessive} <em>step-child</em>
ga: Is é/í {second_person_name} <em>leaspháiste</em> {first_person_name_possessive} é/í

# Thinking about {first_person_name}, {second_person_name} is their <em>…</em>
source: {second_person_name} is {first_person_name_possessive} <em>brother or sister</em>
ga: Is é/í {second_person_name} <em>deartháir nó deirfiúr</em> {first_person_name_possessive} é/í

# Thinking about {first_person_name}, {second_person_name} is their <em>…</em>
source: {second_person_name} is {first_person_name_possessive} <em>step-brother or step-sister</em>
ga: Is é/í {second_person_name} <em>leasdheartháir nó leasdheirfiúr</em> {first_person_name_possessive} é/í

# Thinking about {first_person_name}, {second_person_name} is their <em>…</em>
source: {second_person_name} is {first_person_name_possessive} <em>mother or father</em>
ga: Is é/í {second_person_name} <em>máthair nó athair</em> {first_person_name_possessive} é/í

# Thinking about {first_person_name}, {second_person_name} is their <em>…</em>
source: {second_person_name} is {first_person_name_possessive} <em>step-mother or step-father</em>
ga: Is é/í {second_person_name} <em>leasmháthair nó leasathair</em> {first_person_name_possessive} é/í

# Thinking about {first_person_name}, {second_person_name} is their <em>…</em>
source: {second_person_name} is {first_person_name_possessive} <em>grandchild</em>
ga: Is é/í {second_person_name} <em>garpháiste</em> {first_person_name_possessive} é/í

# Thinking about {first_person_name}, {second_person_name} is their <em>…</em>
source: {second_person_name} is {first_person_name_possessive} <em>grandparent</em>
ga: Is é/í {second_person_name} <em>seantuismitheoir</em> {first_person_name_possessive} é/í

# Thinking about {first_person_name}, {second_person_name} is their <em>…</em>
source: {second_person_name} is {first_person_name_possessive} <em>other relation</em>
ga: Is é/í {second_person_name} <em>gaol eile</em> {first_person_name_possessive} é/í

# Thinking about {first_person_name}, {second_person_name} is their <em>…</em>
source: {second_person_name} is <em>unrelated</em> to {first_person_name}
ga: Tá {second_person_name} <em>neamhghaolta</em> le {first_person_name}

source: Why we ask this question
ga: Cén fáth a gcuireann muid an cheist seo

source: Why we ask about visitors
ga: An fáth a gcuirimid ceist faoi chuairteoirí

source: Why we ask about visitors
ga: An fáth a gcuirimid ceist faoi chuairteoirí

# In the last four weeks, were you actively looking for any kind of paid work?
source: Why we ask this question if you are retired or long-term sick or disabled
ga: An fáth a gcuirimid an cheist seo má tá tú ar scor nó tinn nó míchumasach go fadtéarmach

source: Why we ask this question if they are retired or long-term sick or disabled
ga: An fáth a gcuirimid an cheist seo má tá siad ar scor nó tinn nó faoi mhíchumas go fadtéarmach

# In the last seven days, were you waiting to start a job already accepted?
source: Why we ask this question if you are retired or long-term sick or disabled
ga: An fáth a gcuirimid an cheist seo má tá tú ar scor nó tinn nó faoi mhíchumas go fadtéarmach

source: Why we ask this question if they are retired or long-term sick or disabled
ga: An fáth a gcuirimid an cheist seo má tá siad ar scor nó tinn nó míchumasach go fadtéarmach

# What is <em>{person_name_possessive}</em> date of birth?
source: Why we ask for visitor details
ga: An fáth a n-iarraimid mionsonraí cuairteoirí

# What is <em>{person_name_possessive}</em> sex?
source: Why we ask for visitor details
ga: An fáth a n-iarraimid mionsonraí cuairteoirí

# What is <em>{person_name_possessive}</em> usual address?
source: Why we ask for visitor details
ga: An fáth a n-iarraimid mionsonraí cuairteoirí

source: We ask this question to help ensure that everyone is correctly counted in the census. This includes people who are staying temporarily or are away.
ga: Cuireann muid an cheist seo chun cinntiú go n-áirítear gach duine i gceart sa daonáireamh. San áireamh tá daoine atá ag fanacht go sealadach nó atá ar shiúl.

source: The information is vital for planning services, whether it is for hospital beds, school places, GP and dental services or where to build houses and roads.
ga: Tá an t-eolas seo ríthábhachtach ó thaobh pleanáil seirbhísí de, bíodh leapacha ospidéil i gceist nó áiteanna ar scoileanna, seirbhísí dochtúra nó fiaclóra nó cá háit a bhfuil tithe nó bóithre le tógáil.

source: This is to ensure that everyone is counted in the census. Add any visitors, even if they have been included on a census questionnaire at another address.
ga: Tá sé seo ann lena chínntiú go n-áirítear gach duine sa daonáireamh. Cuir isteach cuairteoirí ar bith, fiú má áirítear iad ar cheistneoir daonáirimh ag seoladh eile.

source: This is to ensure that everyone is counted in the census. Add any visitors, even if they have been included on a census questionnaire at another address.
ga: Tá sé seo ann lena chínntiú go n-áirítear gach duine sa daonáireamh. Cuir isteach cuairteoirí ar bith, fiú má áirítear iad ar cheistneoir daonáirimh ag seoladh eile.
