Repository: ONSdigital/eq-questionnaire-schemas
Catalog: translations/*/census_household_gb_wls_*.po
Languages: cy

# Thinking about {first_person_name}, {second_person_name} is their <em>…</em>
source: Thinking about {first_person_name}, {second_person_name} is their <em>husband or wife</em>
cy: Gan feddwl am {first_person_name}, mae {second_person_name} yn <em>ŵr neu wraig</em> i {first_person_name}

# Thinking about {first_person_name}, {second_person_name} is their <em>…</em>
source: Thinking about {first_person_name}, {second_person_name} is their <em>legally registered civil partner</em>
cy: Gan feddwl am {first_person_name}, mae {second_person_name} yn <em>bartner sifil cofrestredig cyfreithiol</em> i {first_person_name}

# Thinking about {first_person_name}, {second_person_name} is their <em>…</em>
source: Thinking about {first_person_name}, {second_person_name} is their <em>partner</em>
cy: Gan feddwl am {first_person_name}, mae {second_person_name} yn <em>bartner</em> i {first_person_name}

# Thinking about {first_person_name}, {second_person_name} is their <em>…</em>
source: Thinking about {first_person_name}, {second_person_name} is their <em>son or daughter</em>
cy: Gan feddwl am {first_person_name}, mae {second_person_name} yn <em>fab neu ferch</em> i {first_person_name}

# Thinking about {first_person_name}, {second_person_name} is their <em>…</em>
source: Thinking about {first_person_name}, {second_person_name} is their <em>stepchild</em>
cy: Gan feddwl am {first_person_name}, mae {second_person_name} yn <em>llysblentyn</em> i {first_person_name}

# Thinking about {first_person_name}, {second_person_name} is their <em>…</em>
source: Thinking about {first_person_name}, {second_person_name} is their <em>brother or sister</em>
cy: Gan feddwl am {first_person_name}, mae {second_person_name} yn <em>frawd neu chwaer</em> i {first_person_name}

# Thinking about {first_person_name}, {second_person_name} is their <em>…</em>
source: Thinking about {first_person_name}, {second_person_name} is their <em>stepbrother or stepsister</em>
cy: Gan feddwl am {first_person_name}, mae {second_person_name} yn <em>llysfrawd neu lyschwaer</em> i {first_person_name}

# Thinking about {first_person_name}, {second_person_name} is their <em>…</em>
source: Thinking about {first_person_name}, {second_person_name} is their <em>mother or father</em>
cy: Gan feddwl am {first_person_name}, mae {second_person_name} yn <em>fam neu dad</em> i {first_person_name}

# Thinking about {first_person_name}, {second_person_name} is their <em>…</em>
source: Thinking about {first_person_name}, {second_person_name} is their <em>stepmother or stepfather</em>
cy: Gan feddwl am {first_person_name}, mae {second_person_name} yn <em>llysfam neu lystad</em> i {first_person_name}

# Thinking about {first_person_name}, {second_person_name} is their <em>…</em>
source: Thinking about {first_person_name}, {second_person_name} is their <em>grandchild</em>
cy: Gan feddwl am {first_person_name}, mae {second_person_name} yn <em>ŵyr neu wyres</em> i {first_person_name}

# Thinking about {first_person_name}, {second_person_name} is their <em>…</em>
source: Thinking about {first_person_name}, {second_person_name} is their <em>grandparent</em>
cy: Gan feddwl am {first_person_name}, mae {second_person_name} yn <em>daid/tad-cu neu nain/mam-gu</em> i {first_person_name}

# Thinking about {first_person_name}, {second_person_name} is their <em>…</em>
source: Thinking about {first_person_name}, {second_person_name} is their <em>other relation</em>
cy: Gan feddwl am {first_person_name}, mae {second_person_name} yn <em>berthynas arall</em> i {first_person_name}

# Thinking about {first_person_name}, {second_person_name} is their <em>…</em>
source: Thinking about {first_person_name}, {second_person_name} is <em>unrelated</em> to {first_person_name}
cy: Gan feddwl am {first_person_name}, <em>nid yw</em> {second_person_name} <em>yn perthyn</em> i {first_person_name}

# Thinking about {first_person_name}, {second_person_name} is their <em>…</em>
source: {second_person_name} is {first_person_name_possessive} <em>husband or wife</em>
cy: {second_person_name} yw <em>gŵr neu wraig</em> {first_person_name_possessive}

# Thinking about {first_person_name}, {second_person_name} is their <em>…</em>
source: {second_person_name} is {first_person_name_possessive} <em>legally registered civil partner</em>
cy: {second_person_name} yw <em>partner sifil cofrestredig cyfreithiol</em> {first_person_name_possessive}

# Thinking about {first_person_name}, {second_person_name} is their <em>…</em>
source: {second_person_name} is {first_person_name_possessive} <em>partner</em>
cy: {second_person_name} yw <em>partner</em> {first_person_name_possessive}

# Thinking about {first_person_name}, {second_person_name} is their <em>…</em>
source: {second_person_name} is {first_person_name_possessive} <em>son or daughter</em>
cy: {second_person_name} yw <em>mab neu ferch</em> {first_person_name_possessive}

# Thinking about {first_person_name}, {second_person_name} is their <em>…</em>
source: {second_person_name} is {first_person_name_possessive} <em>stepchild</em>
cy: {second_person_name} yw <em>llysblentyn</em> {first_person_name_possessive}

# Thinking about {first_person_name}, {second_person_name} is their <em>…</em>
source: {second_person_name} is {first_person_name_possessive} <em>brother or sister</em>
cy: {second_person_name} yw <em>brawd neu chwaer</em> {first_person_name_possessive}

# Thinking about {first_person_name}, {second_person_name} is their <em>…</em>
source: {second_person_name} is {first_person_name_possessive} <em>stepbrother or stepsister</em>
cy: {second_person_name} yw <em>llysfrawd neu lyschwaer</em> {first_person_name_possessive}

# Thinking about {first_person_name}, {second_person_name} is their <em>…</em>
source: {second_person_name} is {first_person_name_possessive} <em>mother or father</em>
cy: {second_person_name} yw <em>mam neu dad</em> {first_person_name_possessive}

# Thinking about {first_person_name}, {second_person_name} is their <em>…</em>
source: {second_person_name} is {first_person_name_possessive} <em>stepmother or stepfather</em>
cy: {second_person_name} yw <em>llysfam neu lystad</em> {first_person_name_possessive}

# Thinking about {first_person_name}, {second_person_name} is their <em>…</em>
source: {second_person_name} is {first_person_name_possessive} <em>grandchild</em>
cy: {second_person_name} yw <em>ŵyr neu wyres</em> {first_person_name_possessive}

# Thinking about {first_person_name}, {second_person_name} is their <em>…</em>
source: {second_person_name} is {first_person_name_possessive} <em>grandparent</em>
cy: {second_person_name} yw <em>taid/tad-cu neu nain/mam-gu</em> {first_person_name_possessive}

# Thinking about {first_person_name}, {second_person_name} is their <em>…</em>
source: {second_person_name} is {first_person_name_possessive} <em>other relation</em>
cy: {second_person_name} yw <em>perthynas arall</em> {first_person_name_possessive}

# Thinking about {first_person_name}, {second_person_name} is their <em>…</em>
source: {second_person_name} is <em>unrelated</em> to {first_person_name}
cy: <em>Nid yw</em> {second_person_name} <em>yn perthyn</em> i {first_person_name}

source: Why we ask this question
cy: Pam ydym ni’n gofyn y cwestiwn hwn

source: Why we ask about visitors
cy: Pam ydym ni’n holi am ymwelwyr

source: Why we ask about visitors
cy: Pam ydym ni’n holi am ymwelwyr

source: Why we ask about visitors
cy: Pam ydym ni’n holi am ymwelwyr

# During term time, where do you usually live?
source: Why we ask for term-time address
cy: Pam ydym ni’n gofyn am gyfeiriad yn ystod y tymor

# During term time, where does <em>{person_name}</em> usually live?
source: Why we ask for term-time address
cy: Pam ydym ni’n gofyn am gyfeiriad yn ystod y tymor

# What is your ethnic group?
source: Why your answer is important
cy: Pam mae eich ateb chi’n bwysig

# What is <em>{person_name_possessive}</em> ethnic group?
source: Why their answer is important
cy: Pam mae ateb yr unigolyn yn bwysig

# Which one best describes your White ethnic group or background?
source: Why your answer is important
cy: Pam mae eich ateb chi'n bwysig

source: Why their answer is important
cy: Pam mae ateb yr unigolyn yn bwysig

# Which one best describes your Mixed or Multiple ethnic group or background?
source: Why your answer is important
cy: Pam mae eich ateb chi’n bwysig

source: Why their answer is important
cy: Pam mae ateb yr unigolyn yn bwysig

source: Why your answer is important
cy: Pam mae eich ateb chi'n bwysig

source: Why their answer is important
cy: Pam mae ateb yr unigolyn yn bwysig

source: Why your answer is important
cy: Pam mae eich ateb chi'n bwysig

source: Why their answer is important
cy: Pam mae ateb yr unigolyn yn bwysig

# Which one best describes your other ethnic group or background?
source: Why your answer is important
cy: Pam mae eich ateb chi'n bwysig

source: Why their answer is important
cy: Pam mae ateb yr unigolyn yn bwysig

# Which of the following best describes your sexual orientation?
source: Why your answer is important
cy: Pam mae eich ateb chi'n bwysig

source: Why their answer is important
cy: Pam mae ateb yr unigolyn yn bwysig

# Have you previously served in the UK Armed Forces?
source: Why your answer is important
cy: Pam mae eich ateb chi'n bwysig

# Has <em>{person_name}</em> previously served in the UK Armed Forces?
source: Why their answer is important
cy: Pam mae ateb yr unigolyn yn bwysig

# In the last four weeks, were you actively looking for any kind of paid work?
source: Why we ask this question if you are retired or long-term sick or disabled
cy: Pam ydym ni’n gofyn y cwestiwn hwn os ydych chi wedi ymddeol neu wedi bod yn sâl neu'n anabl am gyfnod hir

source: Why we ask this question if they are retired or long-term sick or disabled
cy: Pam ydym ni’n gofyn y cwestiwn hwn os yw wedi ymddeol neu wedi bod yn sâl neu'n anabl am gyfnod hir

# In the last seven days, were you waiting to start a job already accepted?
source: Why we ask this question if you are retired or long-term sick or disabled
cy: Pam ydym ni’n gofyn y cwestiwn hwn os ydych chi wedi ymddeol neu wedi bod yn sâl neu'n anabl am gyfnod hir

source: Why we ask this question if they are retired or long-term sick or disabled
cy: Pam ydym ni’n gofyn y cwestiwn hwn os yw wedi ymddeol neu wedi bod yn sâl neu'n anabl am gyfnod hir

# Where do you mainly work?
source: Why we ask for workplace
cy: Pam ydym ni’n gofyn am weithle

# Where does <em>{person_name}</em> mainly work?
source: Why we ask for workplace
cy: Pam ydym ni’n gofyn am weithle

# What is the address of your workplace?
source: Why your answer is important
cy: Pam mae eich ateb chi'n bwysig

# What is the address of <em>{person_name_possessive}</em> workplace?
source: Why their answer is important
cy: Pam mae ateb yr unigolyn yn bwysig

# What is the address of your depot?
source: Why your answer is important
cy: Pam mae eich ateb chi'n bwysig

# What is the address of <em>{person_name_possessive}</em> depot?
source: Why their answer is important
cy: Pam mae ateb yr unigolyn yn bwysig

# What is <em>{person_name_possessive}</em> date of birth?
source: Why we ask for visitor details
cy: Pam ydym ni’n gofyn am fanylion ymwelwyr

# What is <em>{person_name_possessive}</em> sex?
source: Why we ask for visitor details
cy: Pam ydym ni’n gofyn am fanylion ymwelwyr

# What is <em>{person_name_possessive}</em> usual address?
source: Why we ask for visitor details
cy: Pam ydym ni’n gofyn am fanylion ymwelwyr

source: We ask this question to ensure that everyone is correctly counted in the census. This includes people who are staying temporarily or are away.
cy: Rydym ni’n gofyn y cwestiwn hwn er mwyn gwneud yn siŵr bod pawb yn cael eu cyfrif yn gywir yn y cyfrifiad. Mae hyn yn cynnwys pobl sy’n aros dros dro neu bobl sydd i ffwrdd o’r cartref.

source: The information is vital for planning services, whether it is for hospital beds, school places, GP and dental services or where to build houses and roads.
cy: Mae’r wybodaeth yn hanfodol er mwyn cynllunio gwasanaethau, er enghraifft, gwelyau ysbyty, lleoedd mewn ysgolion, meddygfeydd a gwasanaethau deintyddol neu ble i adeiladu tai a ffyrdd.

source: This is to ensure that everyone is counted in the census. Add any visitors, even if they have been included on a census questionnaire at another address.
cy: Mae hyn er mwyn gwneud yn siŵr bod pawb yn cael eu cyfrif yn y cyfrifiad. Ychwanegwch unrhyw ymwelwyr, hyd yn oed os byddan nhw wedi cael eu cynnwys ar holiadur y cyfrifiad mewn cyfeiriad arall.

source: This is to ensure that everyone is counted in the census. Add any visitors, even if they have been included on a census questionnaire at another address.
cy: Mae hyn er mwyn gwneud yn siŵr bod pawb yn cael eu cyfrif yn y cyfrifiad. Ychwanegwch unrhyw ymwelwyr, hyd yn oed os byddan nhw wedi cael eu cynnwys ar holiadur y cyfrifiad mewn cyfeiriad arall.

source: This is to ensure that everyone is counted in the census. Add any visitors, even if they have been included on a census questionnaire at another address.
cy: Mae hyn er mwyn gwneud yn siŵr bod pawb yn cael eu cyfrif yn y cyfrifiad. Ychwanegwch unrhyw ymwelwyr, hyd yn oed os byddan nhw wedi cael eu cynnwys ar holiadur y cyfrifiad mewn cyfeiriad arall.

# During term time, where do you usually live?
source: Your answer helps us produce an accurate count of the population during term time. These figures can be used to plan services such as healthcare and transport. This is particularly important in areas with large universities and student populations.
cy: Mae eich ateb yn ein helpu ni i gyfrif y boblogaeth yn ystod y tymor yn gywir. Gall y ffigurau hyn gael eu defnyddio i gynllunio gwasanaethau fel gofal iechyd a thrafnidiaeth. Mae hyn yn arbennig o bwysig mewn ardaloedd â phrifysgolion mawr a nifer fawr o fyfyrwyr.

# During term time, where does <em>{person_name}</em> usually live?
source: Their answer helps us produce an accurate count of the population during term time. These figures can be used to plan services such as healthcare and transport. This is particularly important in areas with large universities and student populations.
cy: Mae’r ateb yn ein helpu ni i gyfrif y boblogaeth yn ystod y tymor yn gywir. Gall y ffigurau hyn gael eu defnyddio i gynllunio gwasanaethau fel gofal iechyd a thrafnidiaeth. Mae hyn yn arbennig o bwysig mewn ardaloedd â phrifysgolion mawr a nifer fawr o fyfyrwyr.

# What is your ethnic group?
source: Your answer will provide a better understanding of your community and help to support equality and fairness. For example, councils and government use information on ethnic group to make sure they
cy: Bydd eich ateb yn helpu i feithrin dealltwriaeth well o’ch cymuned ac yn helpu i gefnogi cydraddoldeb a thegwch. Er enghraifft, mae cynghorau a’r llywodraeth yn defnyddio gwybodaeth am grŵp ethnig i wneud yn siŵr eu bod yn

# What is <em>{person_name_possessive}</em> ethnic group?
source: Their answer will provide a better understanding of their community and help to support equality and fairness. For example, councils and government use information on ethnic group to make sure they
cy: Bydd ateb yr unigolyn yn helpu i feithrin dealltwriaeth well o’r gymuned ac yn helpu i gefnogi cydraddoldeb a thegwch. Er enghraifft, mae cynghorau a’r llywodraeth yn defnyddio gwybodaeth am grŵp ethnig i wneud yn siŵr eu bod yn

# Which one best describes your White ethnic group or background?
source: Your answer will provide a better understanding of your community and help to support equality and fairness. For example, councils and government use information on ethnic group to make sure they
cy: Bydd eich ateb yn helpu i feithrin dealltwriaeth well o’ch cymuned ac yn helpu i gefnogi cydraddoldeb a thegwch. Er enghraifft, mae cynghorau a’r llywodraeth yn defnyddio gwybodaeth am grŵp ethnig i wneud yn siŵr eu bod yn

source: Their answer will provide a better understanding of their community and help to support equality and fairness. For example, councils and government use information on ethnic group to make sure they
cy: Bydd ateb yr unigolyn yn helpu i feithrin dealltwriaeth well o’r gymuned ac yn helpu i gefnogi cydraddoldeb a thegwch. Er enghraifft, mae cynghorau a’r llywodraeth yn defnyddio gwybodaeth am grŵp ethnig i wneud yn siŵr eu bod yn

# Which one best describes your Mixed or Multiple ethnic group or background?
source: Your answer will provide a better understanding of your community and help to support equality and fairness. For example, councils and government use information on ethnic group to make sure they
cy: Bydd eich ateb yn helpu i feithrin dealltwriaeth well o’ch cymuned ac yn helpu i gefnogi cydraddoldeb a thegwch. Er enghraifft, mae cynghorau a’r llywodraeth yn defnyddio gwybodaeth am grŵp ethnig i wneud yn siŵr eu bod yn

source: Their answer will provide a better understanding of their community and help to support equality and fairness. For example, councils and government use information on ethnic group to make sure they
cy: Bydd ateb yr unigolyn yn helpu i feithrin dealltwriaeth well o’r gymuned ac yn helpu i gefnogi cydraddoldeb a thegwch. Er enghraifft, mae cynghorau a’r llywodraeth yn defnyddio gwybodaeth am grŵp ethnig i wneud yn siŵr eu bod yn

source: Your answer will provide a better understanding of your community and help to support equality and fairness. For example, councils and government use information on ethnic group to make sure they
cy: Bydd eich ateb yn helpu i feithrin dealltwriaeth well o’ch cymuned ac yn helpu i gefnogi cydraddoldeb a thegwch. Er enghraifft, mae cynghorau a’r llywodraeth yn defnyddio gwybodaeth am grŵp ethnig i wneud yn siŵr eu bod yn

source: Their answer will provide a better understanding of their community and help to support equality and fairness. For example, councils and government use information on ethnic group to make sure they
cy: Bydd ateb yr unigolyn yn helpu i feithrin dealltwriaeth well o’r gymuned ac yn helpu i gefnogi cydraddoldeb a thegwch. Er enghraifft, mae cynghorau a’r llywodraeth yn defnyddio gwybodaeth am grŵp ethnig i wneud yn siŵr eu bod yn

source: Your answer will provide a better understanding of your community and help to support equality and fairness. For example, councils and government use information on ethnic group to make sure they
cy: Bydd eich ateb yn helpu i feithrin dealltwriaeth well o’ch cymuned ac yn helpu i gefnogi cydraddoldeb a thegwch. Er enghraifft, mae cynghorau a’r llywodraeth yn defnyddio gwybodaeth am grŵp ethnig i wneud yn siŵr eu bod yn

source: Their answer will provide a better understanding of their community and help to support equality and fairness. For example, councils and government use information on ethnic group to make sure they
cy: Bydd ateb yr unigolyn yn helpu i feithrin dealltwriaeth well o’r gymuned ac yn helpu i gefnogi cydraddoldeb a thegwch. Er enghraifft, mae cynghorau a’r llywodraeth yn defnyddio gwybodaeth am grŵp ethnig i wneud yn siŵr eu bod yn

# Which one best describes your other ethnic group or background?
source: Your answer will provide a better understanding of your community and help to support equality and fairness. For example, councils and government use information on ethnic group to make sure they
cy: Bydd eich ateb yn helpu i feithrin dealltwriaeth well o’ch cymuned ac yn helpu i gefnogi cydraddoldeb a thegwch. Er enghraifft, mae cynghorau a’r llywodraeth yn defnyddio gwybodaeth am grŵp ethnig i wneud yn siŵr eu bod yn

source: Their answer will provide a better understanding of their community and help to support equality and fairness. For example, councils and government use information on ethnic group to make sure they
cy: Bydd ateb yr unigolyn yn helpu i feithrin dealltwriaeth well o’r gymuned ac yn helpu i gefnogi cydraddoldeb a thegwch. Er enghraifft, mae cynghorau a’r llywodraeth yn defnyddio gwybodaeth am grŵp ethnig i wneud yn siŵr eu bod yn

# Which of the following best describes your sexual orientation?
source: Your answer will help your local community by providing organisations, such as charities, with an understanding of the services people might need.
cy: Bydd eich ateb chi yn helpu eich cymuned leol drwy helpu sefydliadau, fel elusennau, i ddeall y gwasanaethau y gallai fod eu hangen ar bobl.

# Which of the following best describes your sexual orientation?
source: Councils and government will use this information to
cy: Bydd cynghorau a’r llywodraeth yn defnyddio’r wybodaeth hon i

source: Their answer will help their local community by providing organisations, such as charities, with an understanding of the services people might need.
cy: Bydd yr ateb yn helpu’r gymuned leol drwy helpu sefydliadau, fel elusennau, i ddeall y gwasanaethau y gallai fod eu hangen ar bobl.

source: Councils and government will use this information to
cy: Bydd cynghorau a’r llywodraeth yn defnyddio’r wybodaeth hon i

# Have you previously served in the UK Armed Forces?
source: Your answer will help your local community by providing information needed to support people who used to serve in the UK Armed Forces but have now left.
cy: Bydd eich ateb chi yn helpu eich cymuned leol drwy roi’r wybodaeth sydd ei hangen i gefnogi pobl sydd wedi gwasanaethu yn Lluoedd Arfog y Deyrnas Unedig ond sydd bellach wedi gadael.

# Have you previously served in the UK Armed Forces?
source: Councils and government will use this information to carry out the commitments they made under the Armed Forces Covenant. This is a promise by the nation to ensure that those who serve or who have served in the UK Armed Forces, and their families, are not disadvantaged.
cy: Bydd cynghorau a’r llywodraeth yn defnyddio’r wybodaeth hon i gyflawni eu hymrwymiadau o dan Gyfamod y Lluoedd Arfog. Addewid gan y genedl yw hwn, sy'n sicrhau nad yw’r rhai sy'n gwasanaethu neu sydd wedi gwasanaethu yn y lluoedd arfog, na'u teuluoedd, o dan anfantais.

# Has <em>{person_name}</em> previously served in the UK Armed Forces?
source: Their answer will help their local community by providing information needed to support people who used to serve in the UK Armed Forces but have now left.
cy: Bydd ei ateb yn helpu ei gymuned leol drwy roi’r wybodaeth sydd ei hangen i gefnogi pobl sydd wedi gwasanaethu yn Lluoedd Arfog y Deyrnas Unedig ond sydd bellach wedi gadael.

# Has <em>{person_name}</em> previously served in the UK Armed Forces?
source: Councils and government will use this information to carry out the commitments they made under the Armed Forces Covenant. This is a promise by the nation to ensure that those who serve or who have served in the UK Armed Forces, and their families, are not disadvantaged.
cy: Bydd cynghorau a’r llywodraeth yn defnyddio’r wybodaeth hon i gyflawni eu hymrwymiadau o dan Gyfamod y Lluoedd Arfog. Addewid gan y genedl yw hwn, sy'n sicrhau nad yw’r rhai sy'n gwasanaethu neu sydd wedi gwasanaethu yn y lluoedd arfog, na'u teuluoedd, o dan anfantais.

# In the last four weeks, were you actively looking for any kind of paid work?
source: To get a true picture of the working population, we ask this question of everyone who is not currently working.
cy: I gael darlun cywir o'r boblogaeth o oedran gweithio, rydym ni’n gofyn y cwestiwn hwn i bawb sydd ddim yn gweithio ar hyn o bryd.

# In the last four weeks, were you actively looking for any kind of paid work?
source: We ask people who are retired because the number of people continuing to work after retirement is increasing.
cy: Rydym ni’n gofyn i bobl sydd wedi ymddeol am fod mwy a mwy o bobl yn parhau i weithio ar ôl oedran ymddeol.
