Repository: ONSdigital/eq-questionnaire-schemas
Catalog: translations/*/census_household_gb_wls_*.po
Languages: cy

source: In the last seven days, was <em>{person_name}</em> waiting to start a job already accepted?
cy: Yn ystod y 7 diwrnod diwethaf, oedd <em>{person_name}</em> yn aros i ddechrau swydd roedd eisoes wedi’i derbyn?

source: Have you ever done any paid work?
cy: Ydych chi erioed wedi gwneud unrhyw waith am dâl?

source: Has <em>{person_name}</em> ever done any paid work?
cy: Ydy <em>{person_name}</em> erioed wedi gwneud unrhyw waith am dâl?

source: In your main job, what is your employment status?
cy: Yn eich prif swydd, beth yw eich statws cyflogaeth?

source: In their main job, what is <em>{person_name_possessive}</em> employment status?
cy: Yn y brif swydd, beth yw statws cyflogaeth <em>{person_name_possessive}</em>?

source: In your main job, what was your employment status?
cy: Yn eich prif swydd, beth oedd eich statws cyflogaeth?

source: In their main job, what was <em>{person_name_possessive}</em> employment status?
cy: Yn y brif swydd, beth oedd statws cyflogaeth <em>{person_name_possessive}</em>?

source: What is the name of the organisation or business you work for?
cy: Beth yw enw’r sefydliad neu’r busnes rydych chi’n gweithio iddo?

source: What is the name of the organisation or business <em>{person_name}</em> works for?
cy: Beth yw enw’r sefydliad neu’r busnes mae <em>{person_name}</em> yn gweithio iddo?

source: What was the name of the organisation or business you worked for?
cy: Beth oedd enw’r sefydliad neu’r busnes roeddech chi’n gweithio iddo?

source: What was the name of the organisation or business <em>{person_name}</em> worked for?
cy: Beth oedd enw’r sefydliad neu’r busnes roedd <em>{person_name}</em> yn gweithio iddo?

source: What is your full job title?
cy: Beth yw teitl llawn eich swydd?

source: What is <em>{person_name_possessive}</em> full job title?
cy: Beth yw teitl llawn swydd <em>{person_name_possessive}</em>?

source: What was your full job title?
cy: Beth oedd teitl llawn eich swydd?

source: What was <em>{person_name_possessive}</em> full job title?
cy: Beth oedd teitl llawn swydd <em>{person_name_possessive}</em>?

source: Briefly describe what you do in your main job
cy: Beth ydych chi'n ei wneud yn eich prif swydd?

source: Briefly describe what <em>{person_name}</em> does in their main job
cy: Beth mae <em>{person_name}</em> yn ei wneud yn y brif swydd?

source: Briefly describe what you did in your main job
cy: Beth oeddech chi'n ei wneud yn eich prif swydd?

source: Briefly describe what <em>{person_name}</em> did in their main job
cy: Beth oedd <em>{person_name}</em> yn ei wneud yn y brif swydd?

source: What is the main activity of your organisation, business or freelance work?
cy: Beth yw prif weithgarwch eich sefydliad, busnes neu’ch gwaith ar eich liwt eich hun?

source: What is the main activity of <em>{person_name_possessive}</em> organisation, business or freelance work?
cy: Beth yw prif weithgarwch sefydliad, busnes neu waith ar ei liwt ei hun <em>{person_name_possessive}</em>?

source: What was the main activity of your organisation, business or freelance work?
cy: Beth oedd prif weithgarwch eich sefydliad, busnes neu’ch gwaith ar eich liwt eich hun?

source: What was the main activity of <em>{person_name_possessive}</em> organisation, business or freelance work?
cy: Beth oedd prif weithgarwch sefydliad, busnes neu waith ar ei liwt ei hun <em>{person_name_possessive}</em>?

source: Do you supervise or oversee the work of other employees on a day-to-day basis?
cy: Ydych chi’n goruchwylio neu’n cadw golwg ar waith gweithwyr eraill o ddydd i ddydd?

source: Does <em>{person_name}</em> supervise or oversee the work of other employees on a day-to-day basis?
cy: Ydy <em>{person_name}</em> yn goruchwylio neu’n cadw golwg ar waith gweithwyr eraill o ddydd i ddydd?

source: Did you supervise or oversee the work of other employees on a day-to-day basis?
cy: Oeddech chi’n goruchwylio neu’n cadw golwg ar waith gweithwyr eraill o ddydd i ddydd?

source: Did <em>{person_name}</em> supervise or oversee the work of other employees on a day-to-day basis?
cy: Oedd <em>{person_name}</em> yn goruchwylio neu’n cadw golwg ar waith gweithwyr eraill o ddydd i ddydd?

source: In your main job, how many hours a week do you usually work?
cy: Yn eich prif swydd, sawl awr yr wythnos ydych chi’n gweithio fel arfer?

source: In <em>{person_name_possessive}</em> main job, how many hours a week do they usually work?
cy: Ym mhrif swydd <em>{person_name_possessive}</em>, sawl awr yr wythnos mae’n gweithio fel arfer?

source: How do you usually travel to work?
cy: Sut ydych chi'n teithio i'r gwaith fel arfer?

source: How does <em>{person_name}</em> usually travel to work?
cy: Sut mae <em>{person_name}</em> yn teithio i’r gwaith fel arfer?

source: Where do you mainly work?
cy: Ble ydych chi’n gweithio’n bennaf?

source: Where does <em>{person_name}</em> mainly work?
cy: Ble mae <em>{person_name}</em> yn gweithio’n bennaf?

source: Do you mainly work in the UK?
cy: Ydych chi’n gweithio yn y Deyrnas Unedig yn bennaf?

source: Does <em>{person_name}</em> mainly work in the UK?
cy: Ydy <em>{person_name}</em> yn gweithio yn y Deyrnas Unedig yn bennaf?

source: What is the address of your workplace?
cy: Beth yw cyfeiriad eich gweithle?

source: What is the address of <em>{person_name_possessive}</em> workplace?
cy: Beth yw cyfeiriad gweithle <em>{person_name_possessive}</em>?

source: What is the address of your depot?
cy: Beth yw cyfeiriad eich depo?

source: What is the address of <em>{person_name_possessive}</em> depot?
cy: Beth yw cyfeiriad depo <em>{person_name_possessive}</em>?

source: In which country outside the UK do you mainly work?
cy: Ym mha wlad y tu allan i’r Deyrnas Unedig rydych chi’n gweithio’n bennaf?

source: In which country outside the UK does <em>{person_name}</em> mainly work?
cy: Ym mha wlad y tu allan i’r Deyrnas Unedig mae <em>{person_name}</em> yn gweithio’n bennaf?

source: What is <em>{person_name_possessive}</em> usual address?
cy: Beth yw cyfeiriad arferol <em>{person_name_possessive}</em>?

source: What is <em>{person_name_possessive}</em> usual address in the UK?
cy: Beth yw cyfeiriad arferol <em>{person_name_possessive}</em> yn y Deyrnas Unedig?

source: In which country outside the UK does <em>{person_name}</em> usually live?
cy: Ym mha wlad y tu allan i’r Deyrnas Unedig mae <em>{person_name}</em> yn byw fel arfer?

source: These people are counted as visitors
cy: Caiff y bobl hyn eu cyfrif fel ymwelwyr

# {second_person_name} is your <em>…</em>
source: Complete the sentence by selecting the appropriate relationship.
cy: Cwblhewch y frawddeg drwy ddewis y berthynas briodol.

# Thinking about {first_person_name}, {second_person_name} is their <em>…</em>
source: Complete the sentence by selecting the appropriate relationship.
cy: Cwblhewch y frawddeg drwy ddewis y berthynas briodol.

# What is your date of birth?
source: For example, 31 3 1980
cy: Er enghraifft, 31 3 1980

# What is <em>{person_name_possessive}</em> date of birth?
source: For example, 31 3 1980
cy: Er enghraifft, 31 3 1980

# Do you stay at another address for more than 30 days a year?
source: This should be a single address and could be more than 30 days in a row or divided across the year
cy: Dylai hwn fod yn gyfeiriad unigol a gallai fod yn fwy na 30 diwrnod un ar ôl y llall neu wedi’u rhannu ar hyd y flwyddyn

source: This should be a single address and could be more than 30 days in a row or divided across the year
cy: Dylai hwn fod yn gyfeiriad unigol a gallai fod yn fwy na 30 diwrnod un ar ôl y llall neu wedi’u rhannu ar hyd y flwyddyn

# During term time, where do you usually live?
source: If the <strong>coronavirus</strong> pandemic affected your usual term-time address, answer based on your situation as it is now
cy: Os gwnaeth pandemig y <strong>coronafeirws</strong> effeithio ar eich cyfeiriad arferol yn ystod y tymor, atebwch ar sail eich sefyllfa fel y mae ar hyn o bryd

# During term time, where does <em>{person_name}</em> usually live?
source: If the <strong>coronavirus</strong> pandemic affected their usual term-time address, answer based on their situation as it is now
cy: Os gwnaeth pandemig y <strong>coronafeirws</strong> effeithio ar gyfeiriad arferol yr unigolyn yn ystod y tymor, atebwch ar sail ei sefyllfa fel y mae ar hyn o bryd

# When did you most recently arrive to live in the United Kingdom?
source: Do not count short visits away from the UK
cy: Peidiwch â chyfrif ymweliadau byr i ffwrdd o'r Deyrnas Unedig

source: Do not count short visits away from the UK
cy: Peidiwch â chyfrif ymweliadau byr i ffwrdd o'r Deyrnas Unedig

# One year ago, what was your usual address?
source: If you had no usual address one year ago, select the address where you were staying.
cy: Os nad oedd gennych gyfeiriad arferol flwyddyn yn ôl, dewiswch y cyfeiriad lle roeddech chi’n aros.

# One year ago, what was your usual address?
source: If the <strong>coronavirus</strong> pandemic affected your usual address one year ago, select where you were living <strong>before your circumstances changed</strong>.
cy: Os gwnaeth pandemig y <strong>coronafeirws</strong> effeithio ar eich cyfeiriad arferol flwyddyn yn ôl, dewiswch y cyfeiriad lle roeddech chi'n byw <strong>cyn i'ch amgylchiadau newid</strong>.

# One year ago, what was <em>{person_name_possessive}</em> usual address?
source: If they had no usual address one year ago, select the address where they were staying.
cy: Os nad oedd gan yr unigolyn gyfeiriad arferol flwyddyn yn ôl, dewiswch y cyfeiriad lle roedd yn aros.

# One year ago, what was <em>{person_name_possessive}</em> usual address?
source: If the <strong>coronavirus</strong> pandemic affected their usual address one year ago, select where they were living <strong>before their circumstances changed</strong>.
cy: Os gwnaeth pandemig y <strong>coronafeirws</strong> effeithio ar gyfeiriad arferol yr unigolyn flwyddyn yn ôl, dewiswch y cyfeiriad lle roedd yn byw <strong>cyn i amgylchiadau newid</strong>.

# How would you describe your national identity?
source: This relates to where you feel you belong, such as the country or countries you think of as home.<p>This could be different from your citizenship or ethnic group.
cy: Mae hyn yn ymwneud â ble rydych chi’n teimlo eich bod yn perthyn, er enghraifft, y wlad neu’r gwledydd rydych chi’n ystyried yn gartref i chi. <p>Gallai hyn fod yn wahanol i’ch dinasyddiaeth neu eich grŵp ethnig.

# How would <em>{person_name}</em> describe their national identity?
source: This relates to where they feel they belong, such as the country or countries they think of as home.<p>This could be different from their citizenship or ethnic group.
cy: Mae hyn yn ymwneud â ble mae’r unigolyn yn teimlo ei fod yn perthyn, er enghraifft, y wlad neu’r gwledydd mae’n ystyried yn gartref iddo.<p> Gallai hyn fod yn wahanol i’w ddinasyddiaeth neu ei grŵp ethnig.

# Have you completed an apprenticeship?
source: This could be equivalent apprenticeships completed anywhere outside Wales and England
cy: Gallai hyn fod yn brentisiaethau cyfatebol sydd wedi cael eu cwblhau unrhyw le y tu allan i Gymru a Lloegr

# Has <em>{person_name}</em> completed an apprenticeship?
source: This could be equivalent apprenticeships completed anywhere outside Wales and England
cy: Gallai hyn fod yn brentisiaethau cyfatebol sydd wedi cael eu cwblhau unrhyw le y tu allan i Gymru a Lloegr

# Have you achieved a qualification at degree level or above?
source: This could be equivalent qualifications achieved anywhere outside Wales and England
cy: Gallai hyn fod yn gymwysterau cyfatebol o unrhyw le y tu allan i Gymru a Lloegr

# Has <em>{person_name}</em> achieved a qualification at degree level or above?
source: This could be equivalent qualifications achieved anywhere outside Wales and England
cy: Gallai hyn fod yn gymwysterau cyfatebol o unrhyw le y tu allan i Gymru a Lloegr

# Have you achieved an NVQ or equivalent qualification?
source: This could be equivalent qualifications achieved anywhere outside Wales and England
cy: Gallai hyn fod yn gymwysterau cyfatebol o unrhyw le y tu allan i Gymru a Lloegr

# Has <em>{person_name}</em> achieved an NVQ or equivalent qualification?
source: This could be equivalent qualifications achieved anywhere outside Wales and England
cy: Gallai hyn fod yn gymwysterau cyfatebol o unrhyw le y tu allan i Gymru a Lloegr

# Have you achieved an AS, A level or equivalent qualification?
source: This could be equivalent qualifications achieved anywhere outside Wales and England
cy: Gallai hyn fod yn gymwysterau cyfatebol o unrhyw le y tu allan i Gymru a Lloegr

# Has <em>{person_name}</em> achieved an AS, A level or equivalent qualification?
source: This could be equivalent qualifications achieved anywhere outside Wales and England
cy: Gallai hyn fod yn gymwysterau cyfatebol o unrhyw le y tu allan i Gymru a Lloegr

# Have you achieved a GCSE or equivalent qualification?
source: This could be equivalent qualifications achieved anywhere outside Wales and England
cy: Gallai hyn fod yn gymwysterau cyfatebol o unrhyw le y tu allan i Gymru a Lloegr

# Has <em>{person_name}</em> achieved a GCSE or equivalent qualification?
source: This could be equivalent qualifications achieved anywhere outside Wales and England
cy: Gallai hyn fod yn gymwysterau cyfatebol o unrhyw le y tu allan i Gymru a Lloegr

# Have you achieved any other qualifications?
source: This could be any qualifications you have ever achieved, even if you are not using them now
cy: Gallai hyn fod yn unrhyw gymwysterau rydych chi wedi’u hennill, hyd yn oed os nad ydych chi’n eu defnyddio nhw nawr

# Has <em>{person_name}</em> achieved any other qualifications?
source: This could be any qualifications they have ever achieved, even if they are not using them now
cy: Gallai hyn fod yn unrhyw gymwysterau mae wedi’u hennill, hyd yn oed os nad yw’n eu defnyddio nhw nawr

# In the last seven days, were you doing any of the following?
source: If you have a job but have been off work on <strong>furlough</strong>, in <strong>quarantine</strong> or <strong>self-isolating</strong>, select “Temporarily away from work ill, on holiday or temporarily laid off”
cy: Os oes gennych chi swydd ond rydych wedi bod i ffwrdd o'r gwaith ar <strong>ffyrlo</strong>, dan <strong>gwarantin</strong> neu'n <strong>hunanynysu</strong>, dewiswch “I ffwrdd o’ch gwaith dros dro yn sâl, ar wyliau, neu wedi’ch cadw dros dro o’ch gwaith am na all eich cyflogwr gynnig gwaith ar hyn o bryd"

# In the last seven days, was <em>{person_name}</em> doing any of the following?
source: If they have a job but have been off work on <strong>furlough</strong>, in <strong>quarantine</strong> or <strong>self-isolating</strong>, select “Temporarily away from work ill, on holiday or temporarily laid off”
cy: Os oes gan yr unigolyn swydd ond os yw wedi bod i ffwrdd o'r gwaith ar <strong>ffyrlo</strong>, dan <strong>gwarantin</strong> neu'n <strong>hunanynysu</strong>, atebwch “I ffwrdd o’r gwaith dros dro yn sâl, ar wyliau, neu mae'r unigolyn wedi’i gadw dros dro o’r gwaith am na all y cyflogwr gynnig gwaith ar hyn o bryd”

# Have you ever done any paid work?
source: <strong>Furlough</strong> is considered paid work
cy: Caiff <strong>ffyrlo</strong> ei ystyried yn waith am dâl

# Has <em>{person_name}</em> ever done any paid work?
source: <strong>Furlough</strong> is considered paid work
cy: Caiff <strong>ffyrlo</strong> ei ystyried yn waith am dâl

# In your main job, what is your employment status?
source: Your main job is the job in which you usually work the most hours
cy: Eich prif swydd yw’r swydd rydych chi’n gweithio’r nifer fwyaf o oriau ynddi fel arfer

# In their main job, what is <em>{person_name_possessive}</em> employment status?
source: Their main job is the job in which they usually work the most hours
cy: Prif swydd yr unigolyn yw’r swydd mae’n gweithio’r nifer fwyaf o oriau ynddi fel arfer

# In your main job, what was your employment status?
source: This is the most recent job you had. If you had more than one job at the same time, answer for the job in which you usually worked the most hours.
cy: Hon yw eich swydd fwyaf diweddar. Os oedd gennych chi fwy nag un swydd ar yr un pryd, atebwch ar gyfer y swydd roeddech chi’n gweithio’r nifer fwyaf o oriau ynddi fel arfer.

# In their main job, what was <em>{person_name_possessive}</em> employment status?
source: This is the most recent job they had. If they had more than one job at the same time, answer for the job in which they usually worked the most hours.
cy: Hon yw ei swydd fwyaf diweddar. Os oedd gan yr unigolyn fwy nag un swydd ar yr un pryd, atebwch ar gyfer y swydd roedd yn gweithio’r nifer fwyaf o oriau ynddi fel arfer.

# What is the name of the organisation or business you work for?
source: If you are self-employed in your own business, give the business name
cy: Os ydych chi’n hunangyflogedig yn eich busnes eich hun, nodwch enw eich busnes

source: If they are self-employed in their own business, give the business name
cy: Os yw’r unigolyn yn hunangyflogedig yn ei fusnes ei hun, nodwch enw’r busnes

# What was the name of the organisation or business you worked for?
source: If you were self-employed in your own business, give the business name
cy: Os oeddech chi’n hunangyflogedig yn eich busnes eich hun, nodwch enw eich busnes

source: If they were self-employed in their own business, give the business name
cy: Os oedd yr unigolyn yn hunangyflogedig yn ei fusnes ei hun, nodwch enw’r busnes

# What is your full job title?
source: For example, retail assistant, office cleaner, district nurse, primary school teacher. Do not state your grade or pay band.
cy: Er enghraifft, gweithiwr siop, glanhäwr swyddfa, nyrs ardal, athro ysgol gynradd. Peidiwch â nodi eich gradd na band eich cyflog.

# What is <em>{person_name_possessive}</em> full job title?
source: For example, retail assistant, office cleaner, district nurse, primary school teacher. Do not state their grade or pay band.
cy: Er enghraifft, gweithiwr siop, glanhäwr swyddfa, nyrs ardal, athro ysgol gynradd. Peidiwch â nodi gradd na band cyflog yr unigolyn.

# What was your full job title?
source: For example, retail assistant, office cleaner, district nurse, primary school teacher. Do not state your grade or pay band.
cy: Er enghraifft, gweithiwr siop, glanhäwr swyddfa, nyrs ardal, athro ysgol gynradd. Peidiwch â nodi eich gradd na band eich cyflog.

# What was <em>{person_name_possessive}</em> full job title?
source: For example, retail assistant, office cleaner, district nurse, primary school teacher. Do not state their grade or pay band.
cy: Er enghraifft, gweithiwr siop, glanhäwr swyddfa, nyrs ardal, athro ysgol gynradd. Peidiwch â nodi gradd na band cyflog yr unigolyn.

# What is the main activity of your organisation, business or freelance work?
source: For example, clothing retail, general hospital, primary education, food wholesale, civil service (Welsh Government), local government (housing)
cy: Er enghraifft, gwerthu dillad, ysbyty cyffredinol, addysg gynradd, gwerthu bwyd i fusnesau, y gwasanaeth sifil (Llywodraeth Cymru), llywodraeth leol (tai)

source: For example, clothing retail, general hospital, primary education, food wholesale, civil service (Welsh Government), local government (housing)
cy: Er enghraifft, gwerthu dillad, ysbyty cyffredinol, addysg gynradd, gwerthu bwyd i fusnesau, y gwasanaeth sifil (Llywodraeth Cymru), llywodraeth leol (tai)

# What was the main activity of your organisation, business or freelance work?
source: For example, clothing retail, general hospital, primary education, food wholesale, civil service (Welsh Government), local government (housing)
cy: Er enghraifft, gwerthu dillad, ysbyty cyffredinol, addysg gynradd, gwerthu bwyd i fusnesau, y gwasanaeth sifil (Llywodraeth Cymru), llywodraeth leol (tai)

source: For example, clothing retail, general hospital, primary education, food wholesale, civil service (Welsh Government), local government (housing)
cy: Er enghraifft, gwerthu dillad, ysbyty cyffredinol, addysg gynradd, gwerthu bwyd i fusnesau, y gwasanaeth sifil (Llywodraeth Cymru), llywodraeth leol (tai)

# Do you supervise or oversee the work of other employees on a day-to-day basis?
source: This could be remotely or in person
cy: Gallai hyn fod o bell neu yn yr un lle

source: This could be remotely or in person
cy: Gallai hyn fod o bell neu yn yr un lle

# Did you supervise or oversee the work of other employees on a day-to-day basis?
source: This could be remotely or in person
cy: Gallai hyn fod o bell neu yn yr un lle

source: This could be remotely or in person
cy: Gallai hyn fod o bell neu yn yr un lle

# In your main job, how many hours a week do you usually work?
source: If the <strong>coronavirus</strong> pandemic has affected your working hours, select the answer that best describes your <strong>current circumstances</strong>
cy: Os yw pandemig y <strong>coronafeirws </strong> wedi effeithio ar eich oriau gwaith, dewiswch yr ateb sy'n disgrifio orau eich <strong>amgylchiadau ar hyn o bryd</strong>

source: If the <strong>coronavirus</strong> pandemic has affected their working hours, select the answer that best describes their <strong>current circumstances</strong>
cy: Os yw pandemig y <strong>coronafeirws</strong> wedi effeithio ar oriau gwaith yr unigolyn, dewiswch yr ateb sy'n disgrifio orau yr <strong>amgylchiadau ar hyn o bryd</strong>

# How do you usually travel to work?
source: Answer for the longest part, <strong>by distance</strong>, of your current journey to work.
cy: Atebwch ar gyfer y rhan hiraf, <strong>o ran pellter</strong>, o’ch taith i’r gwaith ar hyn o bryd.

# How do you usually travel to work?
source: If the <strong>coronavirus</strong> pandemic has affected how you travel to work, select the answer that best describes your <strong>current circumstances</strong>.
cy: Os yw pandemig y <strong>coronafeirws</strong> wedi effeithio ar y ffordd rydych chi'n teithio i'r gwaith, dewiswch yr ateb sy'n disgrifio orau eich <strong>amgylchiadau ar hyn o bryd</strong>.

# How does <em>{person_name}</em> usually travel to work?
source: Answer for the longest part, <strong>by distance</strong>, of their current journey to work.
cy: Atebwch ar gyfer y rhan hiraf, <strong>o ran pellter</strong>, o daith yr unigolyn i'r gwaith ar hyn o bryd.

# How does <em>{person_name}</em> usually travel to work?
source: If the <strong>coronavirus</strong> pandemic has affected how they travel to work, select the answer that best describes their <strong>current circumstances</strong>.
cy: Os yw pandemig y <strong>coronafeirws</strong> wedi effeithio ar y ffordd mae'n teithio i'r gwaith, dewiswch yr ateb sy'n disgrifio orau yr <strong>amgylchiadau ar hyn o bryd</strong>.

# Where do you mainly work?
source: If the <strong>coronavirus</strong> pandemic has affected where you mainly work, select the answer that best describes your <strong>current circumstances</strong>
cy: Os yw pandemig y <strong>coronafeirws</strong> wedi effeithio ar ble rydych chi'n gweithio'n bennaf, dewiswch yr ateb sy'n disgrifio orau eich <strong>amgylchiadau ar hyn o bryd</strong>

# Where does <em>{person_name}</em> mainly work?
source: If the <strong>coronavirus</strong> pandemic has affected where they mainly work, select the answer that best describes their <strong>current circumstances</strong>
cy: Os yw pandemig y <strong>coronafeirws</strong> wedi effeithio ar ble mae'n gweithio'n bennaf, dewiswch yr ateb sy'n disgrifio orau yr <strong>amgylchiadau ar hyn o bryd</strong>
