Repository: ONSdigital/eq-questionnaire-schemas
Catalog: translations/*/census_household_gb_wls_*.po
Languages: cy

source: What type of central heating does <em>{household_address}</em> have?
cy: Pa fath o wres canolog sydd yn <em>{household_address}</em>?

source: Does your household own or rent <em>{household_address}</em>?
cy: Oes aelod neu aelodau o'ch cartref yn berchen ar <em>{household_address}</em> neu'n ei rentu?

source: Who is your landlord?
cy: Pwy yw eich landlord?

source: In total, how many cars or vans are owned, or available for use, by members of this household?
cy: Sawl car neu fan sy’n eiddo i aelodau o’r cartref hwn, neu sydd ar gael i’w defnyddio ganddynt?

source: Are you <em>{person_name}?</em>
cy: Ai chi yw <em>{person_name}?</em>

source: What is your date of birth?
cy: Beth yw eich dyddiad geni?

source: What is <em>{person_name_possessive}</em> date of birth?
cy: Beth yw dyddiad geni <em>{person_name_possessive}</em>?

source: You are {age} old. Is this correct?
cy: Rydych chi’n {age}. Ydy hyn yn gywir?

source: <em>{person_name}</em> is {age} old. Is this correct?
cy: Mae <em>{person_name}</em> yn {age}. Ydy hyn yn gywir?

source: What is your sex?
cy: Beth yw eich rhyw?

source: What is <em>{person_name_possessive}</em> sex?
cy: Beth yw rhyw <em>{person_name_possessive}</em>?

source: On {census_date}, what is your legal marital or registered civil partnership status?
cy: Yn gyfreithiol, beth yw eich statws priodasol neu statws eich partneriaeth sifil gofrestredig ar {census_date}?

source: On {census_date}, what is <em>{person_name_possessive}</em> legal marital or registered civil partnership status?
cy: Yn gyfreithiol, beth yw statws priodasol neu statws partneriaeth sifil gofrestredig <em>{person_name_possessive}</em> ar {census_date}?

source: Who is your legal marriage to?
cy: Pwy yw eich priod cyfreithiol?

source: Who is <em>{person_name_possessive}</em> legal marriage to?
cy: Pwy yw priod cyfreithiol <em>{person_name_possessive}</em>?

source: Who was your legal marriage to?
cy: Pwy oedd eich priod cyfreithiol?

source: Who was <em>{person_name_possessive}</em> legal marriage to?
cy: Pwy oedd priod cyfreithiol <em>{person_name_possessive}</em>?

source: Who is your registered civil partnership to?
cy: Pwy yw eich partner sifil cofrestredig?

source: Who is <em>{person_name_possessive}</em> registered civil partnership to?
cy: Pwy yw partner sifil cofrestredig <em>{person_name_possessive}</em>?

source: Who was your registered civil partnership to?
cy: Pwy oedd eich partner sifil cofrestredig?

source: Who was <em>{person_name_possessive}</em> registered civil partnership to?
cy: Pwy oedd partner sifil cofrestredig <em>{person_name_possessive}</em>?

source: Do you stay at another address for more than 30 days a year?
cy: Ydych chi'n aros mewn cyfeiriad arall am fwy na 30 diwrnod y flwyddyn?

source: Does <em>{person_name}</em> stay at another address for more than 30 days a year?
cy: Ydy <em>{person_name}</em> yn aros mewn cyfeiriad arall am fwy na 30 diwrnod y flwyddyn?

source: In which country outside the UK do you stay for more than 30 days a year?
cy: Ym mha wlad y tu allan i’r Deyrnas Unedig ydych chi’n aros am fwy na 30 diwrnod y flwyddyn?

source: In which country outside the UK does <em>{person_name}</em> stay for more than 30 days a year?
cy: Ym mha wlad y tu allan i’r Deyrnas Unedig mae <em>{person_name}</em> yn aros am fwy na 30 diwrnod y flwyddyn?

source: What is the other UK address where you stay for more than 30 days a year?
cy: Beth yw’r cyfeiriad arall yn y Deyrnas Unedig lle rydych chi’n aros am fwy na 30 diwrnod y flwyddyn?

source: What is the other UK address where <em>{person_name}</em> stays for more than 30 days a year?
cy: Beth yw’r cyfeiriad arall yn y Deyrnas Unedig lle mae <em>{person_name}</em> yn aros am fwy na 30 diwrnod y flwyddyn?

source: What type of address is <em>{household_address}</em>?
cy: Pa fath o gyfeiriad yw <em>{household_address}</em>?

source: What type of address is your address in <em>{country}</em>?
cy: Pa fath o gyfeiriad yw eich cyfeiriad yn <em>{country}</em>?

source: What type of address is <em>{person_name_possessive}</em> address in {country}?
cy: Pa fath o gyfeiriad yw cyfeiriad <em>{person_name_possessive}</em> yn {country}?

source: Are you a student in full-time education?
cy: Ydych chi’n fyfyriwr mewn addysg amser llawn?

source: Is <em>{person_name}</em> a student in full-time education?
cy: Ydy <em>{person_name}</em> yn fyfyriwr mewn addysg amser llawn?

source: Are you a schoolchild or student in full-time education?
cy: Ydych chi'n blentyn ysgol neu'n fyfyriwr mewn addysg amser llawn?

source: Is <em>{person_name}</em> a schoolchild or student in full-time education?
cy: Ydy <em>{person_name}</em> yn blentyn ysgol neu’n fyfyriwr mewn addysg amser llawn?

source: During term time, where do you usually live?
cy: Yn ystod y tymor, ble ydych chi'n byw fel arfer?

source: During term time, where does <em>{person_name}</em> usually live?
cy: Yn ystod y tymor, ble mae <em>{person_name}</em> yn byw fel arfer?

source: Is this address in the UK?
cy: Ydy’r cyfeiriad hwn yn y Deyrnas Unedig?

source: During term time, in which country outside the UK do you usually live?
cy: Yn ystod y tymor, ym mha wlad y tu allan i’r Deyrnas Unedig ydych chi’n byw fel arfer?

source: During term time, in which country outside the UK does <em>{person_name}</em> usually live?
cy: Yn ystod y tymor, ym mha wlad y tu allan i’r Deyrnas Unedig mae <em>{person_name}</em> yn byw fel arfer?

source: What is the UK address where you usually stay during term time?
cy: Beth yw’r cyfeiriad yn y Deyrnas Unedig lle rydych chi’n aros fel arfer yn ystod y tymor?

source: What is the UK address where <em>{person_name}</em> usually stays during term time?
cy: Beth yw’r cyfeiriad yn y Deyrnas Unedig lle mae <em>{person_name}</em> yn aros fel arfer yn ystod y tymor?

source: What is your country of birth?
cy: Ym mha wlad y cawsoch chi eich geni?

source: What is <em>{person_name_possessive}</em> country of birth?
cy: Ym mha wlad y ganwyd <em>{person_name_possessive}</em>?

source: You selected “Elsewhere”. What is your country of birth?
cy: Gwnaethoch chi ddewis “Rhywle arall”. Ym mha wlad y cawsoch chi eich geni?

source: You selected “Elsewhere”. What is <em>{person_name_possessive}</em> country of birth?
cy: Gwnaethoch chi ddewis “Rhywle arall”. Ym mha wlad y ganwyd <em>{person_name_possessive}</em>?

source: When did you most recently arrive to live in the United Kingdom?
cy: Pryd ddaethoch chi i fyw yn y Deyrnas Unedig ddiwethaf?

source: When did <em>{person_name}</em> most recently arrive to live in the United Kingdom?
cy: Pryd ddaeth <em>{person_name}</em> i fyw yn y Deyrnas Unedig ddiwethaf?

source: Did you arrive in the UK on or after {year_before_census_date}?
cy: Wnaethoch chi ddod i’r Deyrnas Unedig ar {year_before_census_date} neu ar ôl hynny?

source: Did <em>{person_name}</em> arrive in the UK on or after {year_before_census_date}?
cy: Wnaeth <em>{person_name}</em> ddod i’r Deyrnas Unedig ar {year_before_census_date} neu ar ôl hynny?

source: Including the time already spent here, how long do you intend to stay in the United Kingdom?
cy: Gan gynnwys yr amser rydych chi wedi’i dreulio yma’n barod, am faint ydych chi’n bwriadu aros yn y Deyrnas Unedig?

source: Including the time already spent here, how long does <em>{person_name}</em> intend to stay in the United Kingdom?
cy: Gan gynnwys yr amser y mae wedi’i dreulio yma’n barod, am faint mae <em>{person_name}</em> yn bwriadu aros yn y Deyrnas Unedig?

source: One year ago, what was your usual address?
cy: Flwyddyn yn ôl, beth oedd eich cyfeiriad arferol?

source: One year ago, what was <em>{person_name_possessive}</em> usual address?
cy: Flwyddyn yn ôl, beth oedd cyfeiriad arferol <em>{person_name_possessive}</em>?

source: In which country outside the UK was your usual address one year ago?
cy: Ym mha wlad y tu allan i’r Deyrnas Unedig oedd eich cyfeiriad arferol flwyddyn yn ôl?

source: In which country outside the UK was <em>{person_name_possessive}</em> usual address one year ago?
cy: Ym mha wlad y tu allan i’r Deyrnas Unedig oedd cyfeiriad arferol <em>{person_name_possessive}</em> flwyddyn yn ôl?

source: What was your address one year ago?
cy: Beth oedd eich cyfeiriad flwyddyn yn ôl?

source: What was <em>{person_name_possessive}</em> address one year ago?
cy: Beth oedd cyfeiriad <em>{person_name_possessive}</em> flwyddyn yn ôl?

source: How would you describe your national identity?
cy: Sut fyddech chi'n disgrifio eich hunaniaeth genedlaethol?

source: How would <em>{person_name}</em> describe their national identity?
cy: Sut fyddai <em>{person_name}</em> yn disgrifio ei hunaniaeth genedlaethol?

source: You selected “Other”. How would you describe your national identity?
cy: Gwnaethoch chi ddewis “Arall”. Sut fyddech chi’n disgrifio eich hunaniaeth genedlaethol?

source: You selected “Other”. How would <em>{person_name}</em> describe their national identity?
cy: Gwnaethoch chi ddewis “Arall”. Sut fyddai <em>{person_name}</em> yn disgrifio ei hunaniaeth genedlaethol?

source: You selected “Other”. How would you describe your other national identity?
cy: Gwnaethoch chi ddewis “Arall”. Sut fyddech chi’n disgrifio eich hunaniaeth genedlaethol arall?

source: You selected “Other”. How would <em>{person_name}</em> describe their other national identity?
cy: Gwnaethoch chi ddewis “Arall”. Sut fyddai <em>{person_name}</em> yn disgrifio ei hunaniaeth genedlaethol arall?

source: What is your ethnic group?
cy: Beth yw eich grŵp ethnig?

source: What is <em>{person_name_possessive}</em> ethnic group?
cy: Beth yw grŵp ethnig <em>{person_name_possessive}</em>?

source: Which one best describes your White ethnic group or background?
cy: Pa un sy’n disgrifio orau eich grŵp ethnig neu eich cefndir Gwyn?

source: Which one best describes <em>{person_name_possessive}</em> White ethnic group or background?
cy: Pa un sy’n disgrifio orau grŵp ethnig neu gefndir Gwyn <em>{person_name_possessive}</em>?

source: You selected “Any other White background”. How would you describe your White ethnic group or background?
cy: Gwnaethoch chi ddewis “Unrhyw gefndir Gwyn arall”. Sut fyddech chi’n disgrifio eich grŵp ethnig neu gefndir Gwyn?

source: You selected “Any other White background”. How would <em>{person_name}</em> describe their White ethnic group or background?
cy: Gwnaethoch chi ddewis “Unrhyw gefndir Gwyn arall”. Sut fyddai <em>{person_name}</em> yn disgrifio ei grŵp ethnig neu gefndir Gwyn?

source: Which one best describes your Mixed or Multiple ethnic group or background?
cy: Pa un sy’n disgrifio orau eich grŵp ethnig neu gefndir Cymysg neu Amlethnig?

source: Which one best describes <em>{person_name_possessive}</em> Mixed or Multiple ethnic group or background?
cy: Pa un sy’n disgrifio orau grŵp ethnig neu gefndir Cymysg neu Amlethnig <em>{person_name_possessive}</em>?

source: You selected “Any other Mixed or Multiple background”. How would you describe your Mixed or Multiple ethnic group or background?
cy: Gwnaethoch chi ddewis "Unrhyw gefndir Cymysg neu Amlethnig arall". Sut fyddech chi'n disgrifio eich grŵp ethnig neu gefndir Cymysg neu Amlethnig?

source: You selected “Any other Mixed or Multiple background”. How would <em>{person_name}</em> describe their Mixed or Multiple ethnic group or background?
cy: Gwnaethoch chi ddewis "Unrhyw gefndir Cymysg neu Amlethnig arall". Sut fyddai <em>{person_name}</em> yn disgrifio ei grŵp ethnig neu gefndir Cymysg neu Amlethnig?

source: Which one best describes your Asian, Asian Welsh or Asian British ethnic group or background?
cy: Pa un sy’n disgrifio orau eich grŵp ethnig neu eich cefndir Asiaidd, Asiaidd Cymreig neu Asiaidd Prydeinig?

source: Which one best describes <em>{person_name_possessive}</em> Asian, Asian Welsh or Asian British ethnic group or background?
cy: Pa un sy’n disgrifio orau grŵp ethnig neu gefndir Asiaidd, Asiaidd Cymreig neu Asiaidd Prydeinig <em>{person_name_possessive}</em>?

source: You selected “Any other Asian background”. How would you describe your Asian ethnic group or background?
cy: Gwnaethoch chi ddewis “Unrhyw gefndir Asiaidd arall”. Sut fyddech chi’n disgrifio eich grŵp ethnig neu gefndir Asiaidd?

source: You selected “Any other Asian background”. How would <em>{person_name}</em> describe their Asian ethnic group or background?
cy: Gwnaethoch chi ddewis “Unrhyw gefndir Asiaidd arall”. Sut fyddai <em>{person_name}</em> yn disgrifio ei grŵp ethnig neu gefndir Asiaidd?

source: Which one best describes your Black, Black Welsh, Black British, Caribbean or African ethnic group or background?
cy: Pa un sy’n disgrifio orau eich grŵp ethnig neu eich cefndir Du, Du Cymreig, Du Prydeinig, Caribïaidd neu Affricanaidd?

source: Which one best describes <em>{person_name_possessive}</em> Black, Black Welsh, Black British, Caribbean or African ethnic group or background?
cy: Pa un sy’n disgrifio orau grŵp ethnig neu gefndir Du, Du Cymreig, Du Prydeinig, Caribïaidd neu Affricanaidd <em>{person_name_possessive}</em>?

source: You selected “African”. How would you describe your African ethnic group or background?
cy: Gwnaethoch chi ddewis “Affricanaidd”. Sut fyddech chi’n disgrifio eich grŵp ethnig neu gefndir Affricanaidd?

source: You selected “African”. How would <em>{person_name}</em> describe their African ethnic group or background?
cy: Gwnaethoch chi ddewis “Affricanaidd”. Sut fyddai <em>{person_name}</em> yn disgrifio ei grŵp ethnig neu gefndir Affricanaidd?

source: You selected “Any other Black, Black British or Caribbean background”. How would you describe your Black, Black British or Caribbean ethnic group or background?
cy: Gwnaethoch chi ddewis “Unrhyw gefndir Du, Du Prydeinig neu Garibïaidd arall”. Sut fyddech chi’n disgrifio eich grŵp ethnig neu gefndir Du, Du Prydeinig neu Garibïaidd?

source: You selected “Any other Black, Black British or Caribbean background”. How would <em>{person_name}</em> describe their Black, Black British or Caribbean ethnic group or background?
cy: Gwnaethoch chi ddewis “Unrhyw gefndir Du, Du Prydeinig neu Garibïaidd arall”. Sut fyddai <em>{person_name}</em> yn disgrifio ei grŵp ethnig neu gefndir Du, Du Prydeinig neu Garibïaidd?

source: Which one best describes your other ethnic group or background?
cy: Pa un sy’n disgrifio orau eich grŵp ethnig neu eich cefndir arall?

source: Which one best describes <em>{person_name_possessive}</em> other ethnic group or background?
cy: Pa un sy’n disgrifio orau grŵp ethnig neu gefndir arall <em>{person_name_possessive}</em>?

source: You selected “Any other ethnic group”. How would you describe your ethnic group or background?
cy: Gwnaethoch chi ddewis “Unrhyw grŵp ethnig arall”. Sut fyddech chi’n disgrifio eich grŵp ethnig neu gefndir?

source: You selected “Any other ethnic group”. How would <em>{person_name}</em> describe their ethnic group or background?
cy: Gwnaethoch chi ddewis “Unrhyw grŵp ethnig arall”. Sut fyddai <em>{person_name}</em> yn disgrifio ei grŵp ethnig neu gefndir?

source: What is your religion?
cy: Beth yw eich crefydd?

source: What is <em>{person_name_possessive}</em> religion?
cy: Beth yw crefydd <em>{person_name_possessive}</em>?

source: You selected “Any other religion”. What is your religion?
cy: Gwnaethoch chi ddewis “Unrhyw grefydd arall”. Beth yw eich crefydd?

source: You selected “Any other religion”. What is <em>{person_name_possessive}</em> religion?
cy: Gwnaethoch chi ddewis “Unrhyw grefydd arall”. Beth yw crefydd <em>{person_name_possessive}</em>?

source: Can you understand, speak, read or write Welsh?
cy: Ydych chi’n gallu deall, siarad, darllen neu ysgrifennu Cymraeg?

source: Can <em>{person_name}</em> understand, speak, read or write Welsh?
cy: Ydy <em>{person_name}</em> yn gallu deall, siarad, darllen neu ysgrifennu Cymraeg?

source: What is your main language?
cy: Beth yw eich prif iaith?

source: What is <em>{person_name_possessive}</em> main language?
cy: Beth yw prif iaith <em>{person_name_possessive}</em>?

source: You selected “Other, including British Sign Language”. What is your main language?
cy: Gwnaethoch chi ddewis “Arall, gan gynnwys Iaith Arwyddion Prydain”. Beth yw eich prif iaith?

source: You selected “Other, including British Sign Language”. What is <em>{person_name_possessive}</em> main language?
cy: Gwnaethoch chi ddewis “Arall, gan gynnwys Iaith Arwyddion Prydain”. Beth yw prif iaith <em>{person_name_possessive}</em>?

source: How well can you speak English?
cy: Pa mor dda ydych chi’n gallu siarad Saesneg?

source: How well can <em>{person_name}</em> speak English?
cy: Pa mor dda mae <em>{person_name}</em> yn gallu siarad Saesneg?

source: What passports do you hold?
cy: Pa basbortau sydd gennych chi?

source: What passports does <em>{person_name}</em> hold?
cy: Pa basbortau sydd gan <em>{person_name}</em>?

source: You selected “Other”. What passports do you hold?
cy: Gwnaethoch chi ddewis “Arall”. Pa basbortau sydd gennych chi?

source: You selected “Other”. What passports does <em>{person_name}</em> hold?
cy: Gwnaethoch chi ddewis “Arall”. Pa basbortau sydd gan <em>{person_name}</em>?

source: You selected “Other”. What other passports do you hold?
cy: Gwnaethoch chi ddewis “Arall”. Pa basbortau eraill sydd gennych chi?

source: You selected “Other”. What other passports does <em>{person_name}</em> hold?
cy: Gwnaethoch chi ddewis “Arall”. Pa basbortau eraill sydd gan <em>{person_name}</em>?

source: How is your health in general?
cy: Sut mae eich iechyd yn gyffredinol?

source: How is <em>{person_name_possessive}</em> health in general?
cy: Sut mae iechyd <em>{person_name_possessive}</em> yn gyffredinol?

source: Do you have any physical or mental health conditions or illnesses lasting or expected to last 12 months or more?
cy: Oes gennych chi gyflwr neu salwch corfforol neu feddyliol sydd wedi para neu sy’n debygol o bara 12 mis neu fwy?

source: Does <em>{person_name}</em> have any physical or mental health conditions or illnesses lasting or expected to last 12 months or more?
cy: Oes gan <em>{person_name}</em> gyflwr neu salwch corfforol neu feddyliol sydd wedi para neu sy’n debygol o bara 12 mis neu fwy?

source: Do any of your conditions or illnesses reduce your ability to carry out day-to-day activities?
cy: Ydy unrhyw gyflwr neu salwch sydd gennych chi’n lleihau eich gallu i wneud gweithgareddau pob dydd?

source: Do any of <em>{person_name_possessive}</em> conditions or illnesses reduce their ability to carry out day-to-day activities?
cy: Ydy unrhyw gyflwr neu salwch sydd gan <em>{person_name_possessive}</em> yn lleihau gallu’r unigolyn i wneud gweithgareddau pob dydd?

source: Do you look after, or give any help or support to, anyone because they have long-term physical or mental health conditions or illnesses, or problems related to old age?
cy: Ydych chi’n gofalu am unrhyw un, neu’n cynnig unrhyw help neu gefnogaeth i unrhyw un, oherwydd cyflwr neu salwch corfforol neu feddyliol hir dymor, neu broblemau sy’n gysylltiedig â henaint?

source: Does <em>{person_name}</em> look after, or give any help or support to, anyone because they have long-term physical or mental health conditions or illnesses, or problems related to old age?
cy: Ydy <em>{person_name}</em> yn gofalu am unrhyw un, neu’n cynnig unrhyw help neu gefnogaeth i unrhyw un, oherwydd cyflwr neu salwch corfforol neu feddyliol hir dymor, neu broblemau sy’n gysylltiedig â henaint?

source: Which of the following best describes your sexual orientation?
cy: Pa un o’r canlynol sy’n disgrifio orau eich cyfeiriadedd rhywiol?

source: Which of the following best describes <em>{person_name_possessive}</em> sexual orientation?
cy: Pa un o’r canlynol sy’n disgrifio orau gyfeiriadedd rhywiol <em>{person_name_possessive}</em>?

source: Is the gender you identify with the same as your sex registered at birth?
cy: A yw'r rhywedd rydych chi'n uniaethu ag ef yr un peth â'ch rhyw a gofrestrwyd pan gawsoch chi eich geni?

source: Is the gender <em>{person_name}</em> identifies with the same as their sex registered at birth?
cy: A yw'r rhywedd y mae <em>{person_name}</em> yn uniaethu ag ef yr un peth â’r rhyw a gofrestrwyd pan y’i ganwyd?

source: Have you completed an apprenticeship?
cy: Ydych chi wedi cwblhau prentisiaeth?

source: Has <em>{person_name}</em> completed an apprenticeship?
cy: Ydy <em>{person_name}</em> wedi cwblhau prentisiaeth?

source: Have you achieved a qualification at degree level or above?
cy: Oes gennych chi gymhwyster ar lefel gradd neu uwch?

source: Has <em>{person_name}</em> achieved a qualification at degree level or above?
cy: Oes gan <em>{person_name}</em> gymhwyster ar lefel gradd neu uwch?

source: Have you achieved an NVQ or equivalent qualification?
cy: Oes gennych chi NVQ neu gymhwyster cyfatebol?

source: Has <em>{person_name}</em> achieved an NVQ or equivalent qualification?
cy: Oes gan <em>{person_name}</em> NVQ neu gymhwyster cyfatebol?

source: Have you achieved an AS, A level or equivalent qualification?
cy: Oes gennych chi Lefel AS (Safon UG), Lefel A (Safon Uwch) neu gymhwyster cyfatebol?

source: Has <em>{person_name}</em> achieved an AS, A level or equivalent qualification?
cy: Oes gan <em>{person_name}</em> gymhwyster Lefel AS (Safon UG), Lefel A (Safon Uwch) neu gymhwyster cyfatebol?

source: Have you achieved a GCSE or equivalent qualification?
cy: Oes gennych chi gymhwyster TGAU neu gymhwyster cyfatebol?

source: Has <em>{person_name}</em> achieved a GCSE or equivalent qualification?
cy: Oes gan <em>{person_name}</em> gymhwyster TGAU neu gymhwyster cyfatebol?

source: Have you achieved any other qualifications?
cy: Oes gennych chi unrhyw gymwysterau eraill?

source: Has <em>{person_name}</em> achieved any other qualifications?
cy: Oes gan <em>{person_name}</em> unrhyw gymwysterau eraill?

source: Have you previously served in the UK Armed Forces?
cy: Ydych chi wedi gwasanaethu yn Lluoedd Arfog y Deyrnas Unedig yn y gorffennol (er enghraifft, y fyddin)?

source: Has <em>{person_name}</em> previously served in the UK Armed Forces?
cy: Ydy <em>{person_name}</em> wedi gwasanaethu yn Lluoedd Arfog y Deyrnas Unedig yn y gorffennol (er enghraifft, y fyddin)?

source: In the last seven days, were you doing any of the following?
cy: Yn ystod y 7 diwrnod diwethaf, oeddech chi’n gwneud unrhyw un o’r canlynol?

source: In the last seven days, was <em>{person_name}</em> doing any of the following?
cy: Yn ystod y 7 diwrnod diwethaf, oedd <em>{person_name}</em> yn gwneud unrhyw un o’r canlynol?

source: Which of the following describes what you were doing in the last seven days?
cy: Pa un o’r canlynol sy’n disgrifio’r hyn roeddech chi’n ei wneud yn ystod y 7 diwrnod diwethaf?

source: Which of the following describes what <em>{person_name}</em> was doing in the last seven days?
cy: Pa un o’r canlynol sy’n disgrifio’r hyn roedd <em>{person_name}</em> yn ei wneud yn ystod y 7 diwrnod diwethaf?

source: In the last four weeks, were you actively looking for any kind of paid work?
cy: Yn ystod y 4 wythnos diwethaf, oeddech chi wrthi'n chwilio am unrhyw fath o waith am dâl?

source: In the last four weeks, was <em>{person_name}</em> actively looking for any kind of paid work?
cy: Yn ystod y 4 wythnos diwethaf, oedd <em>{person_name}</em> wrthi’n chwilio am unrhyw fath o waith am dâl?

source: Are you available to start work in the next two weeks?
cy: Ydych chi ar gael i ddechrau gweithio yn y pythefnos nesaf?

source: Is <em>{person_name}</em> available to start work in the next two weeks?
cy: Ydy <em>{person_name}</em> ar gael i ddechrau gweithio yn y pythefnos nesaf?

source: In the last seven days, were you waiting to start a job already accepted?
cy: Yn ystod y 7 diwrnod diwethaf, oeddech chi’n aros i ddechrau swydd roeddech chi eisoes wedi’i derbyn?
