Repository: ONSdigital/eq-questionnaire-schemas
Catalog: translations/*/census_household_gb_wls_*.po
Languages: cy

# What type of central heating does <em>{household_address}</em> have?
source: Include all central heating systems that generate heat for multiple rooms, whether or not the system is used
cy: Dylech gynnwys pob system gwres canolog sy’n cynhyrchu gwres ar gyfer mwy nag un ystafell, hyd yn oed os nad ydych yn defnyddio’r system

source: Include any company cars or vans available for private use
cy: Dylech gynnwys unrhyw geir neu faniau cwmni sydd ar gael at ddefnydd preifat

# What is your sex?
source: A question about gender identity will follow later on in the questionnaire
cy: Bydd cwestiwn am hunaniaeth o ran rhywedd yn dilyn yn nes ymlaen yn yr holiadur

# What is <em>{person_name_possessive}</em> sex?
source: A question about gender identity will follow later on in the questionnaire
cy: Bydd cwestiwn am hunaniaeth o ran rhywedd yn dilyn yn nes ymlaen yn yr holiadur

# You selected “Other”. How would you describe your national identity?
source: Include all national identities. If you have more than one, enter them all separated by commas.
cy: Dylech gynnwys pob hunaniaeth genedlaethol. Os oes gennych chi fwy nag un, nodwch bob un, a rhoi coma rhyngddyn nhw.

source: Include all national identities. If they have more than one, enter them all separated by commas.
cy: Dylech gynnwys pob hunaniaeth genedlaethol. Os oes gan yr unigolyn fwy nag un, nodwch bob un a rhoi coma rhyngddyn nhw.

# You selected “Other”. How would you describe your other national identity?
source: Include all other national identities. If you have more than one, enter them all separated by commas.
cy: Dylech gynnwys pob hunaniaeth genedlaethol arall. Os oes gennych chi fwy nag un, nodwch bob un a rhoi coma rhyngddyn nhw.

source: Include all other national identities. If they have more than one, enter them all separated by commas.
cy: Dylech gynnwys pob hunaniaeth genedlaethol arall. Os oes gan yr unigolyn fwy nag un, nodwch bob un a rhoi coma rhyngddyn nhw.

# What is your religion?
source: This question is <strong>voluntary</strong>
cy: Mae'r cwestiwn hwn yn <strong> wirfoddol</strong>

# What is <em>{person_name_possessive}</em> religion?
source: This question is <strong>voluntary</strong>
cy: Mae'r cwestiwn hwn yn <strong>wirfoddol</strong>

# You selected “Any other religion”. What is your religion?
source: This question is <strong>voluntary</strong>
cy: Mae'r cwestiwn hwn yn <strong>wirfoddol</strong>

source: This question is <strong>voluntary</strong>
cy: Mae'r cwestiwn hwn yn <strong>wirfoddol</strong>

# You selected “Other”. What passports do you hold?
source: Include all passports. If you have more than one, enter them all separated by commas.
cy: Dylech gynnwys pob pasbort. Os oes gennych chi fwy nag un, nodwch bob un a rhoi coma rhyngddyn nhw.

# You selected “Other”. What passports does <em>{person_name}</em> hold?
source: Include all passports. If they have more than one, enter them all separated by commas.
cy: Dylech gynnwys pob pasbort. Os oes gan yr unigolyn fwy nag un, nodwch bob un a rhoi coma rhyngddyn nhw.

# You selected “Other”. What other passports do you hold?
source: Include all other passports. If you have more than one, enter them all separated by commas.
cy: Dylech gynnwys pob pasbort arall. Os oes gennych chi fwy nag un, nodwch bob un a rhoi coma rhyngddyn nhw.

# You selected “Other”. What other passports does <em>{person_name}</em> hold?
source: Include all other passports. If they have more than one, enter them all separated by commas.
cy: Dylech gynnwys pob pasbort arall. Os oes gan yr unigolyn fwy nag un, nodwch bob un a rhoi coma rhyngddyn nhw.

source: Exclude anything you do as part of your paid employment
cy: Peidiwch â chyfrif unrhyw beth y byddwch chi’n derbyn cyflog am ei wneud

source: Exclude anything they do as part of their paid employment
cy: Peidiwch â chyfrif unrhyw beth y bydd yn derbyn cyflog am ei wneud

# Which of the following best describes your sexual orientation?
source: This question is <strong>voluntary</strong>
cy: Mae'r cwestiwn hwn yn <strong>wirfoddol</strong>

source: This question is <strong>voluntary</strong>
cy: Mae'r cwestiwn hwn yn <strong>wirfoddol</strong>

# Is the gender you identify with the same as your sex registered at birth?
source: This question is <strong>voluntary</strong>
cy: Mae'r cwestiwn hwn yn <strong>wirfoddol</strong>

source: This question is <strong>voluntary</strong>
cy: Mae'r cwestiwn hwn yn <strong>wirfoddol</strong>

# Have you previously served in the UK Armed Forces?
source: <em>Current serving members</em> should only select “No”
cy: <em> Aelodau sy'n gwasanaethu ar hyn o bryd</em>, dewiswch "Nac ydw" yn unig

# Has <em>{person_name}</em> previously served in the UK Armed Forces?
source: <em>Current serving members</em> should only select “No”
cy: Ar gyfer <em>aelod sy'n gwasanaethu ar hyn o bryd</em>, dewiswch "Nac ydy" yn unig

# In the last seven days, were you doing any of the following?
source: Include casual or temporary work, even if only for one hour
cy: Dylech gynnwys gwaith achlysurol neu dros dro, hyd yn oed os mai dim ond am awr y buoch chi’n gweithio

# In the last seven days, was <em>{person_name}</em> doing any of the following?
source: Include casual or temporary work, even if only for one hour
cy: Dylech gynnwys gwaith achlysurol neu dros dro, hyd yn oed os mai dim ond am awr y bu'n gweithio

# In your main job, how many hours a week do you usually work?
source: Include paid and unpaid overtime
cy: Dylech gynnwys oriau ychwanegol am dâl neu heb dâl

source: Include paid and unpaid overtime
cy: Dylech gynnwys oriau ychwanegol am dâl neu heb dâl

source: people who work away from home within the UK if this is their permanent or family home
cy: pobl sy’n gweithio i ffwrdd o’r cartref yn y Deyrnas Unedig os mai hwn yw eu cartref parhaol neu gartref y teulu

source: members of the armed forces if this is their permanent or family home
cy: aelodau o’r lluoedd arfog (er enghraifft, y fyddin), os mai hwn yw eu cartref parhaol neu gartref y teulu

source: people who are temporarily outside the UK for <strong>less than 12 months</strong>
cy: pobl sydd y tu allan i'r Deyrnas Unedig dros dro am <strong>lai na 12 mis</strong>

source: people staying, or expecting to stay, in an establishment such as a hospital, care home or hostel for <strong>less than 6 months</strong>
cy: pobl sy’n aros, neu sy’n disgwyl aros, mewn sefydliad fel ysbyty, cartref gofal neu hostel am <strong>lai na 6 mis</strong>

source: other people who usually live here but are temporarily away from home
cy: pobl eraill sy’n byw yma fel arfer ond sydd i ffwrdd o’r cartref dros dro

source: people staying temporarily who usually live in the UK but do not have another UK address for example, relatives, friends
cy: pobl sy'n aros dros dro, sy'n byw yn y Deyrnas Unedig fel arfer ond sydd heb gyfeiriad arall yn y Deyrnas Unedig, er enghraifft, perthnasau, ffrindiau

source: people who usually live outside the UK who are staying in the UK for <strong>3 months or more</strong>
cy: pobl sy'n byw y tu allan i'r Deyrnas Unedig fel arfer, ond sy'n aros yn y Deyrnas Unedig am <strong>3 mis neu fwy</strong>

# What passports do you hold?
source: current passports and any other travel documents, such as ID cards, that show citizenship of a particular country or countries
cy: pasbortau cyfredol yn ogystal ag unrhyw ddogfennau teithio eraill, fel cardiau adnabod, sy’n dangos eich bod yn ddinesydd gwlad neu wledydd penodol

# What passports do you hold?
source: passports and travel documents that have expired, if you are entitled to renew them
cy: pasbortau a dogfennau teithio sydd wedi dod i ben, os oes hawl gennych chi i’w hadnewyddu nhw

# What passports does <em>{person_name}</em> hold?
source: current passports and any other travel documents, such as ID cards, that show citizenship of a particular country or countries
cy: pasbortau cyfredol yn ogystal ag unrhyw ddogfennau teithio eraill, fel cardiau adnabod, sy’n dangos bod yr unigolyn yn ddinesydd gwlad neu wledydd penodol

# What passports does <em>{person_name}</em> hold?
source: passports and travel documents that have expired, if they are entitled to renew them
cy: pasbortau a dogfennau teithio sydd wedi dod i ben, os oes hawl gan yr unigolyn i’w hadnewyddu nhw

# What is your name?
source: Enter a first name
cy: Rhowch enw cyntaf

# What is your name?
source: Enter a last name
cy: Rhowch gyfenw

# Who else lives at {household_address}?
source: Enter a first name
cy: Rhowch enw cyntaf

# Who else lives at {household_address}?
source: Enter a last name
cy: Rhowch gyfenw

# Who lives at {household_address}?
source: Enter a first name
cy: Rhowch enw cyntaf

# Who lives at {household_address}?
source: Enter a last name
cy: Rhowch gyfenw

# Change details for <em>{person_name}</em> (You)
source: Enter a first name
cy: Rhowch enw cyntaf

# Change details for <em>{person_name}</em> (You)
source: Enter a last name
cy: Rhowch gyfenw

# Change details for <em>{person_name}</em>
source: Enter a first name
cy: Rhowch enw cyntaf

# Change details for <em>{person_name}</em>
source: Enter a last name
cy: Rhowch gyfenw

source: Enter a first name
cy: Rhowch enw cyntaf

source: Enter a last name
cy: Rhowch gyfenw

source: Enter a first name
cy: Rhowch enw cyntaf

source: Enter a last name
cy: Rhowch gyfenw

# What is your date of birth?
source: Enter a valid date of birth
cy: Rhowch ddyddiad geni dilys

# What is your date of birth?
source: Enter a date of birth
cy: Rhowch ddyddiad geni

# What is your date of birth?
source: Enter a date of birth after %(min)s
cy: Rhowch ddyddiad geni sydd ar ôl %(min)s

# What is your date of birth?
source: Enter a date of birth before %(max)s
cy: Rhowch ddyddiad geni sydd cyn %(max)s

# What is <em>{person_name_possessive}</em> date of birth?
source: Enter a valid date of birth
cy: Rhowch ddyddiad geni dilys

# What is <em>{person_name_possessive}</em> date of birth?
source: Enter a date of birth
cy: Rhowch ddyddiad geni

# What is <em>{person_name_possessive}</em> date of birth?
source: Enter a date of birth after %(min)s
cy: Rhowch ddyddiad geni sydd ar ôl %(min)s

# What is <em>{person_name_possessive}</em> date of birth?
source: Enter a date of birth before %(max)s
cy: Rhowch ddyddiad geni sydd cyn %(max)s

# In which country outside the UK do you stay for more than 30 days a year?
source: Enter a country
cy: Rhowch enw gwlad

source: Enter a country
cy: Rhowch enw gwlad

# When did you most recently arrive to live in the United Kingdom?
source: Enter a valid date of arrival
cy: Rhowch ddyddiad cyrraedd dilys

# When did you most recently arrive to live in the United Kingdom?
source: Enter a date of arrival that is after your date of birth
cy: Rhowch ddyddiad cyrraedd sydd ar ôl eich dyddiad geni

# When did you most recently arrive to live in the United Kingdom?
source: Enter a date of arrival that is in the past
cy: Rhowch ddyddiad cyrraedd sydd yn y gorffennol

source: Enter a valid date of arrival
cy: Rhowch ddyddiad cyrraedd dilys

source: Enter a date of arrival that is after their date of birth
cy: Rhowch ddyddiad cyrraedd sydd ar ôl dyddiad geni'r unigolyn

source: Enter a date of arrival that is in the past
cy: Rhowch ddyddiad cyrraedd sydd yn y gorffennol

# What is your name?
source: First name
cy: Enw cyntaf

# What is your name?
source: Middle names
cy: Enwau canol

# What is your name?
source: Last name
cy: Cyfenw

source: Select all that apply. You can select more than one for each person
cy: Dewiswch bob un sy’n berthnasol. Gallwch ddewis mwy nag un ar gyfer pob person

source: Select all that apply. You can select more than one for each person
cy: Dewiswch bob un sy’n berthnasol. Gallwch ddewis mwy nag un ar gyfer pob person

# Who else lives at {household_address}?
source: First name
cy: Enw cyntaf

# Who else lives at {household_address}?
source: Middle names
cy: Enwau canol

# Who else lives at {household_address}?
source: Last name
cy: Cyfenw

# Who lives at {household_address}?
source: First name
cy: Enw cyntaf

# Who lives at {household_address}?
source: Middle names
cy: Enwau canol

# Who lives at {household_address}?
source: Last name
cy: Cyfenw

# Change details for <em>{person_name}</em> (You)
source: First name
cy: Enw cyntaf

# Change details for <em>{person_name}</em> (You)
source: Middle names
cy: Enwau canol

# Change details for <em>{person_name}</em> (You)
source: Last name
cy: Cyfenw

# Change details for <em>{person_name}</em>
source: First name
cy: Enw cyntaf

# Change details for <em>{person_name}</em>
source: Middle names
cy: Enwau canol

# Change details for <em>{person_name}</em>
source: Last name
cy: Cyfenw

source: First name
cy: Enw cyntaf

source: Last name
cy: Cyfenw

source: First name
cy: Enw cyntaf

source: Last name
cy: Cyfenw

# How many bedrooms are available for use only by this household?
source: Number of bedrooms
cy: Nifer yr ystafelloedd gwely

# In which country outside the UK do you stay for more than 30 days a year?
source: Current name of country
cy: Enw presennol y wlad

source: Current name of country
cy: Enw presennol y wlad

# During term time, in which country outside the UK do you usually live?
source: Current name of country
cy: Enw presennol y wlad

source: Current name of country
cy: Enw presennol y wlad

# You selected “Elsewhere”. What is your country of birth?
source: Current name of country
cy: Enw presennol y wlad

source: Current name of country
cy: Enw presennol y wlad

# In which country outside the UK was your usual address one year ago?
source: Current name of country
cy: Enw presennol y wlad

source: Current name of country
cy: Enw presennol y wlad

# You selected “Other”. How would you describe your national identity?
source: National identity
cy: Hunaniaeth genedlaethol

source: National identity
cy: Hunaniaeth genedlaethol

# You selected “Other”. How would you describe your other national identity?
source: National identity
cy: Hunaniaeth genedlaethol

source: National identity
cy: Hunaniaeth genedlaethol

source: White ethnic group or background
cy: Grŵp ethnig neu gefndir Gwyn

source: White ethnic group or background
cy: Grŵp ethnig neu gefndir Gwyn

source: Mixed or Multiple ethnic group or background
cy: Grŵp ethnig neu gefndir Cymysg neu Amlethnig

source: Mixed or Multiple ethnic group or background
cy: Grŵp ethnig neu gefndir Cymysg neu Amlethnig

source: Asian ethnic group or background
cy: Grŵp ethnig neu gefndir Asiaidd

source: Asian ethnic group or background
cy: Grŵp ethnig neu gefndir Asiaidd

source: African ethnic group or background
cy: Grŵp ethnig neu gefndir Affricanaidd

source: African ethnic group or background
cy: Grŵp ethnig neu gefndir Affricanaidd

source: Black, Black British or Caribbean ethnic group or background
cy: Grŵp ethnig neu gefndir Du, Du Prydeinig neu Garibïaidd

source: Black, Black British or Caribbean ethnic group or background
cy: Grŵp ethnig neu gefndir Du, Du Prydeinig neu Garibïaidd

source: Ethnic group or background
cy: Grŵp ethnig neu gefndir

source: Ethnic group or background
cy: Grŵp ethnig neu gefndir

# You selected “Any other religion”. What is your religion?
source: Religion
cy: Crefydd

source: Religion
cy: Crefydd

source: Main language
cy: Prif iaith

source: Main language
cy: Prif Iaith

# You selected “Other”. What passports do you hold?
source: Passports
cy: Pasbortau

# You selected “Other”. What passports does <em>{person_name}</em> hold?
source: Passports
cy: Pasbortau

# You selected “Other”. What other passports do you hold?
source: Passports
cy: Pasbortau

# You selected “Other”. What other passports does <em>{person_name}</em> hold?
source: Passports
cy: Pasbortau

# What is the name of the organisation or business you work for?
source: Organisation or business name
cy: Enw’r sefydliad neu’r busnes

source: Organisation or business name
cy: Enw’r sefydliad neu’r busnes

# What was the name of the organisation or business you worked for?
source: Organisation or business name
cy: Enw’r sefydliad neu’r busnes

source: Organisation or business name
cy: Enw’r sefydliad neu’r busnes

# What is your full job title?
source: Job title
cy: Teitl swydd

# What is <em>{person_name_possessive}</em> full job title?
source: Job title
cy: Teitl swydd

# What was your full job title?
source: Job title
cy: Teitl swydd

# What was <em>{person_name_possessive}</em> full job title?
source: Job title
cy: Teitl swydd

# Briefly describe what you do in your main job
source: Job description
cy: Disgrifiad swydd

# Briefly describe what <em>{person_name}</em> does in their main job
source: Job description
cy: Disgrifiad swydd

# Briefly describe what you did in your main job
source: Job description
cy: Disgrifiad swydd

# Briefly describe what <em>{person_name}</em> did in their main job
source: Job description
cy: Disgrifiad swydd

# What is the main activity of your organisation, business or freelance work?
source: Main activity
cy: Prif weithgarwch

source: Main activity
cy: Prif weithgarwch

# What was the main activity of your organisation, business or freelance work?
source: Main activity
cy: Prif weithgarwch

source: Main activity
cy: Prif weithgarwch

# In which country outside the UK do you mainly work?
source: Current name of country
cy: Enw presennol y wlad

# In which country outside the UK does <em>{person_name}</em> mainly work?
source: Current name of country
cy: Enw presennol y wlad

# In which country outside the UK does <em>{person_name}</em> usually live?
source: Current name of country
cy: Enw presennol y wlad

# In which country outside the UK do you stay for more than 30 days a year?
source: Enter your own answer or select from suggestions
cy: Nodwch eich ateb eich hun neu dewiswch o’r awgrymiadau

source: Enter your own answer or select from suggestions
cy: Nodwch eich ateb eich hun neu dewiswch o’r awgrymiadau

# During term time, in which country outside the UK do you usually live?
source: Enter your own answer or select from suggestions
cy: Nodwch eich ateb eich hun neu dewiswch o’r awgrymiadau

source: Enter your own answer or select from suggestions
cy: Nodwch eich ateb eich hun neu dewiswch o’r awgrymiadau

# You selected “Elsewhere”. What is your country of birth?
source: Enter your own answer or select from suggestions
cy: Nodwch eich ateb eich hun neu dewiswch o’r awgrymiadau

source: Enter your own answer or select from suggestions
cy: Nodwch eich ateb eich hun neu dewiswch o’r awgrymiadau

# In which country outside the UK was your usual address one year ago?
source: Enter your own answer or select from suggestions
cy: Nodwch eich ateb eich hun neu dewiswch o’r awgrymiadau

source: Enter your own answer or select from suggestions
cy: Nodwch eich ateb eich hun neu dewiswch o'r awgrymiadau

# You selected “Other”. How would you describe your national identity?
source: Enter your own answer or select from suggestions
cy: Nodwch eich ateb eich hun neu dewiswch o’r awgrymiadau

source: Enter your own answer or select from suggestions
cy: Nodwch eich ateb eich hun neu dewiswch o’r awgrymiadau

# You selected “Other”. How would you describe your other national identity?
source: Enter your own answer or select from suggestions
cy: Nodwch eich ateb eich hun neu dewiswch o’r awgrymiadau

source: Enter your own answer or select from suggestions
cy: Nodwch eich ateb eich hun neu dewiswch o’r awgrymiadau

source: Enter your own answer or select from suggestions
cy: Nodwch eich ateb eich hun neu dewiswch o’r awgrymiadau

source: Enter your own answer or select from suggestions
cy: Nodwch eich ateb eich hun neu dewiswch o’r awgrymiadau

source: Enter your own answer or select from suggestions
cy: Nodwch eich ateb eich hun neu dewiswch o’r awgrymiadau

source: Enter your own answer or select from suggestions
cy: Nodwch eich ateb eich hun neu dewiswch o’r awgrymiadau

source: Enter your own answer or select from suggestions
cy: Nodwch eich ateb eich hun neu dewiswch o’r awgrymiadau

source: Enter your own answer or select from suggestions
cy: Nodwch eich ateb eich hun neu dewiswch o’r awgrymiadau

source: Enter your own answer or select from suggestions
cy: Nodwch eich ateb eich hun neu dewiswch o’r awgrymiadau

source: Enter your own answer or select from suggestions
cy: Nodwch eich ateb eich hun neu dewiswch o’r awgrymiadau

source: Enter your own answer or select from suggestions
cy: Nodwch eich ateb eich hun neu dewiswch o’r awgrymiadau

source: Enter your own answer or select from suggestions
cy: Nodwch eich ateb eich hun neu dewiswch o’r awgrymiadau

# You selected “Any other religion”. What is your religion?
source: Enter your own answer or select from suggestions
cy: Nodwch eich ateb eich hun neu dewiswch o’r awgrymiadau

source: Enter your own answer or select from suggestions
cy: Nodwch eich ateb eich hun neu dewiswch o’r awgrymiadau

source: Enter your own answer or select from suggestions
cy: Nodwch eich ateb eich hun neu dewiswch o’r awgrymiadau

source: Enter your own answer or select from suggestions
cy: Nodwch eich ateb eich hun neu dewiswch o’r awgrymiadau

# You selected “Other”. What passports do you hold?
source: Enter your own answer or select from suggestions
cy: Nodwch eich ateb eich hun neu dewiswch o’r awgrymiadau

# You selected “Other”. What passports does <em>{person_name}</em> hold?
source: Enter your own answer or select from suggestions
cy: Nodwch eich ateb eich hun neu dewiswch o’r awgrymiadau

# You selected “Other”. What other passports do you hold?
source: Enter your own answer or select from suggestions
cy: Nodwch eich ateb eich hun neu dewiswch o’r awgrymiadau

# You selected “Other”. What other passports does <em>{person_name}</em> hold?
source: Enter your own answer or select from suggestions
cy: Nodwch eich ateb eich hun neu dewiswch o’r awgrymiadau

# In which country outside the UK do you mainly work?
source: Enter your own answer or select from suggestions
cy: Nodwch eich ateb eich hun neu dewiswch o’r awgrymiadau

# In which country outside the UK does <em>{person_name}</em> mainly work?
source: Enter your own answer or select from suggestions
cy: Nodwch eich ateb eich hun neu dewiswch o'r awgrymiadau

# In which country outside the UK does <em>{person_name}</em> usually live?
source: Enter your own answer or select from suggestions
cy: Nodwch eich ateb eich hun neu dewiswch o’r awgrymiadau

source: {second_person_name} is your <em>…</em>
cy: {second_person_name} yw eich <em>...</em>

# Thinking about {first_person_name}, {second_person_name} is their <em>…</em>
source: {second_person_name} is {first_person_name_possessive} <em>…</em>
cy: {second_person_name} yw <em>...</em> {first_person_name_possessive}

# Do you usually live at {household_address}?
source: Yes, I usually live here
cy: Ydw, rwy'n byw yma fel arfer

# Do you usually live at {household_address}?
source: No, I don’t usually live here
cy: Nac ydw, nid wyf yn byw yma fel arfer

source: Family members and partners
cy: Aelodau o’r teulu a phartneriaid

source: Housemates, tenants or lodgers
cy: Tenantiaid, lojers neu bobl sy’n rhannu cartref

source: People who usually live outside the UK who are staying in the UK for 3 months or more
cy: Pobl sy'n byw y tu allan i'r Deyrnas Unedig fel arfer, ond sy'n aros yn y Deyrnas Unedig am 3 mis neu fwy

source: People temporarily away
cy: Pobl sydd i ffwrdd o’r cartref dros dro

source: People staying temporarily who usually live in the UK but do not have another UK address
cy: Pobl sy’n aros dros dro, sy’n byw yn y Deyrnas Unedig fel arfer, ond sydd heb gyfeiriad arall yn y Deyrnas Unedig

source: None of these apply, I am the only person who usually lives here
cy: Dim un o’r rhain yn berthnasol, fi yw’r unig berson sy’n byw yma fel arfer

source: Family members and partners
cy: Aelodau o’r teulu a phartneriaid
