Repository: ONSdigital/eq-questionnaire-schemas
Catalog: translations/*/census_household_gb_wls_*.po
Languages: cy

# In your main job, how many hours a week do you usually work?
source: 16 to 30 hours
cy: 16 i 30 awr

# In your main job, how many hours a week do you usually work?
source: 31 to 48 hours
cy: 31 i 48 awr

# In your main job, how many hours a week do you usually work?
source: 49 hours or more
cy: 49 awr neu fwy

source: 0 to 15 hours
cy: 0 i 15 awr

source: 16 to 30 hours
cy: 16 i 30 awr

source: 31 to 48 hours
cy: 31 i 48 awr

source: 49 hours or more
cy: 49 awr neu fwy

# How do you usually travel to work?
source: Work mainly at or from home
cy: Gweithio gartref neu o'r cartref yn bennaf

# How do you usually travel to work?
source: Underground, metro, light rail or tram
cy: Trên tanddaearol, metro, tram, neu reilffordd ysgafn

# How do you usually travel to work?
source: Train
cy: Trên

# How do you usually travel to work?
source: Bus, minibus or coach
cy: Bws neu fws mini

# How do you usually travel to work?
source: Taxi
cy: Tacsi

# How do you usually travel to work?
source: Motorcycle, scooter or moped
cy: Beic modur, moped neu sgwter

# How do you usually travel to work?
source: Driving a car or van
cy: Gyrru car neu fan

# How do you usually travel to work?
source: Passenger in a car or van
cy: Teithiwr mewn car neu fan

# How do you usually travel to work?
source: Bicycle
cy: Beic

# How do you usually travel to work?
source: On foot
cy: Cerdded

# How do you usually travel to work?
source: Other
cy: Arall

# How does <em>{person_name}</em> usually travel to work?
source: Work mainly at or from home
cy: Gweithio gartref neu o'r cartref yn bennaf

# How does <em>{person_name}</em> usually travel to work?
source: Underground, metro, light rail or tram
cy: Trên tanddaearol, metro, tram, neu reilffordd ysgafn

# How does <em>{person_name}</em> usually travel to work?
source: Train
cy: Trên

# How does <em>{person_name}</em> usually travel to work?
source: Bus, minibus or coach
cy: Bws neu fws mini

# How does <em>{person_name}</em> usually travel to work?
source: Taxi
cy: Tacsi

# How does <em>{person_name}</em> usually travel to work?
source: Motorcycle, scooter or moped
cy: Beic modur, moped neu sgwter

# How does <em>{person_name}</em> usually travel to work?
source: Driving a car or van
cy: Gyrru car neu fan

# How does <em>{person_name}</em> usually travel to work?
source: Passenger in a car or van
cy: Teithiwr mewn car neu fan

# How does <em>{person_name}</em> usually travel to work?
source: Bicycle
cy: Beic

# How does <em>{person_name}</em> usually travel to work?
source: On foot
cy: Cerdded

# How does <em>{person_name}</em> usually travel to work?
source: Other
cy: Arall

# Where do you mainly work?
source: At a workplace
cy: Mewn gweithle

# Where do you mainly work?
source: Report to a depot
cy: Adrodd i ddepo

# Where do you mainly work?
source: At or from home
cy: Gartref neu o’r cartref

# Where do you mainly work?
source: An offshore installation
cy: Ar safle ar y môr

# Where do you mainly work?
source: No fixed place
cy: Dim man penodol

# Where does <em>{person_name}</em> mainly work?
source: At a workplace
cy: Mewn gweithle

# Where does <em>{person_name}</em> mainly work?
source: Report to a depot
cy: Adrodd i ddepo

# Where does <em>{person_name}</em> mainly work?
source: At or from home
cy: Gartref neu o’r cartref

# Where does <em>{person_name}</em> mainly work?
source: An offshore installation
cy: Ar safle ar y môr

# Where does <em>{person_name}</em> mainly work?
source: No fixed place
cy: Dim man penodol

# Do you mainly work in the UK?
source: Yes
cy: Ydw

# Do you mainly work in the UK?
source: No
cy: Nac ydw

# Does <em>{person_name}</em> mainly work in the UK?
source: Yes
cy: Ydy

# Does <em>{person_name}</em> mainly work in the UK?
source: No
cy: Nac ydy

# What is <em>{person_name_possessive}</em> usual address?
source: An address in the UK
cy: Cyfeiriad yn y Deyrnas Unedig

# What is <em>{person_name_possessive}</em> usual address?
source: An address outside the UK
cy: Cyfeiriad y tu allan i’r Deyrnas Unedig

# What is <em>{person_name_possessive}</em> usual address?
source: Same address as {first_person}
cy: Yr un peth â chyfeiriad {first_person}

source: Include babies born on or before {census_date}, children, students and schoolchildren who live away from home during term time
cy: Dylech gynnwys babanod a anwyd ar neu cyn {census_date}, plant, myfyrwyr a phlant ysgol sy’n byw i ffwrdd o’r cartref yn ystod y tymor

source: For example, working away, on holiday, in the armed forces, living in an establishment such as a care home for up to 6 months, abroad for up to a year
cy: Er enghraifft, yn gweithio i ffwrdd, ar wyliau, yn y lluoedd arfog, yn byw mewn sefydliad fel cartref gofal am hyd at 6 mis, dramor am hyd at flwyddyn

source: For example, UK residents between addresses or currently without a home
cy: Er enghraifft, preswylwyr y Deyrnas Unedig sydd rhwng cyfeiriadau neu heb gartref ar hyn o bryd

source: Include babies born on or before {census_date}, children, students and schoolchildren who live away from home during term time
cy: Dylech gynnwys babanod a anwyd ar neu cyn {census_date}, plant, myfyrwyr a phlant ysgol sy’n byw i ffwrdd o’r cartref yn ystod y tymor

source: For example, working away, on holiday, in the armed forces, living in an establishment such as a care home for up to 6 months, abroad for up to a year
cy: Er enghraifft, yn gweithio i ffwrdd, ar wyliau, yn y lluoedd arfog, yn byw mewn sefydliad fel cartref gofal am hyd at 6 mis, dramor am hyd at flwyddyn

source: For example, UK residents between addresses or currently without a home
cy: Er enghraifft, preswylwyr y Deyrnas Unedig sydd rhwng cyfeiriadau neu heb gartref ar hyn o bryd

source: For example, this is a second address or holiday home
cy: Er enghraifft, ail gyfeiriad neu dŷ gwyliau yw hwn

# {second_person_name} is your <em>…</em>
source: Including half-brother or half-sister
cy: Gan gynnwys hanner brawd neu hanner chwaer

# {second_person_name} is your <em>…</em>
source: Including foster child
cy: Gan gynnwys plentyn maeth

# Thinking about {first_person_name}, {second_person_name} is their <em>…</em>
source: Including half-brother or half-sister
cy: Gan gynnwys hanner brawd neu hanner chwaer

# Thinking about {first_person_name}, {second_person_name} is their <em>…</em>
source: Including foster child
cy: Gan gynnwys plentyn maeth

# What type of accommodation is <em>{household_address}</em>?
source: Including purpose-built flats and flats within converted buildings
cy: Gan gynnwys fflatiau a adeiladwyd yn bwrpasol a fflatiau mewn adeiladau wedi'u haddasu

# Which of the following is your house or bungalow?
source: Including end-terrace
cy: Gan gynnwys ar y pen

# Where is your flat, maisonette or apartment?
source: Including bedsits
cy: Gan gynnwys fflatiau un ystafell

# Where is your flat, maisonette or apartment?
source: For example, former school, church or warehouse
cy: Er enghraifft, hen ysgol, eglwys neu warws

# Where is your flat, maisonette or apartment?
source: For example, in an office building, hotel, or over a shop
cy: Er enghraifft, mewn adeilad o swyddfeydd, gwesty, neu uwchben siop

# What type of central heating does <em>{household_address}</em> have?
source: Including storage heaters
cy: Gan gynnwys gwresogyddion stôr

# What type of central heating does <em>{household_address}</em> have?
source: For example, logs, waste wood or pellets
cy: Er enghraifft, boncyffion, pren gwastraff neu belenni

# What type of central heating does <em>{household_address}</em> have?
source: For example, coal
cy: Er enghraifft, glo

# What type of central heating does <em>{household_address}</em> have?
source: For example, solar thermal or heat pumps
cy: Er enghraifft, pympiau gwres neu solar thermol

# Does your household own or rent <em>{household_address}</em>?
source: Shared ownership
cy: Cynllun rhanberchenogaeth

# Does your household own or rent <em>{household_address}</em>?
source: With or without housing benefit
cy: Gyda chymorth budd-dal tai neu hebddo

# What is your country of birth?
source: You can enter your country of birth on the next question
cy: Gallwch nodi’r wlad lle cawsoch chi eich geni yn y cwestiwn nesaf

# What is <em>{person_name_possessive}</em> country of birth?
source: You can enter their country of birth on the next question
cy: Gallwch nodi’r wlad lle cafodd yr unigolyn ei eni yn y cwestiwn nesaf

# How would you describe your national identity?
source: You can describe your national identity on the next question
cy: Gallwch ddisgrifio eich hunaniaeth genedlaethol yn y cwestiwn nesaf

# How would <em>{person_name}</em> describe their national identity?
source: You can describe their national identity on the next question
cy: Gallwch ddisgrifio hunaniaeth genedlaethol yr unigolyn yn y cwestiwn nesaf

# What is your ethnic group?
source: Includes Welsh, British, Northern Irish, Irish, Gypsy, Irish Traveller, Roma or any other White background
cy: Yn cynnwys Cymreig, Prydeinig, Gwyddelig Gogledd Iwerddon, Gwyddelig, Sipsi, Teithiwr Gwyddelig, Roma neu unrhyw gefndir Gwyn arall

# What is your ethnic group?
source: Includes White and Black Caribbean, White and Black African, White and Asian or any other Mixed or Multiple background
cy: Yn cynnwys Gwyn a Du Caribïaidd, Gwyn a Du Affricanaidd, Gwyn ac Asiaidd neu unrhyw gefndir Cymysg neu Amlethnig arall

# What is your ethnic group?
source: Includes Indian, Pakistani, Bangladeshi, Chinese or any other Asian background
cy: Yn cynnwys Indiaidd, Pacistanaidd, Bangladeshaidd, Tsieineaidd neu unrhyw gefndir Asiaidd arall

# What is your ethnic group?
source: Includes Black British, Caribbean, African or any other Black background
cy: Yn cynnwys Du Prydeinig, Caribïaidd, Affricanaidd neu unrhyw gefndir Du arall

# What is your ethnic group?
source: Includes Arab or any other ethnic group
cy: Yn cynnwys Arabaidd neu unrhyw grŵp ethnig arall

# What is <em>{person_name_possessive}</em> ethnic group?
source: Includes Welsh, British, Northern Irish, Irish, Gypsy, Irish Traveller, Roma or any other White background
cy: Yn cynnwys Cymreig, Prydeinig, Gwyddelig Gogledd Iwerddon, Gwyddelig, Sipsi, Teithiwr Gwyddelig, Roma neu unrhyw gefndir Gwyn arall

# What is <em>{person_name_possessive}</em> ethnic group?
source: Includes White and Black Caribbean, White and Black African, White and Asian or any other Mixed or Multiple background
cy: Yn cynnwys Gwyn a Du Caribïaidd, Gwyn a Du Affricanaidd, Gwyn ac Asiaidd neu unrhyw gefndir Cymysg neu Amlethnig arall

# What is <em>{person_name_possessive}</em> ethnic group?
source: Includes Indian, Pakistani, Bangladeshi, Chinese or any other Asian background
cy: Yn cynnwys Indiaidd, Pacistanaidd, Bangladeshaidd, Tsieineaidd neu unrhyw gefndir Asiaidd arall

# What is <em>{person_name_possessive}</em> ethnic group?
source: Includes Black British, Caribbean, African or any other Black background
cy: Yn cynnwys Du Prydeinig, Caribïaidd, Affricanaidd neu unrhyw gefndir Du arall

# What is <em>{person_name_possessive}</em> ethnic group?
source: Includes Arab or any other ethnic group
cy: Yn cynnwys Arabaidd neu unrhyw grŵp ethnig arall

# Which one best describes your White ethnic group or background?
source: You can enter your ethnic group or background on the next question
cy: Gallwch nodi eich grŵp ethnig neu gefndir yn y cwestiwn nesaf

source: You can enter their ethnic group or background on the next question
cy: Gallwch nodi grŵp ethnig neu gefndir yr unigolyn yn y cwestiwn nesaf

# Which one best describes your Mixed or Multiple ethnic group or background?
source: You can enter your ethnic group or background on the next question
cy: Gallwch nodi eich grŵp ethnig neu gefndir yn y cwestiwn nesaf

source: You can enter their ethnic group or background on the next question
cy: Gallwch nodi grŵp ethnig neu gefndir yr unigolyn yn y cwestiwn nesaf

source: You can enter your ethnic group or background on the next question
cy: Gallwch nodi eich grŵp ethnig neu gefndir yn y cwestiwn nesaf

source: You can enter their ethnic group or background on the next question
cy: Gallwch nodi grŵp ethnig neu gefndir yr unigolyn yn y cwestiwn nesaf

source: You can enter your ethnic group or background on the next question
cy: Gallwch nodi eich grŵp ethnig neu gefndir yn y cwestiwn nesaf

source: You can enter their ethnic group or background on the next question
cy: Gallwch nodi grŵp ethnig neu gefndir yr unigolyn yn y cwestiwn nesaf

# Which one best describes your other ethnic group or background?
source: You can enter your ethnic group or background on the next question
cy: Gallwch nodi eich grŵp ethnig neu gefndir yn y cwestiwn nesaf

source: You can enter their ethnic group or background on the next question
cy: Gallwch nodi grŵp ethnig neu gefndir yr unigolyn yn y cwestiwn nesaf

# What is your religion?
source: All denominations
cy: Pob enwad

# What is your religion?
source: You can enter your religion on the next question
cy: Gallwch nodi eich crefydd yn y cwestiwn nesaf

# What is <em>{person_name_possessive}</em> religion?
source: All denominations
cy: Pob enwad

# What is <em>{person_name_possessive}</em> religion?
source: You can enter their religion on the next question
cy: Gallwch nodi crefydd yr unigolyn yn y cwestiwn nesaf

# What is your main language?
source: You can enter your main language on the next question
cy: Gallwch nodi eich prif iaith yn y cwestiwn nesaf

# What is <em>{person_name_possessive}</em> main language?
source: You can enter their main language on the next question
cy: Gallwch nodi prif iaith yr unigolyn yn y cwestiwn nesaf

# What passports do you hold?
source: You can enter these passports on the next question
cy: Gallwch nodi'r pasbortau hyn yn y cwestiwn nesaf

# What passports does <em>{person_name}</em> hold?
source: You can enter these passports on the next question
cy: Gallwch nodi'r pasbortau hyn yn y cwestiwn nesaf

# Have you completed an apprenticeship?
source: For example, trade, higher, foundation or modern
cy: Er enghraifft, crefft, uwch, sylfaen neu fodern

# Has <em>{person_name}</em> completed an apprenticeship?
source: For example, trade, higher, foundation or modern
cy: Er enghraifft, crefft, uwch, sylfaen neu fodern

# Have you achieved a qualification at degree level or above?
source: For example, degree, foundation degree, HND or HNC, NVQ level 4 and above, teaching or nursing
cy: Er enghraifft, gradd, gradd sylfaen, HND neu HNC, NVQ lefel 4 ac uwch, addysgu neu nyrsio

# Have you achieved a qualification at degree level or above?
source: Questions on other NVQs, A levels, GCSEs and equivalents will follow
cy: Bydd cwestiynau am gymwysterau NVQ eraill, Lefel A (Safon Uwch), TGAU a chymwysterau cyfatebol yn dilyn

# Has <em>{person_name}</em> achieved a qualification at degree level or above?
source: For example, degree, foundation degree, HND or HNC, NVQ level 4 and above, teaching or nursing
cy: Er enghraifft, gradd, gradd sylfaen, HND neu HNC, NVQ lefel 4 ac uwch, addysgu neu nyrsio

# Has <em>{person_name}</em> achieved a qualification at degree level or above?
source: Questions on other NVQs, A levels, GCSEs and equivalents will follow
cy: Bydd cwestiynau am gymwysterau NVQ eraill, Lefel A (Safon Uwch), TGAU a chymwysterau cyfatebol yn dilyn

# Have you achieved an NVQ or equivalent qualification?
source: For example, BTEC National, OND or ONC, City and Guilds Advanced Craft
cy: Er enghraifft, BTEC Cenedlaethol, OND neu ONC, Crefft Uwch City and Guilds

# Have you achieved an NVQ or equivalent qualification?
source: For example, BTEC General, City and Guilds Craft
cy: Er enghraifft, BTEC Cyffredinol, Crefft City and Guilds

# Have you achieved an NVQ or equivalent qualification?
source: Questions on A levels, GCSEs and equivalents will follow
cy: Bydd cwestiynau am gymwysterau Lefel A (Safon Uwch) a TGAU, a chymwysterau cyfatebol yn dilyn

# Has <em>{person_name}</em> achieved an NVQ or equivalent qualification?
source: For example, BTEC National, OND or ONC, City and Guilds Advanced Craft
cy: Er enghraifft, BTEC Cenedlaethol, OND neu ONC, Crefft Uwch City and Guilds

# Has <em>{person_name}</em> achieved an NVQ or equivalent qualification?
source: For example, BTEC General, City and Guilds Craft
cy: Er enghraifft, BTEC Cyffredinol, Crefft City and Guilds

# Has <em>{person_name}</em> achieved an NVQ or equivalent qualification?
source: Questions on A levels, GCSEs and equivalents will follow
cy: Bydd cwestiynau am gymwysterau Lefel A (Safon Uwch) a TGAU, a chymwysterau cyfatebol yn dilyn

# Have you achieved an AS, A level or equivalent qualification?
source: Include 4 or more AS levels
cy: Gan gynnwys 4 Lefel AS (Safon UG) neu fwy

# Have you achieved an AS, A level or equivalent qualification?
source: Include 2 to 3 AS levels
cy: Gan gynnwys 2–3 Lefel AS (Safon UG)

# Have you achieved an AS, A level or equivalent qualification?
source: Questions on GCSEs and equivalents will follow
cy: Bydd cwestiynau am gymwysterau TGAU a chymwysterau cyfatebol yn dilyn

# Has <em>{person_name}</em> achieved an AS, A level or equivalent qualification?
source: Include 4 or more AS levels
cy: Gan gynnwys 4 Lefel AS (Safon UG) neu fwy

# Has <em>{person_name}</em> achieved an AS, A level or equivalent qualification?
source: Include 2 to 3 AS levels
cy: Gan gynnwys 2–3 Lefel AS (Safon UG)

# Has <em>{person_name}</em> achieved an AS, A level or equivalent qualification?
source: Questions on GCSEs and equivalents will follow
cy: Bydd cwestiynau am gymwysterau TGAU a chymwysterau cyfatebol yn dilyn

# Have you achieved a GCSE or equivalent qualification?
source: Include 5 or more O level passes or CSEs grades 1
cy: Gan gynnwys 5 neu fwy Lefel O (marc llwyddo) neu TAU graddau 1

# Have you achieved a GCSE or equivalent qualification?
source: Include any other O levels or CSEs at any grades
cy: Gan gynnwys unrhyw Lefel O neu TAU arall ar unrhyw radd

# Have you achieved a GCSE or equivalent qualification?
source: Skills for life, literacy, numeracy and language
cy: Sgiliau bywyd, llythrennedd, rhifedd ac iaith

# Has <em>{person_name}</em> achieved a GCSE or equivalent qualification?
source: Include 5 or more O level passes or CSEs grades 1
cy: Gan gynnwys 5 neu fwy Lefel O (marc llwyddo) neu TAU graddau 1

# Has <em>{person_name}</em> achieved a GCSE or equivalent qualification?
source: Include any other O levels or CSEs at any grades
cy: Gan gynnwys unrhyw Lefel O neu TAU arall ar unrhyw radd

# Has <em>{person_name}</em> achieved a GCSE or equivalent qualification?
source: Skills for life, literacy, numeracy and language
cy: Sgiliau bywyd, llythrennedd, rhifedd ac iaith

# In the last seven days, were you doing any of the following?
source: Freelance means that you are self-employed and work for different companies or people on particular pieces of work
cy: Mae gweithio ar eich liwt eich hun yn golygu eich bod yn hunangyflogedig ac yn gweithio i wahanol gwmnïau neu bobl ar ddarnau penodol o waith. Gair arall am hyn yw llawrydd

# In the last seven days, was <em>{person_name}</em> doing any of the following?
source: Freelance means that they are self-employed and work for different companies or people on particular pieces of work
cy: Mae gweithio ar ei liwt ei hun yn golygu bod yr unigolyn yn hunangyflogedig ac yn gweithio i wahanol gwmnïau neu bobl ar ddarnau penodol o waith. Gair arall am hyn yw llawrydd

# Which of the following describes what you were doing in the last seven days?
source: Whether receiving a pension or not
cy: Gan dderbyn pensiwn neu beidio

source: Whether receiving a pension or not
cy: Gan dderbyn pensiwn neu beidio

# In your main job, what is your employment status?
source: Freelance means that you are self-employed and work for different companies or people on particular pieces of work
cy: Mae gweithio ar eich liwt eich hun yn golygu eich bod yn hunangyflogedig ac yn gweithio i wahanol gwmnïau neu bobl ar ddarnau penodol o waith. Gair arall am hyn yw llawrydd

# In their main job, what is <em>{person_name_possessive}</em> employment status?
source: Freelance means that they are self-employed and work for different companies or people on particular pieces of work
cy: Mae gweithio ar ei liwt ei hun yn golygu bod yr unigolyn yn hunangyflogedig ac yn gweithio i wahanol gwmnïau neu bobl ar ddarnau penodol o waith. Gair arall am hyn yw llawrydd

# In your main job, what was your employment status?
source: Freelance means that you were self-employed and worked for different companies or people on particular pieces of work
cy: Mae gweithio ar eich liwt eich hun yn golygu eich bod yn hunangyflogedig ac yn gweithio i wahanol gwmnïau neu bobl ar ddarnau penodol o waith. Gair arall am hyn yw llawrydd

# In their main job, what was <em>{person_name_possessive}</em> employment status?
source: Freelance means that they were self-employed and worked for different companies or people on particular pieces of work
cy: Mae gweithio ar ei liwt ei hun yn golygu bod yr unigolyn yn hunangyflogedig ac yn gweithio i wahanol gwmnïau neu bobl ar ddarnau penodol o waith. Gair arall am hyn yw llawrydd

source: Enter the number of cars or vans
cy: Nodwch nifer y ceir neu'r faniau

# Which of the following best describes your sexual orientation?
source: Enter sexual orientation
cy: Nodwch gyfeiriadedd rhywiol

source: Enter sexual orientation
cy: Nodwch gyfeiriadedd rhywiol

# Is the gender you identify with the same as your sex registered at birth?
source: Enter gender identity
cy: Nodwch hunaniaeth o ran rhywedd

source: Enter gender identity
cy: Nodwch hunaniaeth o ran rhywedd

# {second_person_name} is your <em>…</em>
source: {second_person_name} is your <em>husband or wife</em>
cy: {second_person_name} yw eich <em>gŵr neu wraig</em>

# {second_person_name} is your <em>…</em>
source: {second_person_name} is your <em>legally registered civil partner</em>
cy: {second_person_name} yw eich <em>partner sifil cofrestredig cyfreithiol</em>

# {second_person_name} is your <em>…</em>
source: {second_person_name} is your <em>partner</em>
cy: {second_person_name} yw eich <em>partner</em>

# {second_person_name} is your <em>…</em>
source: {second_person_name} is your <em>son or daughter</em>
cy: {second_person_name} yw eich <em>mab neu ferch</em>

# {second_person_name} is your <em>…</em>
source: {second_person_name} is your <em>stepchild</em>
cy: {second_person_name} yw eich <em>llysblentyn</em>

# {second_person_name} is your <em>…</em>
source: {second_person_name} is your <em>brother or sister</em>
cy: {second_person_name} yw eich <em>brawd neu chwaer</em>

# {second_person_name} is your <em>…</em>
source: {second_person_name} is your <em>stepbrother or stepsister</em>
cy: {second_person_name} yw eich <em>llysfrawd neu lyschwaer</em>

# {second_person_name} is your <em>…</em>
source: {second_person_name} is your <em>mother or father</em>
cy: {second_person_name} yw eich <em>mam neu dad</em>

# {second_person_name} is your <em>…</em>
source: {second_person_name} is your <em>stepmother or stepfather</em>
cy: {second_person_name} yw eich <em>llysfam neu lystad</em>

# {second_person_name} is your <em>…</em>
source: {second_person_name} is your <em>grandchild</em>
cy: {second_person_name} yw eich <em>ŵyr neu wyres</em>

# {second_person_name} is your <em>…</em>
source: {second_person_name} is your <em>grandparent</em>
cy: {second_person_name} yw eich <em>taid/tad-cu neu nain/mam-gu</em>

# {second_person_name} is your <em>…</em>
source: {second_person_name} is your <em>other relation</em>
cy: {second_person_name} yw eich <em>perthynas arall</em>

# {second_person_name} is your <em>…</em>
source: {second_person_name} is <em>unrelated</em> to you
cy: <em>Nid yw</em> {second_person_name} <em>yn perthyn</em> i chi
