Repository: ONSdigital/eq-questionnaire-schemas
Catalog: translations/*/census_household_gb_nir_*.po
Languages: ga

source: In which country is <em>{person_name_possessive}</em> course of <em>study</em>, including school?
ga: Cén tír ina bhfuil cúrsa <em>staidéir</em> <em>{person_name_possessive}</em>, scoil san áireamh?

source: What is the address of your main place of <em>study</em>?
ga: Cad é an seoladh atá ag do phríomháit <em>staidéir</em>?

source: What is the address of <em>{person_name_possessive}</em> main place of <em>study</em>?
ga: Cad é an seoladh atá ag príomháit <em>staidéir</em> <em>{person_name_possessive}</em>?

source: How do you usually travel to your main place of <em>study</em>, including school?
ga: Cad é mar a thaistealaíonn tú go dtí dophríomháit <em>staidéir</em>, an scoil san áireamh?

source: How does <em>{person_name}</em> usually travel to their main place of <em>study</em>, including school?
ga: Cad é mar a thaistealaíonn <em>{person_name}</em> go dtí a bpríomháit <em>staidéir</em>, scoil san áireamh?

source: What is <em>{person_name_possessive}</em> usual address?
ga: Cad é gnáthsheoladh <em>{person_name_possessive}</em>?

source: What is <em>{person_name_possessive}</em> usual UK address?
ga: Cad é gnáthsheoladh RA <em>{person_name_possessive}</em>?

source: In which country outside the UK does <em>{person_name}</em> usually live?
ga: Cé acu tír taobh amuigh den RA ina gcónaíonn <em>{person_name}</em> de ghnáth?

source: These people will be counted as visitors
ga: Cuntaisfear na daoine seo mar chuairteoirí

# {second_person_name} is your <em>…</em>
source: Complete the sentence by selecting the appropriate relationship.
ga: Críochnaigh an abairt leis an ghaol chuí a roghnú.

# Thinking about {first_person_name}, {second_person_name} is their <em>…</em>
source: Complete the sentence by selecting the appropriate relationship.
ga: Críochnaigh an abairt leis an ghaol chuí a roghnú.

# What is your date of birth?
source: For example, 31 3 1980
ga: Mar shampla, 31 3 1980

# What is <em>{person_name_possessive}</em> date of birth?
source: For example, 31 3 1980
ga: Mar shampla, 31 3 1980

# One year ago, what was your usual address?
source: If you had no usual address one year ago, state the address where you were staying
ga: Muna raibh gnáthsheoladh agat bliain amháin ó shin, cuir an seoladh ina raibh tú ag fanacht in iúl

# One year ago, what was <em>{person_name_possessive}</em> usual address?
source: If they had no usual address one year ago, state the address where they were staying
ga: Muna raibh gnáthsheoladh acu bliain amháin ó shin, cuir an seoladh ina raibh siad ag fanacht in iúl

# In the last seven days, were you doing any of the following?
source: If you have a job but have been off work on <em>furlough</em>, select “Temporarily away from work ill, on holiday or temporarily laid off”
ga: Má tá post agat ach tá tú saor ón obair ar <em>ar scor sealadach</em>, roghnaigh “Saor ón obair go sealadach, tinn, ar saoire nó ar scor go sealadach

# In the last seven days, was <em>{person_name}</em> doing any of the following?
source: If they have a job but have been off work on <em>furlough</em>, select “Temporarily away from work ill, on holiday or temporarily laid off”
ga: Má tá post acu ach tá siad saor ón obair ar <em>ar scor sealadach</em>, roghnaigh “Saor ón obair go sealadach, tinn, ar saoire nó ar scor go sealadach

# Have you ever done any paid work?
source: <em>Furlough</em> is considered paid work
ga: Glactar le <em>Ar scor sealadach</em> mar obair a bhfuil íocaíocht léi

# Has <em>{person_name}</em> ever done any paid work?
source: <em>Furlough</em> is considered paid work
ga: Glactar le <em>Ar scor sealadach</em> mar obair a bhfuil íocaíocht léi

# In your main job, what is your employment status?
source: Your main job is the job in which you usually work the most hours
ga: Is é do phríomhphost an post ina n-oibríonn tú an méid is mó uaireanta de ghnáth

# In their main job, what is <em>{person_name_possessive}</em> employment status?
source: Their main job is the job in which they usually work the most hours
ga: Is é do phríomhphost an post ina n-oibríonn tú an méid is mó uaireanta de ghnáth

# In your main job, what was your employment status?
source: This is the most recent job you had. If you had more than one job at the same time, answer for the job in which you usually worked the most hours.
ga: Is é seo an post is déanaí a bhí agat. Má bhí níos mó ná post amháin agat ag an am céanna, freagair faoin phost inar oibrigh tú an méid is mó uaireanta de ghnáth.

# In their main job, what was <em>{person_name_possessive}</em> employment status?
source: This is the most recent job they had. If they had more than one job at the same time, answer for the job in which they usually worked the most hours.
ga: Is é seo an post is déanaí a bhí acu. Má bhí níos mó ná post amháin acu ag an am céanna, freagair faoin phost inar oibrigh siad an méid is mó uaireanta de ghnáth.

# What is the name of the organisation or business you work for?
source: If you are self-employed in your own business, give the business name.
ga: Má tá tú féinfhostaithe i do ghnó féin, tabhair ainm an ghnó dúinn.

source: If they are self-employed in their own business, give the business name.
ga: Má tá siad féinfhostaithe ina ngnó féin, tabhair ainm an ghnó dúinn.

# What was the name of the organisation or business you worked for?
source: If you were self-employed in your own business, give the business name.
ga: Má bhí tú féinfhostaithe i do ghnó féin, tabhair ainm an ghnó dúinn.

source: If they were self-employed in their own business, give the business name.
ga: Má bhí siad féinfhostaithe ina ngnó féin, tabhair ainm an ghnó dúinn.

# What is your full job title?
source: For example, retail assistant, office cleaner, district nurse, primary school teacher. Do not state your grade or pay band
ga: Mar shampla, cúntóir miondíola, glantóir oifige, banaltra ceantair, múinteoir bunscoile. Ná luaigh do ghrád nó do bhanda pá

# What is <em>{person_name_possessive}</em> full job title?
source: For example, retail assistant, office cleaner, district nurse, primary school teacher. Do not state their grade or pay band
ga: Mar shampla, cúntóir miondíola, glantóir oifige, banaltra ceantair, múinteoir bunscoile. Ná luaigh a ngrád nó a mbanda pá

# What was your full job title?
source: For example, retail assistant, office cleaner, district nurse, primary school teacher. Do not state your grade or pay band
ga: Mar shampla, cúntóir miondíola, glantóir oifige, banaltra ceantair, múinteoir bunscoile. Ná luaigh do ghrád nó do bhanda pá

# What was <em>{person_name_possessive}</em> full job title?
source: For example, retail assistant, office cleaner, district nurse, primary school teacher. Do not state their grade or pay band
ga: Mar shampla, cúntóir miondíola, glantóir oifige, banaltra ceantair, múinteoir bunscoile. Ná luaigh a ngrád nó a mbanda pá

# What is the main activity of your organisation, business or freelance work?
source: For example, clothing retail, general hospital, primary education, food wholesale, civil service or local government.
ga: Mar shampla, éadaí miondíola, otharlann ghinearálta, bunscolaíocht, bia mórdhíola, státseirbhís nó rialtais áitiúil.

source: For example, clothing retail, general hospital, primary education, food wholesale, civil service or local government.
ga: Mar shampla, éadaí miondíola, otharlann ghinearálta, bunscolaíocht, bia mórdhíola, státseirbhís nó rialtais áitiúil.

# What was the main activity of your organisation, business or freelance work?
source: For example, clothing retail, general hospital, primary education, food wholesale, civil service or local government.
ga: Mar shampla, éadaí miondíola, otharlann ghinearálta, bunscolaíocht, bia mórdhíola, státseirbhís nó rialtais áitiúil.

source: For example, clothing retail, general hospital, primary education, food wholesale, civil service or local government.
ga: Mar shampla, éadaí miondíola, otharlann ghinearálta, bunscolaíocht, bia mórdhíola, státseirbhís nó rialtais áitiúil.

# Do you supervise or oversee the work of other employees on a day-to-day basis?
source: This could be remotely or in person
ga: D'fhéadfadh sé seo a bheith ó chian nó go pearsanta

source: This could be remotely or in person
ga: D'fhéadfadh sé seo a bheith ó chian nó go pearsanta

# Did you supervise or oversee the work of other employees on a day-to-day basis?
source: This could be remotely or in person
ga: D'fhéadfadh sé seo a bheith ó chian nó go pearsanta

source: This could be remotely or in person
ga: D'fhéadfadh sé seo a bheith ó chian nó go pearsanta

# In your main job, how many hours a week do you usually work?
source: If the <strong>coronavirus</strong> pandemic has affected your working hours, select the answer that best describes your <strong>current circumstances</strong>
ga: Má tá paindéim an <strong>choróinvíris</strong> ag dul i bhfeidhm ar d'uaireanta oibre, roghnaigh an freagra is fearr a chuireann síos ar do <strong>thosca reatha</strong>

source: If the <strong>coronavirus</strong> pandemic has affected their working hours, select the answer that best describes their <strong>current circumstances</strong>
ga: Má tá paindéim an <strong>choróinvíris</strong> ag dul i bhfeidhm ar d'uaireanta oibre, roghnaigh an freagra is fearr a chuireann síos ar do <strong>thosca reatha</strong>

# Where is your main place of <em>work</em>?
source: Answer for the place where you spend the most time. Even if ill, on maternity leave, holiday or temporarily laid off provide details of your main place of work.
ga: Freagair don áit ina gcaitheann tú an méid is mó ama. Fiú má tá tú tinn, ar shaoire mháithreachais nó scaoilte chun bealaigh go sealadach, tabhair sonraí ar do phríomháit oibre.

# Where is <em>{person_name_possessive}</em> main place of <em>work</em>?
source: Answer for the place where <em>{person_name}</em> spends the most time. Even if ill, on maternity leave, holiday or temporarily laid off provide details of their main place of work.
ga: Freagair don áit ina gcaitheann <em>{person_name}</em> an méid is mó ama. Fiú má tá siad tinn, ar shaoire mháithreachais nó scaoilte chun bealaigh go sealadach, tabhair sonraí ar a bpríomháit oibre.

# Where did you mainly <em>work</em>?
source: Answer for the place where you spent the most time.
ga: Freagair don áit inar chaith tú an méid ba mhó ama.

# Where did <em>{person_name}</em> mainly <em>work</em>?
source: Answer for the place where <em>{person_name}</em> spent the most time.
ga: Freagair don áit inar chaith <em>{person_name}</em> an méid ba mhó ama.

# How do you usually travel to your main place of <em>work</em>?
source: Answer for the longest part, by distance, of your usual journey to work
ga: Tabhair freagra faoin chuid is mó, de réir faid, de do thuras go dtí d'áit oibre

source: Answer for the longest part, by distance, of their usual journey to work
ga: Tabhair freagra faoin chuid is mó, de réir faid, dá dturas go dtí a n-áit oibre

# How did you usually travel to your main place of <em>work</em>?
source: Answer for the longest part, by distance, of your usual journey to work
ga: Tabhair freagra faoin chuid is mó, de réir faid, de do thuras go dtí d'áit oibre

source: Answer for the longest part, by distance, of their usual journey to work
ga: Tabhair freagra faoin chuid is mó, de réir faid, dá dturas go dtí a n-áit oibre

# Where is your main place of <em>study</em>?
source: Answer for the place where you spend the most time. If student or schoolchild, answer for your study address.
ga: Freagair don áit ina gcaitheann tú an méid is mó ama. Más mac léinn nó páiste scoile thú, freagair do do sheoladh staidéir.

# Where is <em>{person_name_possessive}</em> main place of <em>study</em>?
source: Answer for the place where <em>{person_name}</em> spends the most time. If student or schoolchild, answer for their study address.
ga: Freagair don áit ina gcaitheann <em>{person_name}</em> an méid is mó dá gcuid ama. Más mac léinn nó páiste scoile iad, freagair dá seoladh staidéir.

source: Answer for the longest part, by distance, of your usual journey to your place of study
ga: Cuir isteach freagra don chuid is faide, de réir faid, de do ghnáth-thuras chuig d’áit staidéir

source: Answer for the longest part, by distance, of their usual journey to their place of study
ga: Cuir isteach freagra don chuid is faide, de réir faid, dá ngnáth-thuras chuig a n-áit staidéir

# What is <em>{person_name_possessive}</em> date of birth?
source: For example, 31 3 1970
ga: Mar shampla, 31 3 1970

# Are you sure you want to remove <em>{person_name}</em>?
source: All of the information entered about this person will be deleted
ga: Scriosfar an t-eolas uilig a cuireadh isteach faoin duine seo

# Do you usually live at {household_address}?
source: What we mean by “usually live”
ga: An chiall atá againn do “cónaíonn de ghnáth”

source: Who to include
ga: Daoine atá san áireamh

source: Who to include
ga: Daoine atá san áireamh

# What passports do you hold?
source: What passports and travel documents to include
ga: Cé na pasanna agus doiciméid taistil lena n-áirítear

# What passports does <em>{person_name}</em> hold?
source: What passports and travel documents to include
ga: Cé na pasanna agus doiciméid taistil lena n-áirítear

# What is your main language?
source: What we mean by “main language”
ga: An chiall atá againn do “príomhtheanga”

# What is <em>{person_name_possessive}</em> main language?
source: What we mean by “main language”
ga: An chiall atá againn do “príomhtheanga”

# Do you usually live at {household_address}?
source: This is often your permanent or family home.
ga: Is minic gurb é seo do bhaile buan nó teaghlaigh.

# Do you usually live at {household_address}?
source: If you have more than one address, include yourself at the home address where you spend most of your time. If you split your time equally then use the home address where you are staying overnight on {census_date}.
ga: Má tá níos mó ná seoladh amháin agat, cuir thú féin san áireamh ag an seoladh baile áit a gcaitheann tú bunús do chuid ama. Má roinneann tú do chuid ama go cothrom, úsáid an seoladh baile ina bhfuil tú ag fanacht thar oíche ar {census_date}.

# Do you usually live at {household_address}?
source: <strong>Students</strong>, include yourself at both your term-time and out of term-time addresses.
ga: <strong>Mac léinn</strong>, cuir thú féin san áireamh ag do sheoladh am téarma agus ag do sheoladh eile.

# Do you usually live at {household_address}?
source: <strong>Armed forces members</strong>, include yourself at your home address if you have one.
ga: <strong>Baill de na fórsaí armtha</strong>, bígí do bhur gcur isteach féin ag bhur seoladh baile má tá seoladh agaibh.

source: This is often their permanent or family home.
ga: Is minic gurb é seo a mbaile buan nó teaghlaigh.

source: If someone has more than one home address, include them at this address if they generally spend most of their time here. For example, children whose parents live apart. If they split their time equally then include them at this address if they are staying overnight on {census_date}.
ga: Má tá níos mó ná seoladh amháin ag duine, cuir san áireamh iad ag an seoladh seo más anseo a chaitheann siad bunús a gcuid ama de ghnáth. Mar shampla, páistí nach gcónaíonn a dtuismitheoirí le chéile. Má roinneann siad a gcuid ama go cothrom, cuir san áireamh iad ag an seoladh seo iad má tá siad ag fanacht thar oíche ar {census_date}.

source: Remember to include
ga: Cuimnhigh a chur san áireamh

source: This is often their permanent or family home.
ga: Is minic gurb é seo a mbaile buan nó teaghlaigh.

source: If someone has more than one home address, include them at this address if they generally spend most of their time here. For example, children whose parents live apart. If they split their time equally then include them at this address if they are staying overnight on {census_date}.
ga: Má tá níos mó ná seoladh amháin ag duine, cuir san áireamh iad ag an seoladh seo más anseo a chaitheann siad bunús a gcuid ama de ghnáth. Mar shampla, páistí nach gcónaíonn a dtuismitheoirí le chéile. Má roinneann siad a gcuid ama go cothrom, cuir san áireamh iad ag an seoladh seo iad má tá siad ag fanacht thar oíche ar {census_date}.

source: Remember to include
ga: Cuimnhigh a chur san áireamh

# What passports do you hold?
source: Include current passports and any other travel documents, including those that are expired, if you are entitled to renew them.
ga: Cuir san áireamh pasanna agus doiciméid taistil eile, lena n-áirítear iad sin atá imithe in éag, má tá tú i dteideal iad a athnuachan.

# What passports does <em>{person_name}</em> hold?
source: Include current passports and any other travel documents, including those that are expired, if they are entitled to renew them.
ga: Cuir san áireamh pasanna agus doiciméid taistil eile, lena n-áirítear iad sin atá imithe in éag, má tá siad i dteideal iad a athnuachan.

# What is your main language?
source: Main language is your first or preferred language.
ga: Is í an phríomhtheanga do chéad teanga nó an teanga is fearr leat.

# What is <em>{person_name_possessive}</em> main language?
source: Main language is their first or preferred language.
ga: Is í an phríomhtheanga an chéad teanga s'acu nó an teanga is fearr leo.

source: <strong>students</strong>, if this is either their term-time or their out of term-time address
ga: <strong>mic léinn</strong>, más é seo a seoladh am téarma nó seoladh eile

source: <strong>people with a second address for work</strong>, if this is their home address
ga: <strong>daoine a bhfuil an dara seoladh acu dá gcuid oibre</strong>, más é seo a seoladh baile

source: <strong>armed forces members</strong>, if this is their home address
ga: <strong>baill de na fórsaí armtha</strong>, más é seo a seoladh baile

source: <strong>students</strong>, if this is either their term-time or their out of term-time address
ga: <strong>mic léinn</strong>, más é seo a seoladh am téarma nó seoladh eile

source: <strong>people with a second address for work</strong>, if this is their home address
ga: <strong>daoine a bhfuil an dara seoladh acu dá gcuid oibre</strong>, más é seo a seoladh baile

source: <strong>armed forces members</strong>, if this is their home address
ga: <strong>baill de na fórsaí armtha</strong>, más é seo a seoladh baile

source: <p>Remember to include people who are</p>
ga: <p>Cuimhnigh daoine a chur san áireamh atá</p>

source: Temporarily away
ga: Ar shiúl go sealadach

source: Temporarily staying
ga: Ar fanacht go sealadach

# Are any of these people related to you?
source: Remember to include partners, step-parents and stepchildren as related
ga: Cuimhnigh páirtnéirí, leastuismitheoirí agus leaspháistí a chumsiú mar ghaolta

# Are any of these people related to <em>{person_name}</em>?
source: Remember to include partners, step-parents and stepchildren as related
ga: Cuimhnigh páirtnéirí, leastuismitheoirí agus leaspháistí a chumsiú mar ghaolta

# What type of central heating does <em>{household_address}</em> have?
source: Include central heating systems that generate heat for multiple rooms whether or not you use them
ga: Cuir na córais teasa lárnaigh a ghineann teas d'ilsheomraí cé acu a úsáideann tú nó nach n-úsáideann tú iad san áireamh

source: Include any company cars or vans available for private use
ga: Cuir gluaisteáin no veain comhlachta ar bith atá ar fáil le húsáid go príobháideach san áireamh

source: Include problems relating to old age
ga: Luaigh fadhbanna a bhaineann le seanaois

source: Include problems relating to old age
ga: Luaigh fadhbanna a bhaineann le seanaois

source: Exclude anything you do in paid employment
ga: Fág rud ar bith ar lár a dhéanann tú mar chuid de d'fhostaíocht íoctha

source: Exclude anything they do in paid employment
ga: Fág rud ar bith ar lár a dhéanann siad mar chuid dá bhfostaíocht íoctha

# Have you achieved a qualification at degree level or above?
source: Include equivalent qualifications achieved anywhere outside Northern Ireland
ga: Luaigh comhcháilíochtaí bainte amach áit ar bith taobh amuigh de Thuaisceart Éireann

# Has <em>{person_name}</em> achieved a qualification at degree level or above?
source: Include equivalent qualifications achieved anywhere outside Northern Ireland
ga: Luaigh comhcháilíochtaí bainte amach áit ar bith taobh amuigh de Thuaisceart Éireann

# Have you achieved a GCSE or equivalent qualification?
source: Include equivalent qualifications achieved anywhere outside Northern Ireland
ga: Luaigh comhcháilíochtaí bainte amach áit ar bith taobh amuigh de Thuaisceart Éireann

# Has <em>{person_name}</em> achieved a GCSE or equivalent qualification?
source: Include equivalent qualifications achieved anywhere outside Northern Ireland
ga: Luaigh comhcháilíochtaí bainte amach áit ar bith taobh amuigh de Thuaisceart Éireann

# Have you achieved an A level, AS level or equivalent qualifications?
source: Include equivalent qualifications achieved anywhere outside Northern Ireland
ga: Luaigh comhcháilíochtaí bainte amach áit ar bith taobh amuigh de Thuaisceart Éireann

source: Include equivalent qualifications achieved anywhere outside Northern Ireland
ga: Luaigh comhcháilíochtaí bainte amach áit ar bith taobh amuigh de Thuaisceart Éireann

# Have you achieved an NVQ or equivalent qualification?
source: Include equivalent qualifications achieved anywhere outside Northern Ireland
ga: Luaigh comhcháilíochtaí bainte amach áit ar bith taobh amuigh de Thuaisceart Éireann

# Has <em>{person_name}</em> achieved an NVQ or equivalent qualification?
source: Include equivalent qualifications achieved anywhere outside Northern Ireland
ga: Luaigh comhcháilíochtaí bainte amach áit ar bith taobh amuigh de Thuaisceart Éireann

# Have you achieved any other qualifications?
source: Include qualifications achieved either within or outside Northern Ireland
ga: Cuimsigh cáilíochtaí a baineadh amach i dTuaisceart Éireann nó in áit eile

# Has <em>{person_name}</em> achieved any other qualifications?
source: Include qualifications achieved either within or outside Northern Ireland
ga: Cuimsigh cáilíochtaí a baineadh amach i dTuaisceart Éireann nó in áit eile

# Have you completed an apprenticeship?
source: Include equivalent apprenticeships completed anywhere outside Northern Ireland
ga: Luaigh printíseachtaí comhionanna críochnaithe áit ar bith taobh amuigh de Thuaisceart Éireann

# Has <em>{person_name}</em> completed an apprenticeship?
source: Include equivalent apprenticeships completed anywhere outside Northern Ireland
ga: Luaigh printíseachtaí comhionanna críochnaithe áit ar bith taobh amuigh de Thuaisceart Éireann

# In the last seven days, were you doing any of the following?
source: Include casual or temporary work, even if only for one hour
ga: Luaigh obair ócáideach nó shealadach, fiú má oibríonn tú ar feadh aon uair amháin

# In the last seven days, was <em>{person_name}</em> doing any of the following?
source: Include casual or temporary work, even if only for one hour
ga: Luaigh obair ócáideach nó shealadach, fiú má oibríonn tú ar feadh aon uair amháin

# In your main job, how many hours a week do you usually work?
source: Include paid and unpaid overtime
ga: Cuimsigh ragobair íoctha agus neamhíoctha

source: Include paid and unpaid overtime
ga: Cuimsigh ragobair íoctha agus neamhíoctha

# In your main job, how many hours a week did you usually work?
source: Include paid and unpaid overtime
ga: Cuimsigh ragobair íoctha agus neamhíoctha

source: Include paid and unpaid overtime
ga: Luaigh ragobair íoctha agus neamhíoctha

source: students and schoolchildren who live away from home during term time
ga: mic léinn agus páistí scoile a chónaíonn ar shiúl ón bhaile le linn am téarma
